JayHeng/imxrt-tool-flash-algo/boards/nxp_evkmimxrt1180_rev.c/flash_algo_c0_silicon/Keil_JLink/rom_api/MIMXRT1189_cm7.h
    kXBAR3_InputQtimer3Timer2       = 18|0x300U,   /**< QTIMER3_TIMER2 output assigned to XBAR3_IN18 input. */
    kXBAR3_InputQtimer3Timer3       = 19|0x300U,   /**< QTIMER3_TIMER3 output assigned to XBAR3_IN19 input. */
    kXBAR3_InputQtimer4Timer0       = 20|0x300U,   /**< QTIMER4_TIMER0 output assigned to XBAR3_IN20 input. */
    kXBAR3_InputQtimer4Timer1       = 21|0x300U,   /**< QTIMER4_TIMER1 output assigned to XBAR3_IN21 input. */
    kXBAR3_InputQtimer4Timer2       = 22|0x300U,   /**< QTIMER4_TIMER2 output assigned to XBAR3_IN22 input. */
    kXBAR3_InputQtimer4Timer3       = 23|0x300U,   /**< QTIMER4_TIMER3 output assigned to XBAR3_IN23 input. */
    kXBAR3_InputQtimer5Timer0       = 24|0x300U,   /**< QTIMER5_TIMER0 output assigned to XBAR3_IN24 input. */
    kXBAR3_InputQtimer5Timer1       = 25|0x300U,   /**< QTIMER5_TIMER1 output assigned to XBAR3_IN25 input. */
    kXBAR3_InputQtimer5Timer2       = 26|0x300U,   /**< QTIMER5_TIMER2 output assigned to XBAR3_IN26 input. */
    kXBAR3_InputQtimer5Timer3       = 27|0x300U,   /**< QTIMER5_TIMER3 output assigned to XBAR3_IN27 input. */
    kXBAR3_InputQtimer6Timer0       = 28|0x300U,   /**< QTIMER6_TIMER0 output assigned to XBAR3_IN28 input. */
    kXBAR3_InputQtimer6Timer1       = 29|0x300U,   /**< QTIMER6_TIMER1 output assigned to XBAR3_IN29 input. */
    kXBAR3_InputQtimer6Timer2       = 30|0x300U,   /**< QTIMER6_TIMER2 output assigned to XBAR3_IN30 input. */
    kXBAR3_InputQtimer6Timer3       = 31|0x300U,   /**< QTIMER6_TIMER3 output assigned to XBAR3_IN31 input. */
    kXBAR3_InputQtimer7Timer0       = 32|0x300U,   /**< QTIMER7_TIMER0 output assigned to XBAR3_IN32 input. */
    kXBAR3_InputQtimer7Timer1       = 33|0x300U,   /**< QTIMER7_TIMER1 output assigned to XBAR3_IN33 input. */
    kXBAR3_InputQtimer7Timer2       = 34|0x300U,   /**< QTIMER7_TIMER2 output assigned to XBAR3_IN34 input. */
    kXBAR3_InputQtimer7Timer3       = 35|0x300U,   /**< QTIMER7_TIMER3 output assigned to XBAR3_IN35 input. */
    kXBAR3_InputQtimer8Timer0       = 36|0x300U,   /**< QTIMER8_TIMER0 output assigned to XBAR3_IN36 input. */
    kXBAR3_InputQtimer8Timer1       = 37|0x300U,   /**< QTIMER8_TIMER1 output assigned to XBAR3_IN37 input. */
    kXBAR3_InputQtimer8Timer2       = 38|0x300U,   /**< QTIMER8_TIMER2 output assigned to XBAR3_IN38 input. */
    kXBAR3_InputQtimer8Timer3       = 39|0x300U,   /**< QTIMER8_TIMER3 output assigned to XBAR3_IN39 input. */
    kXBAR3_InputFlexpwm1Pwm0OutTrig01 = 40|0x300U, /**< FLEXPWM1_PWM0_OUT_TRIG0_1 output assigned to XBAR3_IN40 input. */
    kXBAR3_InputFlexpwm1Pwm1OutTrig01 = 41|0x300U, /**< FLEXPWM1_PWM1_OUT_TRIG0_1 output assigned to XBAR3_IN41 input. */
    kXBAR3_InputFlexpwm1Pwm2OutTrig01 = 42|0x300U, /**< FLEXPWM1_PWM2_OUT_TRIG0_1 output assigned to XBAR3_IN42 input. */
    kXBAR3_InputFlexpwm1Pwm3OutTrig01 = 43|0x300U, /**< FLEXPWM1_PWM3_OUT_TRIG0_1 output assigned to XBAR3_IN43 input. */
    kXBAR3_InputFlexpwm2Pwm0OutTrig01 = 44|0x300U, /**< FLEXPWM2_PWM0_OUT_TRIG0_1 output assigned to XBAR3_IN44 input. */
    kXBAR3_InputFlexpwm2Pwm1OutTrig01 = 45|0x300U, /**< FLEXPWM2_PWM1_OUT_TRIG0_1 output assigned to XBAR3_IN45 input. */
    kXBAR3_InputFlexpwm2Pwm2OutTrig01 = 46|0x300U, /**< FLEXPWM2_PWM2_OUT_TRIG0_1 output assigned to XBAR3_IN46 input. */
    kXBAR3_InputFlexpwm2Pwm3OutTrig01 = 47|0x300U, /**< FLEXPWM2_PWM3_OUT_TRIG0_1 output assigned to XBAR3_IN47 input. */
    kXBAR3_InputFlexpwm3Pwm0OutTrig01 = 48|0x300U, /**< FLEXPWM3_PWM0_OUT_TRIG0_1 output assigned to XBAR3_IN48 input. */
    kXBAR3_InputFlexpwm3Pwm1OutTrig01 = 49|0x300U, /**< FLEXPWM3_PWM1_OUT_TRIG0_1 output assigned to XBAR3_IN49 input. */
    kXBAR3_InputFlexpwm3Pwm2OutTrig01 = 50|0x300U, /**< FLEXPWM3_PWM2_OUT_TRIG0_1 output assigned to XBAR3_IN50 input. */
    kXBAR3_InputFlexpwm3Pwm3OutTrig01 = 51|0x300U, /**< FLEXPWM3_PWM3_OUT_TRIG0_1 output assigned to XBAR3_IN51 input. */
    kXBAR3_InputFlexpwm4Pwm0OutTrig01 = 52|0x300U, /**< FLEXPWM4_PWM0_OUT_TRIG0_1 output assigned to XBAR3_IN52 input. */
    kXBAR3_InputFlexpwm4Pwm1OutTrig01 = 53|0x300U, /**< FLEXPWM4_PWM1_OUT_TRIG0_1 output assigned to XBAR3_IN53 input. */
    kXBAR3_InputFlexpwm4Pwm2OutTrig01 = 54|0x300U, /**< FLEXPWM4_PWM2_OUT_TRIG0_1 output assigned to XBAR3_IN54 input. */
    kXBAR3_InputFlexpwm4Pwm3OutTrig01 = 55|0x300U, /**< FLEXPWM4_PWM3_OUT_TRIG0_1 output assigned to XBAR3_IN55 input. */
    kXBAR3_InputPit1Trigger0        = 56|0x300U,   /**< PIT1_TRIGGER0 output assigned to XBAR3_IN56 input. */
    kXBAR3_InputPit1Trigger1        = 57|0x300U,   /**< PIT1_TRIGGER1 output assigned to XBAR3_IN57 input. */
    kXBAR3_InputPit1Trigger2        = 58|0x300U,   /**< PIT1_TRIGGER2 output assigned to XBAR3_IN58 input. */
    kXBAR3_InputPit1Trigger3        = 59|0x300U,   /**< PIT1_TRIGGER3 output assigned to XBAR3_IN59 input. */
    kXBAR3_InputPit2Trigger0        = 60|0x300U,   /**< PIT2_TRIGGER0 output assigned to XBAR3_IN60 input. */
    kXBAR3_InputPit2Trigger1        = 61|0x300U,   /**< PIT2_TRIGGER1 output assigned to XBAR3_IN61 input. */
    kXBAR3_InputPit2Trigger2        = 62|0x300U,   /**< PIT2_TRIGGER2 output assigned to XBAR3_IN62 input. */
    kXBAR3_InputPit2Trigger3        = 63|0x300U,   /**< PIT2_TRIGGER3 output assigned to XBAR3_IN63 input. */
    kXBAR3_InputPit3Trigger0        = 64|0x300U,   /**< PIT3_TRIGGER0 output assigned to XBAR3_IN64 input. */
    kXBAR3_InputPit3Trigger1        = 65|0x300U,   /**< PIT3_TRIGGER1 output assigned to XBAR3_IN65 input. */
    kXBAR3_InputPit3Trigger2        = 66|0x300U,   /**< PIT3_TRIGGER2 output assigned to XBAR3_IN66 input. */
    kXBAR3_InputPit3Trigger3        = 67|0x300U,   /**< PIT3_TRIGGER3 output assigned to XBAR3_IN67 input. */
    kXBAR3_InputSinc2PulseTrigger0  = 68|0x300U,   /**< SINC2_PULSE_TRIGGER0 output assigned to XBAR3_IN68 input. */
    kXBAR3_InputSinc2PulseTrigger1  = 69|0x300U,   /**< SINC2_PULSE_TRIGGER1 output assigned to XBAR3_IN69 input. */
    kXBAR3_InputSinc2PulseTrigger2  = 70|0x300U,   /**< SINC2_PULSE_TRIGGER2 output assigned to XBAR3_IN70 input. */
    kXBAR3_InputSinc2PulseTrigger3  = 71|0x300U,   /**< SINC2_PULSE_TRIGGER3 output assigned to XBAR3_IN71 input. */
    kXBAR3_InputDma4TriggerOut0     = 72|0x300U,   /**< DMA4_TRIGGER_OUT0 output assigned to XBAR3_IN72 input. */
    kXBAR3_InputDma4TriggerOut1     = 73|0x300U,   /**< DMA4_TRIGGER_OUT1 output assigned to XBAR3_IN73 input. */
    kXBAR3_InputDma4TriggerOut2     = 74|0x300U,   /**< DMA4_TRIGGER_OUT2 output assigned to XBAR3_IN74 input. */
    kXBAR3_InputDma4TriggerOut3     = 75|0x300U,   /**< DMA4_TRIGGER_OUT3 output assigned to XBAR3_IN75 input. */
    kXBAR3_InputDma4TriggerOut4     = 76|0x300U,   /**< DMA4_TRIGGER_OUT4 output assigned to XBAR3_IN76 input. */
    kXBAR3_InputDma4TriggerOut5     = 77|0x300U,   /**< DMA4_TRIGGER_OUT5 output assigned to XBAR3_IN77 input. */
    kXBAR3_InputDma4TriggerOut6     = 78|0x300U,   /**< DMA4_TRIGGER_OUT6 output assigned to XBAR3_IN78 input. */
    kXBAR3_InputDma4TriggerOut7     = 79|0x300U,   /**< DMA4_TRIGGER_OUT7 output assigned to XBAR3_IN79 input. */
    kXBAR3_InputDma3TriggerOut0     = 80|0x300U,   /**< DMA3_TRIGGER_OUT0 output assigned to XBAR3_IN80 input. */
    kXBAR3_InputDma3TriggerOut1     = 81|0x300U,   /**< DMA3_TRIGGER_OUT1 output assigned to XBAR3_IN81 input. */
    kXBAR3_InputDma3TriggerOut2     = 82|0x300U,   /**< DMA3_TRIGGER_OUT2 output assigned to XBAR3_IN82 input. */
    kXBAR3_InputDma3TriggerOut3     = 83|0x300U,   /**< DMA3_TRIGGER_OUT3 output assigned to XBAR3_IN83 input. */
    kXBAR3_InputDma3TriggerOut4     = 84|0x300U,   /**< DMA3_TRIGGER_OUT4 output assigned to XBAR3_IN84 input. */
    kXBAR3_InputDma3TriggerOut5     = 85|0x300U,   /**< DMA3_TRIGGER_OUT5 output assigned to XBAR3_IN85 input. */
    kXBAR3_InputDma3TriggerOut6     = 86|0x300U,   /**< DMA3_TRIGGER_OUT6 output assigned to XBAR3_IN86 input. */
    kXBAR3_InputDma3TriggerOut7     = 87|0x300U,   /**< DMA3_TRIGGER_OUT7 output assigned to XBAR3_IN87 input. */
    kXBAR3_InputAdc1TcompPulse0     = 88|0x300U,   /**< ADC1_TCOMP_PULSE0 output assigned to XBAR3_IN88 input. */
    kXBAR3_InputAdc1TcompPulse1     = 89|0x300U,   /**< ADC1_TCOMP_PULSE1 output assigned to XBAR3_IN89 input. */
    kXBAR3_InputAdc1TcompPulse2     = 90|0x300U,   /**< ADC1_TCOMP_PULSE2 output assigned to XBAR3_IN90 input. */
    kXBAR3_InputAdc1TcompPulse3     = 91|0x300U,   /**< ADC1_TCOMP_PULSE3 output assigned to XBAR3_IN91 input. */
    kXBAR3_InputAdc1TcompPulse4     = 92|0x300U,   /**< ADC1_TCOMP_PULSE4 output assigned to XBAR3_IN92 input. */
    kXBAR3_InputAdc1TcompPulse5     = 93|0x300U,   /**< ADC1_TCOMP_PULSE5 output assigned to XBAR3_IN93 input. */
    kXBAR3_InputAdc1TcompPulse6     = 94|0x300U,   /**< ADC1_TCOMP_PULSE6 output assigned to XBAR3_IN94 input. */
    kXBAR3_InputAdc1TcompPulse7     = 95|0x300U,   /**< ADC1_TCOMP_PULSE7 output assigned to XBAR3_IN95 input. */
    kXBAR3_InputAdc2TcompPulse0     = 96|0x300U,   /**< ADC2_TCOMP_PULSE0 output assigned to XBAR3_IN96 input. */
    kXBAR3_InputAdc2TcompPulse1     = 97|0x300U,   /**< ADC2_TCOMP_PULSE1 output assigned to XBAR3_IN97 input. */
    kXBAR3_InputAdc2TcompPulse2     = 98|0x300U,   /**< ADC2_TCOMP_PULSE2 output assigned to XBAR3_IN98 input. */
    kXBAR3_InputAdc2TcompPulse3     = 99|0x300U,   /**< ADC2_TCOMP_PULSE3 output assigned to XBAR3_IN99 input. */
    kXBAR3_InputAdc2TcompPulse4     = 100|0x300U,  /**< ADC2_TCOMP_PULSE4 output assigned to XBAR3_IN100 input. */
    kXBAR3_InputAdc2TcompPulse5     = 101|0x300U,  /**< ADC2_TCOMP_PULSE5 output assigned to XBAR3_IN101 input. */
    kXBAR3_InputAdc2TcompPulse6     = 102|0x300U,  /**< ADC2_TCOMP_PULSE6 output assigned to XBAR3_IN102 input. */
    kXBAR3_InputAdc2TcompPulse7     = 103|0x300U,  /**< ADC2_TCOMP_PULSE7 output assigned to XBAR3_IN103 input. */
    kXBAR3_InputTpm1ChTrigger0      = 104|0x300U,  /**< TPM1_CH_TRIGGER0 output assigned to XBAR3_IN104 input. */
    kXBAR3_InputTpm1ChTrigger1      = 105|0x300U,  /**< TPM1_CH_TRIGGER1 output assigned to XBAR3_IN105 input. */
    kXBAR3_InputTpm1ChTrigger2      = 106|0x300U,  /**< TPM1_CH_TRIGGER2 output assigned to XBAR3_IN106 input. */
    kXBAR3_InputTpm1ChTrigger3      = 107|0x300U,  /**< TPM1_CH_TRIGGER3 output assigned to XBAR3_IN107 input. */
    kXBAR3_InputTpm1Trigger         = 108|0x300U,  /**< TPM1_TRIGGER output assigned to XBAR3_IN108 input. */
    kXBAR3_InputTpm2ChTrigger0      = 109|0x300U,  /**< TPM2_CH_TRIGGER0 output assigned to XBAR3_IN109 input. */
    kXBAR3_InputTpm2ChTrigger1      = 110|0x300U,  /**< TPM2_CH_TRIGGER1 output assigned to XBAR3_IN110 input. */
    kXBAR3_InputTpm2ChTrigger2      = 111|0x300U,  /**< TPM2_CH_TRIGGER2 output assigned to XBAR3_IN111 input. */
    kXBAR3_InputTpm2ChTrigger3      = 112|0x300U,  /**< TPM2_CH_TRIGGER3 output assigned to XBAR3_IN112 input. */
    kXBAR3_InputTpm2Trigger         = 113|0x300U,  /**< TPM2_TRIGGER output assigned to XBAR3_IN113 input. */
    kXBAR3_InputTpm3ChTrigger0      = 114|0x300U,  /**< TPM3_CH_TRIGGER0 output assigned to XBAR3_IN114 input. */
    kXBAR3_InputTpm3ChTrigger1      = 115|0x300U,  /**< TPM3_CH_TRIGGER1 output assigned to XBAR3_IN115 input. */
    kXBAR3_InputTpm3ChTrigger2      = 116|0x300U,  /**< TPM3_CH_TRIGGER2 output assigned to XBAR3_IN116 input. */
    kXBAR3_InputTpm3ChTrigger3      = 117|0x300U,  /**< TPM3_CH_TRIGGER3 output assigned to XBAR3_IN117 input. */
    kXBAR3_InputTpm3Trigger         = 118|0x300U,  /**< TPM3_TRIGGER output assigned to XBAR3_IN118 input. */
    kXBAR3_InputTpm4ChTrigger0      = 119|0x300U,  /**< TPM4_CH_TRIGGER0 output assigned to XBAR3_IN119 input. */
    kXBAR3_InputTpm4ChTrigger1      = 120|0x300U,  /**< TPM4_CH_TRIGGER1 output assigned to XBAR3_IN120 input. */
    kXBAR3_InputTpm4ChTrigger2      = 121|0x300U,  /**< TPM4_CH_TRIGGER2 output assigned to XBAR3_IN121 input. */
    kXBAR3_InputTpm4ChTrigger3      = 122|0x300U,  /**< TPM4_CH_TRIGGER3 output assigned to XBAR3_IN122 input. */
    kXBAR3_InputTpm4Trigger         = 123|0x300U,  /**< TPM4_TRIGGER output assigned to XBAR3_IN123 input. */
    kXBAR3_InputTpm5ChTrigger0      = 124|0x300U,  /**< TPM5_CH_TRIGGER0 output assigned to XBAR3_IN124 input. */
    kXBAR3_InputTpm5ChTrigger1      = 125|0x300U,  /**< TPM5_CH_TRIGGER1 output assigned to XBAR3_IN125 input. */
    kXBAR3_InputTpm5ChTrigger2      = 126|0x300U,  /**< TPM5_CH_TRIGGER2 output assigned to XBAR3_IN126 input. */
    kXBAR3_InputTpm5ChTrigger3      = 127|0x300U,  /**< TPM5_CH_TRIGGER3 output assigned to XBAR3_IN127 input. */
    kXBAR3_InputTpm5Trigger         = 128|0x300U,  /**< TPM5_TRIGGER output assigned to XBAR3_IN128 input. */
    kXBAR3_InputTpm6ChTrigger0      = 129|0x300U,  /**< TPM6_CH_TRIGGER0 output assigned to XBAR3_IN129 input. */
    kXBAR3_InputTpm6ChTrigger1      = 130|0x300U,  /**< TPM6_CH_TRIGGER1 output assigned to XBAR3_IN130 input. */
    kXBAR3_InputTpm6ChTrigger2      = 131|0x300U,  /**< TPM6_CH_TRIGGER2 output assigned to XBAR3_IN131 input. */
    kXBAR3_InputTpm6ChTrigger3      = 132|0x300U,  /**< TPM6_CH_TRIGGER3 output assigned to XBAR3_IN132 input. */
    kXBAR3_InputTpm6Trigger         = 133|0x300U,  /**< TPM6_TRIGGER output assigned to XBAR3_IN133 input. */
    kXBAR3_InputLptmr1TriggerDelay  = 134|0x300U,  /**< LPTMR1_TRIGGER_DELAY output assigned to XBAR3_IN134 input. */
    kXBAR3_InputLptmr2TriggerDelay  = 135|0x300U,  /**< LPTMR2_TRIGGER_DELAY output assigned to XBAR3_IN135 input. */
    kXBAR3_InputLptmr3TriggerDelay  = 136|0x300U,  /**< LPTMR3_TRIGGER_DELAY output assigned to XBAR3_IN136 input. */
    kXBAR3_InputNetcTmrPp1          = 137|0x300U,  /**< NETC_TMR_PP1 output assigned to XBAR3_IN137 input. */
    kXBAR3_InputNetcTmrPp2          = 138|0x300U,  /**< NETC_TMR_PP2 output assigned to XBAR3_IN138 input. */
    kXBAR3_InputNetcTmrPp3          = 139|0x300U,  /**< NETC_TMR_PP3 output assigned to XBAR3_IN139 input. */
    kXBAR3_InputSinc1IppDoBreak0    = 140|0x300U,  /**< SINC1_IPP_DO_BREAK0 output assigned to XBAR3_IN140 input. */
    kXBAR3_InputSinc1IppDoBreak1    = 141|0x300U,  /**< SINC1_IPP_DO_BREAK1 output assigned to XBAR3_IN141 input. */
    kXBAR3_InputSinc1IppDoBreak2    = 142|0x300U,  /**< SINC1_IPP_DO_BREAK2 output assigned to XBAR3_IN142 input. */
    kXBAR3_InputSinc1IppDoBreak3    = 143|0x300U,  /**< SINC1_IPP_DO_BREAK3 output assigned to XBAR3_IN143 input. */
    kXBAR3_InputSinc2IppDoBreak0    = 144|0x300U,  /**< SINC2_IPP_DO_BREAK0 output assigned to XBAR3_IN144 input. */
    kXBAR3_InputSinc2IppDoBreak1    = 145|0x300U,  /**< SINC2_IPP_DO_BREAK1 output assigned to XBAR3_IN145 input. */
    kXBAR3_InputSinc2IppDoBreak2    = 146|0x300U,  /**< SINC2_IPP_DO_BREAK2 output assigned to XBAR3_IN146 input. */
    kXBAR3_InputSinc2IppDoBreak3    = 147|0x300U,  /**< SINC2_IPP_DO_BREAK3 output assigned to XBAR3_IN147 input. */
    kXBAR3_InputSinc3IppDoBreak0    = 148|0x300U,  /**< SINC3_IPP_DO_BREAK0 output assigned to XBAR3_IN148 input. */
    kXBAR3_InputSinc3IppDoBreak1    = 149|0x300U,  /**< SINC3_IPP_DO_BREAK1 output assigned to XBAR3_IN149 input. */
    kXBAR3_InputSinc3IppDoBreak2    = 150|0x300U,  /**< SINC3_IPP_DO_BREAK2 output assigned to XBAR3_IN150 input. */
    kXBAR3_InputSinc3IppDoBreak3    = 151|0x300U,  /**< SINC3_IPP_DO_BREAK3 output assigned to XBAR3_IN151 input. */
    kXBAR3_InputRESERVED152         = 152|0x300U,  /**< XBAR3_IN152 input is reserved. */
    kXBAR3_InputRESERVED153         = 153|0x300U,  /**< XBAR3_IN153 input is reserved. */
    kXBAR3_InputRESERVED154         = 154|0x300U,  /**< XBAR3_IN154 input is reserved. */
    kXBAR3_InputRESERVED155         = 155|0x300U,  /**< XBAR3_IN155 input is reserved. */
    kXBAR3_InputEqdc2PosMatch0      = 156|0x300U,  /**< EQDC2_POS_MATCH0 output assigned to XBAR3_IN156 input. */
    kXBAR3_InputEqdc2PosMatch1      = 157|0x300U,  /**< EQDC2_POS_MATCH1 output assigned to XBAR3_IN157 input. */
    kXBAR3_InputEqdc2PosMatch2      = 158|0x300U,  /**< EQDC2_POS_MATCH2 output assigned to XBAR3_IN158 input. */
    kXBAR3_InputEqdc2PosMatch3      = 159|0x300U,  /**< EQDC2_POS_MATCH3 output assigned to XBAR3_IN159 input. */
    kXBAR3_InputEqdc2CompFlg0       = 160|0x300U,  /**< EQDC2_COMP_FLG0 output assigned to XBAR3_IN160 input. */
    kXBAR3_InputEqdc2CompFlg1       = 161|0x300U,  /**< EQDC2_COMP_FLG1 output assigned to XBAR3_IN161 input. */
    kXBAR3_InputEqdc2CompFlg2       = 162|0x300U,  /**< EQDC2_COMP_FLG2 output assigned to XBAR3_IN162 input. */
    kXBAR3_InputEqdc2CompFlg3       = 163|0x300U,  /**< EQDC2_COMP_FLG3 output assigned to XBAR3_IN163 input. */
    kXBAR3_InputEqdc2CntDn          = 164|0x300U,  /**< EQDC2_CNT_DN output assigned to XBAR3_IN164 input. */
    kXBAR3_InputEqdc2CntUp          = 165|0x300U,  /**< EQDC2_CNT_UP output assigned to XBAR3_IN165 input. */
    kXBAR3_InputEqdc2CntDir         = 166|0x300U,  /**< EQDC2_CNT_DIR output assigned to XBAR3_IN166 input. */
    kXBAR3_InputEqdc4PosMatch0      = 167|0x300U,  /**< EQDC4_POS_MATCH0 output assigned to XBAR3_IN167 input. */
    kXBAR3_InputEqdc4PosMatch1      = 168|0x300U,  /**< EQDC4_POS_MATCH1 output assigned to XBAR3_IN168 input. */
    kXBAR3_InputEqdc4PosMatch2      = 169|0x300U,  /**< EQDC4_POS_MATCH2 output assigned to XBAR3_IN169 input. */
    kXBAR3_InputEqdc4PosMatch3      = 170|0x300U,  /**< EQDC4_POS_MATCH3 output assigned to XBAR3_IN170 input. */
    kXBAR3_InputEqdc4CompFlg0       = 171|0x300U,  /**< EQDC4_COMP_FLG0 output assigned to XBAR3_IN171 input. */
    kXBAR3_InputEqdc4CompFlg1       = 172|0x300U,  /**< EQDC4_COMP_FLG1 output assigned to XBAR3_IN172 input. */
    kXBAR3_InputEqdc4CompFlg2       = 173|0x300U,  /**< EQDC4_COMP_FLG2 output assigned to XBAR3_IN173 input. */
    kXBAR3_InputEqdc4CompFlg3       = 174|0x300U,  /**< EQDC4_COMP_FLG3 output assigned to XBAR3_IN174 input. */
    kXBAR3_InputEqdc4CntDn          = 175|0x300U,  /**< EQDC4_CNT_DN output assigned to XBAR3_IN175 input. */
    kXBAR3_InputEqdc4CntUp          = 176|0x300U,  /**< EQDC4_CNT_UP output assigned to XBAR3_IN176 input. */
    kXBAR3_InputEqdc4CntDir         = 177|0x300U,  /**< EQDC4_CNT_DIR output assigned to XBAR3_IN177 input. */
} xbar_input_signal_t;

