JayHeng/imxrt-tool-flash-algo/boards/nxp_evkmimxrt1180_rev.c/flash_algo_c0_silicon/Keil_JLink/rom_api/MIMXRT1189_cm7.h
    kXBAR2_OutputAoi1In05           = 5|0x200U,    /**< XBAR2_OUT5 output assigned to AOI1_IN05 */
    kXBAR2_OutputAoi1In06           = 6|0x200U,    /**< XBAR2_OUT6 output assigned to AOI1_IN06 */
    kXBAR2_OutputAoi1In07           = 7|0x200U,    /**< XBAR2_OUT7 output assigned to AOI1_IN07 */
    kXBAR2_OutputAoi1In08           = 8|0x200U,    /**< XBAR2_OUT8 output assigned to AOI1_IN08 */
    kXBAR2_OutputAoi1In09           = 9|0x200U,    /**< XBAR2_OUT9 output assigned to AOI1_IN09 */
    kXBAR2_OutputAoi1In10           = 10|0x200U,   /**< XBAR2_OUT10 output assigned to AOI1_IN10 */
    kXBAR2_OutputAoi1In11           = 11|0x200U,   /**< XBAR2_OUT11 output assigned to AOI1_IN11 */
    kXBAR2_OutputAoi1In12           = 12|0x200U,   /**< XBAR2_OUT12 output assigned to AOI1_IN12 */
    kXBAR2_OutputAoi1In13           = 13|0x200U,   /**< XBAR2_OUT13 output assigned to AOI1_IN13 */
    kXBAR2_OutputAoi1In14           = 14|0x200U,   /**< XBAR2_OUT14 output assigned to AOI1_IN14 */
    kXBAR2_OutputAoi1In15           = 15|0x200U,   /**< XBAR2_OUT15 output assigned to AOI1_IN15 */
    kXBAR2_OutputAoi3In0            = 16|0x200U,   /**< XBAR2_OUT16 output assigned to AOI3_IN0 */
    kXBAR2_OutputAoi3In1            = 17|0x200U,   /**< XBAR2_OUT17 output assigned to AOI3_IN1 */
    kXBAR2_OutputAoi3In2            = 18|0x200U,   /**< XBAR2_OUT18 output assigned to AOI3_IN2 */
    kXBAR2_OutputAoi3In3            = 19|0x200U,   /**< XBAR2_OUT19 output assigned to AOI3_IN3 */
    kXBAR2_OutputAoi3In4            = 20|0x200U,   /**< XBAR2_OUT20 output assigned to AOI3_IN4 */
    kXBAR2_OutputAoi3In5            = 21|0x200U,   /**< XBAR2_OUT21 output assigned to AOI3_IN5 */
    kXBAR2_OutputAoi3In6            = 22|0x200U,   /**< XBAR2_OUT22 output assigned to AOI3_IN6 */
    kXBAR2_OutputAoi3In7            = 23|0x200U,   /**< XBAR2_OUT23 output assigned to AOI3_IN7 */
    kXBAR2_OutputAoi3In8            = 24|0x200U,   /**< XBAR2_OUT24 output assigned to AOI3_IN8 */
    kXBAR2_OutputAoi3In9            = 25|0x200U,   /**< XBAR2_OUT25 output assigned to AOI3_IN9 */
    kXBAR2_OutputAoi3In10           = 26|0x200U,   /**< XBAR2_OUT26 output assigned to AOI3_IN10 */
    kXBAR2_OutputAoi3In11           = 27|0x200U,   /**< XBAR2_OUT27 output assigned to AOI3_IN11 */
    kXBAR2_OutputAoi3In12           = 28|0x200U,   /**< XBAR2_OUT28 output assigned to AOI3_IN12 */
    kXBAR2_OutputAoi3In13           = 29|0x200U,   /**< XBAR2_OUT29 output assigned to AOI3_IN13 */
    kXBAR2_OutputAoi3In14           = 30|0x200U,   /**< XBAR2_OUT30 output assigned to AOI3_IN14 */
    kXBAR2_OutputAoi3In15           = 31|0x200U,   /**< XBAR2_OUT31 output assigned to AOI3_IN15 */
    kXBAR3_OutputAoi2In00           = 0|0x300U,    /**< XBAR3_OUT0 output assigned to AOI2_IN00 */
    kXBAR3_OutputAoi2In01           = 1|0x300U,    /**< XBAR3_OUT1 output assigned to AOI2_IN01 */
    kXBAR3_OutputAoi2In02           = 2|0x300U,    /**< XBAR3_OUT2 output assigned to AOI2_IN02 */
    kXBAR3_OutputAoi2In03           = 3|0x300U,    /**< XBAR3_OUT3 output assigned to AOI2_IN03 */
    kXBAR3_OutputAoi2In04           = 4|0x300U,    /**< XBAR3_OUT4 output assigned to AOI2_IN04 */
    kXBAR3_OutputAoi2In05           = 5|0x300U,    /**< XBAR3_OUT5 output assigned to AOI2_IN05 */
    kXBAR3_OutputAoi2In06           = 6|0x300U,    /**< XBAR3_OUT6 output assigned to AOI2_IN06 */
    kXBAR3_OutputAoi2In07           = 7|0x300U,    /**< XBAR3_OUT7 output assigned to AOI2_IN07 */
    kXBAR3_OutputAoi2In08           = 8|0x300U,    /**< XBAR3_OUT8 output assigned to AOI2_IN08 */
    kXBAR3_OutputAoi2In09           = 9|0x300U,    /**< XBAR3_OUT9 output assigned to AOI2_IN09 */
    kXBAR3_OutputAoi2In10           = 10|0x300U,   /**< XBAR3_OUT10 output assigned to AOI2_IN10 */
    kXBAR3_OutputAoi2In11           = 11|0x300U,   /**< XBAR3_OUT11 output assigned to AOI2_IN11 */
    kXBAR3_OutputAoi2In12           = 12|0x300U,   /**< XBAR3_OUT12 output assigned to AOI2_IN12 */
    kXBAR3_OutputAoi2In13           = 13|0x300U,   /**< XBAR3_OUT13 output assigned to AOI2_IN13 */
    kXBAR3_OutputAoi2In14           = 14|0x300U,   /**< XBAR3_OUT14 output assigned to AOI2_IN14 */
    kXBAR3_OutputAoi2In15           = 15|0x300U,   /**< XBAR3_OUT15 output assigned to AOI2_IN15 */
    kXBAR3_OutputAoi4In0            = 16|0x300U,   /**< XBAR3_OUT16 output assigned to AOI4_IN0 */
    kXBAR3_OutputAoi4In1            = 17|0x300U,   /**< XBAR3_OUT17 output assigned to AOI4_IN1 */
    kXBAR3_OutputAoi4In2            = 18|0x300U,   /**< XBAR3_OUT18 output assigned to AOI4_IN2 */
    kXBAR3_OutputAoi4In3            = 19|0x300U,   /**< XBAR3_OUT19 output assigned to AOI4_IN3 */
    kXBAR3_OutputAoi4In4            = 20|0x300U,   /**< XBAR3_OUT20 output assigned to AOI4_IN4 */
    kXBAR3_OutputAoi4In5            = 21|0x300U,   /**< XBAR3_OUT21 output assigned to AOI4_IN5 */
    kXBAR3_OutputAoi4In6            = 22|0x300U,   /**< XBAR3_OUT22 output assigned to AOI4_IN6 */
    kXBAR3_OutputAoi4In7            = 23|0x300U,   /**< XBAR3_OUT23 output assigned to AOI4_IN7 */
    kXBAR3_OutputAoi4In8            = 24|0x300U,   /**< XBAR3_OUT24 output assigned to AOI4_IN8 */
    kXBAR3_OutputAoi4In9            = 25|0x300U,   /**< XBAR3_OUT25 output assigned to AOI4_IN9 */
    kXBAR3_OutputAoi4In10           = 26|0x300U,   /**< XBAR3_OUT26 output assigned to AOI4_IN10 */
    kXBAR3_OutputAoi4In11           = 27|0x300U,   /**< XBAR3_OUT27 output assigned to AOI4_IN11 */
    kXBAR3_OutputAoi4In12           = 28|0x300U,   /**< XBAR3_OUT28 output assigned to AOI4_IN12 */
    kXBAR3_OutputAoi4In13           = 29|0x300U,   /**< XBAR3_OUT29 output assigned to AOI4_IN13 */
    kXBAR3_OutputAoi4In14           = 30|0x300U,   /**< XBAR3_OUT30 output assigned to AOI4_IN14 */
    kXBAR3_OutputAoi4In15           = 31|0x300U,   /**< XBAR3_OUT31 output assigned to AOI4_IN15 */
} xbar_output_signal_t;


/*!
 * @}
 */ /* end of group Mapping_Information */


/* ----------------------------------------------------------------------------
   -- Device Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Peripheral_access_layer Device Peripheral Access Layer
 * @{
 */


