JayHeng/imxrt-tool-flash-algo/boards/nxp_evkmimxrt1180_rev.c/flash_algo_c0_silicon/Keil_JLink/rom_api/MIMXRT1189_cm7.h
#define AOI_BFCRT23_PT2_AC_MASK                  (0xC000U)
#define AOI_BFCRT23_PT2_AC_SHIFT                 (14U)
/*! PT2_AC - Product Term 2, Input A Configuration
 *  0b00..Force input A to become 0
 *  0b01..Pass input A
 *  0b10..Complement input A
 *  0b11..Force input A to become 1
 */
#define AOI_BFCRT23_PT2_AC(x)                    (((uint16_t)(((uint16_t)(x)) << AOI_BFCRT23_PT2_AC_SHIFT)) & AOI_BFCRT23_PT2_AC_MASK)
/*! @} */

/* The count of AOI_BFCRT23 */
#define AOI_BFCRT23_COUNT                        (4U)


/*!
 * @}
 */ /* end of group AOI_Register_Masks */


/* AOI - Peripheral instance base addresses */
/** Peripheral AOI1 base address */
#define AOI1_BASE                                (0x42780000u)
/** Peripheral AOI1 base pointer */
#define AOI1                                     ((AOI_Type *)AOI1_BASE)
/** Peripheral AOI2 base address */
#define AOI2_BASE                                (0x42790000u)
/** Peripheral AOI2 base pointer */
#define AOI2                                     ((AOI_Type *)AOI2_BASE)
/** Peripheral AOI3 base address */
#define AOI3_BASE                                (0x427E0000u)
/** Peripheral AOI3 base pointer */
#define AOI3                                     ((AOI_Type *)AOI3_BASE)
/** Peripheral AOI4 base address */
#define AOI4_BASE                                (0x427F0000u)
/** Peripheral AOI4 base pointer */
#define AOI4                                     ((AOI_Type *)AOI4_BASE)
/** Array initializer of AOI peripheral base addresses */
#define AOI_BASE_ADDRS                           { 0u, AOI1_BASE, AOI2_BASE, AOI3_BASE, AOI4_BASE }
/** Array initializer of AOI peripheral base pointers */
#define AOI_BASE_PTRS                            { (AOI_Type *)0u, AOI1, AOI2, AOI3, AOI4 }

/*!
 * @}
 */ /* end of group AOI_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- APC_IEE Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup APC_IEE_Peripheral_Access_Layer APC_IEE Peripheral Access Layer
 * @{
 */

/** APC_IEE - Register Layout Typedef */
typedef struct {
  __IO uint32_t REGION0_TOP_ADDR;                  /**< End address of IEE region (n), offset: 0x0 */
  __IO uint32_t REGION0_BOT_ADDR;                  /**< Start address of IEE region (n), offset: 0x4 */
  __IO uint32_t REGION0_ENA;                       /**< Region enable for region (n), offset: 0x8 */
  __IO uint32_t REGION0_ACC_CTL;                   /**< Access control for IEE APC registers of region (n), offset: 0xC */
  __IO uint32_t REGION1_TOP_ADDR;                  /**< End address of IEE region (n), offset: 0x10 */
  __IO uint32_t REGION1_BOT_ADDR;                  /**< Start address of IEE region (n), offset: 0x14 */
  __IO uint32_t REGION1_ENA;                       /**< Region enable for region (n), offset: 0x18 */
  __IO uint32_t REGION1_ACC_CTL;                   /**< Access control for IEE APC registers of region (n), offset: 0x1C */
  __IO uint32_t REGION2_TOP_ADDR;                  /**< End address of IEE region (n), offset: 0x20 */
  __IO uint32_t REGION2_BOT_ADDR;                  /**< Start address of IEE region (n), offset: 0x24 */
  __IO uint32_t REGION2_ENA;                       /**< Region enable for region (n), offset: 0x28 */
  __IO uint32_t REGION2_ACC_CTL;                   /**< Access control for IEE APC registers of region (n), offset: 0x2C */
  __IO uint32_t REGION3_TOP_ADDR;                  /**< End address of IEE region (n), offset: 0x30 */
  __IO uint32_t REGION3_BOT_ADDR;                  /**< Start address of IEE region (n), offset: 0x34 */
  __IO uint32_t REGION3_ENA;                       /**< Region enable for region (n), offset: 0x38 */
  __IO uint32_t REGION3_ACC_CTL;                   /**< Access control for IEE APC registers of region (n), offset: 0x3C */
  __IO uint32_t REGION4_TOP_ADDR;                  /**< End address of IEE region (n), offset: 0x40 */
  __IO uint32_t REGION4_BOT_ADDR;                  /**< Start address of IEE region (n), offset: 0x44 */
  __IO uint32_t REGION4_ENA;                       /**< Region enable for region (n), offset: 0x48 */
  __IO uint32_t REGION4_ACC_CTL;                   /**< Access control for IEE APC registers of region (n), offset: 0x4C */
  __IO uint32_t REGION5_TOP_ADDR;                  /**< End address of IEE region (n), offset: 0x50 */
  __IO uint32_t REGION5_BOT_ADDR;                  /**< Start address of IEE region (n), offset: 0x54 */
  __IO uint32_t REGION5_ENA;                       /**< Region enable for region (n), offset: 0x58 */
  __IO uint32_t REGION5_ACC_CTL;                   /**< Access control for IEE APC registers of region (n), offset: 0x5C */
  __IO uint32_t REGION6_TOP_ADDR;                  /**< End address of IEE region (n), offset: 0x60 */
  __IO uint32_t REGION6_BOT_ADDR;                  /**< Start address of IEE region (n), offset: 0x64 */
  __IO uint32_t REGION6_ENA;                       /**< Region enable for region (n), offset: 0x68 */
  __IO uint32_t REGION6_ACC_CTL;                   /**< Access control for IEE APC registers of region (n), offset: 0x6C */
  __IO uint32_t REGION7_TOP_ADDR;                  /**< End address of IEE region (n), offset: 0x70 */
  __IO uint32_t REGION7_BOT_ADDR;                  /**< Start address of IEE region (n), offset: 0x74 */
  __IO uint32_t REGION7_ENA;                       /**< Region enable for region (n), offset: 0x78 */
  __IO uint32_t REGION7_ACC_CTL;                   /**< Access control for IEE APC registers of region (n), offset: 0x7C */
} APC_IEE_Type;

/* ----------------------------------------------------------------------------
   -- APC_IEE Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup APC_IEE_Register_Masks APC_IEE Register Masks
 * @{
 */

/*! @name REGION0_TOP_ADDR - End address of IEE region (n) */
/*! @{ */

#define APC_IEE_REGION0_TOP_ADDR_TOP_ADDR_MASK   (0xFFFFFFC0U)
#define APC_IEE_REGION0_TOP_ADDR_TOP_ADDR_SHIFT  (6U)
/*! TOP_ADDR - End address of IEE region */
#define APC_IEE_REGION0_TOP_ADDR_TOP_ADDR(x)     (((uint32_t)(((uint32_t)(x)) << APC_IEE_REGION0_TOP_ADDR_TOP_ADDR_SHIFT)) & APC_IEE_REGION0_TOP_ADDR_TOP_ADDR_MASK)
/*! @} */

/*! @name REGION0_BOT_ADDR - Start address of IEE region (n) */
/*! @{ */

