JayHeng/imxrt-tool-flash-algo/boards/nxp_evkmimxrt1180_rev.c/flash_algo_c0_silicon/Keil_JLink/rom_api/MIMXRT1189_cm7.h
#define APC_IEE_REGION3_ACC_CTL_ALLOW_USER_MASK  (0x20000U)
#define APC_IEE_REGION3_ACC_CTL_ALLOW_USER_SHIFT (17U)
/*! ALLOW_USER - Allow user mode access
 *  0b1..User and privilege access to this region's registers is allowed
 *  0b0..Only privilege access to this region's registers is allowed
 */
#define APC_IEE_REGION3_ACC_CTL_ALLOW_USER(x)    (((uint32_t)(((uint32_t)(x)) << APC_IEE_REGION3_ACC_CTL_ALLOW_USER_SHIFT)) & APC_IEE_REGION3_ACC_CTL_ALLOW_USER_MASK)

#define APC_IEE_REGION3_ACC_CTL_LOCK_H_MASK      (0x80000000U)
#define APC_IEE_REGION3_ACC_CTL_LOCK_H_SHIFT     (31U)
/*! LOCK_H - Lock bit for the higher half word
 *  0b0..Higher half word is not locked
 *  0b1..Higher half word is locked
 */
#define APC_IEE_REGION3_ACC_CTL_LOCK_H(x)        (((uint32_t)(((uint32_t)(x)) << APC_IEE_REGION3_ACC_CTL_LOCK_H_SHIFT)) & APC_IEE_REGION3_ACC_CTL_LOCK_H_MASK)
/*! @} */

/*! @name REGION4_TOP_ADDR - End address of IEE region (n) */
/*! @{ */

#define APC_IEE_REGION4_TOP_ADDR_TOP_ADDR_MASK   (0xFFFFFFC0U)
#define APC_IEE_REGION4_TOP_ADDR_TOP_ADDR_SHIFT  (6U)
/*! TOP_ADDR - End address of IEE region */
#define APC_IEE_REGION4_TOP_ADDR_TOP_ADDR(x)     (((uint32_t)(((uint32_t)(x)) << APC_IEE_REGION4_TOP_ADDR_TOP_ADDR_SHIFT)) & APC_IEE_REGION4_TOP_ADDR_TOP_ADDR_MASK)
/*! @} */

/*! @name REGION4_BOT_ADDR - Start address of IEE region (n) */
/*! @{ */

#define APC_IEE_REGION4_BOT_ADDR_BOT_ADDR_MASK   (0xFFFFFFC0U)
#define APC_IEE_REGION4_BOT_ADDR_BOT_ADDR_SHIFT  (6U)
/*! BOT_ADDR - Start address of IEE region */
#define APC_IEE_REGION4_BOT_ADDR_BOT_ADDR(x)     (((uint32_t)(((uint32_t)(x)) << APC_IEE_REGION4_BOT_ADDR_BOT_ADDR_SHIFT)) & APC_IEE_REGION4_BOT_ADDR_BOT_ADDR_MASK)
/*! @} */

/*! @name REGION4_ENA - Region enable for region (n) */
/*! @{ */

#define APC_IEE_REGION4_ENA_ENCRYPT_ENABLE_MASK  (0x1U)
#define APC_IEE_REGION4_ENA_ENCRYPT_ENABLE_SHIFT (0U)
/*! ENCRYPT_ENABLE - Enable this region
 *  0b1..This region is enabled for IEE routing once hit
 *  0b0..This region is not enabled for IEE routing even hit
 */
#define APC_IEE_REGION4_ENA_ENCRYPT_ENABLE(x)    (((uint32_t)(((uint32_t)(x)) << APC_IEE_REGION4_ENA_ENCRYPT_ENABLE_SHIFT)) & APC_IEE_REGION4_ENA_ENCRYPT_ENABLE_MASK)
/*! @} */

/*! @name REGION4_ACC_CTL - Access control for IEE APC registers of region (n) */
/*! @{ */

#define APC_IEE_REGION4_ACC_CTL_ALLOW_DID_MASK   (0xFU)
#define APC_IEE_REGION4_ACC_CTL_ALLOW_DID_SHIFT  (0U)
/*! ALLOW_DID - Allowed domain ID */
#define APC_IEE_REGION4_ACC_CTL_ALLOW_DID(x)     (((uint32_t)(((uint32_t)(x)) << APC_IEE_REGION4_ACC_CTL_ALLOW_DID_SHIFT)) & APC_IEE_REGION4_ACC_CTL_ALLOW_DID_MASK)

#define APC_IEE_REGION4_ACC_CTL_LOCK_L_MASK      (0x8000U)
#define APC_IEE_REGION4_ACC_CTL_LOCK_L_SHIFT     (15U)
/*! LOCK_L - Lock bit for the lower half word
 *  0b0..Lower half word is not locked
 *  0b1..Lower half word is locked
 */
#define APC_IEE_REGION4_ACC_CTL_LOCK_L(x)        (((uint32_t)(((uint32_t)(x)) << APC_IEE_REGION4_ACC_CTL_LOCK_L_SHIFT)) & APC_IEE_REGION4_ACC_CTL_LOCK_L_MASK)

#define APC_IEE_REGION4_ACC_CTL_ALLOW_NS_MASK    (0x10000U)
#define APC_IEE_REGION4_ACC_CTL_ALLOW_NS_SHIFT   (16U)
/*! ALLOW_NS - Allow nonsecure mode access
 *  0b1..Secure and nonsecure access to this region's registers is allowed
 *  0b0..Only secure access to this region's registers is allowed
 */
#define APC_IEE_REGION4_ACC_CTL_ALLOW_NS(x)      (((uint32_t)(((uint32_t)(x)) << APC_IEE_REGION4_ACC_CTL_ALLOW_NS_SHIFT)) & APC_IEE_REGION4_ACC_CTL_ALLOW_NS_MASK)

#define APC_IEE_REGION4_ACC_CTL_ALLOW_USER_MASK  (0x20000U)
#define APC_IEE_REGION4_ACC_CTL_ALLOW_USER_SHIFT (17U)
/*! ALLOW_USER - Allow user mode access
 *  0b1..User and privilege access to this region's registers is allowed
 *  0b0..Only privilege access to this region's registers is allowed
 */
#define APC_IEE_REGION4_ACC_CTL_ALLOW_USER(x)    (((uint32_t)(((uint32_t)(x)) << APC_IEE_REGION4_ACC_CTL_ALLOW_USER_SHIFT)) & APC_IEE_REGION4_ACC_CTL_ALLOW_USER_MASK)

#define APC_IEE_REGION4_ACC_CTL_LOCK_H_MASK      (0x80000000U)
#define APC_IEE_REGION4_ACC_CTL_LOCK_H_SHIFT     (31U)
/*! LOCK_H - Lock bit for the higher half word
 *  0b0..Higher half word is not locked
 *  0b1..Higher half word is locked
 */
#define APC_IEE_REGION4_ACC_CTL_LOCK_H(x)        (((uint32_t)(((uint32_t)(x)) << APC_IEE_REGION4_ACC_CTL_LOCK_H_SHIFT)) & APC_IEE_REGION4_ACC_CTL_LOCK_H_MASK)
/*! @} */

/*! @name REGION5_TOP_ADDR - End address of IEE region (n) */
/*! @{ */

#define APC_IEE_REGION5_TOP_ADDR_TOP_ADDR_MASK   (0xFFFFFFC0U)
#define APC_IEE_REGION5_TOP_ADDR_TOP_ADDR_SHIFT  (6U)
/*! TOP_ADDR - End address of IEE region */
#define APC_IEE_REGION5_TOP_ADDR_TOP_ADDR(x)     (((uint32_t)(((uint32_t)(x)) << APC_IEE_REGION5_TOP_ADDR_TOP_ADDR_SHIFT)) & APC_IEE_REGION5_TOP_ADDR_TOP_ADDR_MASK)
/*! @} */

/*! @name REGION5_BOT_ADDR - Start address of IEE region (n) */
/*! @{ */

#define APC_IEE_REGION5_BOT_ADDR_BOT_ADDR_MASK   (0xFFFFFFC0U)
#define APC_IEE_REGION5_BOT_ADDR_BOT_ADDR_SHIFT  (6U)
/*! BOT_ADDR - Start address of IEE region */
#define APC_IEE_REGION5_BOT_ADDR_BOT_ADDR(x)     (((uint32_t)(((uint32_t)(x)) << APC_IEE_REGION5_BOT_ADDR_BOT_ADDR_SHIFT)) & APC_IEE_REGION5_BOT_ADDR_BOT_ADDR_MASK)
/*! @} */

/*! @name REGION5_ENA - Region enable for region (n) */
/*! @{ */

#define APC_IEE_REGION5_ENA_ENCRYPT_ENABLE_MASK  (0x1U)
#define APC_IEE_REGION5_ENA_ENCRYPT_ENABLE_SHIFT (0U)
/*! ENCRYPT_ENABLE - Enable this region
 *  0b1..This region is enabled for IEE routing once hit
 *  0b0..This region is not enabled for IEE routing even hit
 */
#define APC_IEE_REGION5_ENA_ENCRYPT_ENABLE(x)    (((uint32_t)(((uint32_t)(x)) << APC_IEE_REGION5_ENA_ENCRYPT_ENABLE_SHIFT)) & APC_IEE_REGION5_ENA_ENCRYPT_ENABLE_MASK)
/*! @} */

/*! @name REGION5_ACC_CTL - Access control for IEE APC registers of region (n) */
/*! @{ */

#define APC_IEE_REGION5_ACC_CTL_ALLOW_DID_MASK   (0xFU)
#define APC_IEE_REGION5_ACC_CTL_ALLOW_DID_SHIFT  (0U)
/*! ALLOW_DID - Allowed domain ID */
#define APC_IEE_REGION5_ACC_CTL_ALLOW_DID(x)     (((uint32_t)(((uint32_t)(x)) << APC_IEE_REGION5_ACC_CTL_ALLOW_DID_SHIFT)) & APC_IEE_REGION5_ACC_CTL_ALLOW_DID_MASK)

#define APC_IEE_REGION5_ACC_CTL_LOCK_L_MASK      (0x8000U)
#define APC_IEE_REGION5_ACC_CTL_LOCK_L_SHIFT     (15U)
/*! LOCK_L - Lock bit for the lower half word
 *  0b0..Lower half word is not locked
 *  0b1..Lower half word is locked
 */
#define APC_IEE_REGION5_ACC_CTL_LOCK_L(x)        (((uint32_t)(((uint32_t)(x)) << APC_IEE_REGION5_ACC_CTL_LOCK_L_SHIFT)) & APC_IEE_REGION5_ACC_CTL_LOCK_L_MASK)

#define APC_IEE_REGION5_ACC_CTL_ALLOW_NS_MASK    (0x10000U)
#define APC_IEE_REGION5_ACC_CTL_ALLOW_NS_SHIFT   (16U)
/*! ALLOW_NS - Allow nonsecure mode access
 *  0b1..Secure and nonsecure access to this region's registers is allowed
 *  0b0..Only secure access to this region's registers is allowed
 */
#define APC_IEE_REGION5_ACC_CTL_ALLOW_NS(x)      (((uint32_t)(((uint32_t)(x)) << APC_IEE_REGION5_ACC_CTL_ALLOW_NS_SHIFT)) & APC_IEE_REGION5_ACC_CTL_ALLOW_NS_MASK)

