JayHeng/imxrt-tool-flash-algo/boards/nxp_evkmimxrt1180_rev.c/flash_algo_c0_silicon/Keil_JLink/rom_api/MIMXRT1189_cm7.h
#define BLK_CTRL_NS_AONMIX_IPG_DEBUG_M7_SAI1_MASK (0x1000000U)
#define BLK_CTRL_NS_AONMIX_IPG_DEBUG_M7_SAI1_SHIFT (24U)
/*! M7_SAI1 - Mask bit for SAI1 debug halted mode with M7 core
 *  0b1..SAI1 enters debug halted mode when CM7 is debug halted
 *  0b0..SAI1 does not enter debug halted mode with CM7
 */
#define BLK_CTRL_NS_AONMIX_IPG_DEBUG_M7_SAI1(x)  (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_NS_AONMIX_IPG_DEBUG_M7_SAI1_SHIFT)) & BLK_CTRL_NS_AONMIX_IPG_DEBUG_M7_SAI1_MASK)

#define BLK_CTRL_NS_AONMIX_IPG_DEBUG_M7_TPM1_MASK (0x2000000U)
#define BLK_CTRL_NS_AONMIX_IPG_DEBUG_M7_TPM1_SHIFT (25U)
/*! M7_TPM1 - Mask bit for TPM1 debug halted mode with M7 core
 *  0b1..TPM1 enters debug halted mode when CM7 is debug halted
 *  0b0..TPM1 does not enter debug halted mode with CM7
 */
#define BLK_CTRL_NS_AONMIX_IPG_DEBUG_M7_TPM1(x)  (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_NS_AONMIX_IPG_DEBUG_M7_TPM1_SHIFT)) & BLK_CTRL_NS_AONMIX_IPG_DEBUG_M7_TPM1_MASK)

#define BLK_CTRL_NS_AONMIX_IPG_DEBUG_M7_TPM2_MASK (0x4000000U)
#define BLK_CTRL_NS_AONMIX_IPG_DEBUG_M7_TPM2_SHIFT (26U)
/*! M7_TPM2 - Mask bit for TPM2 debug halted mode with M7 core
 *  0b1..TPM2 enters debug halted mode when CM7 is debug halted
 *  0b0..TPM2 does not enter debug halted mode with CM7
 */
#define BLK_CTRL_NS_AONMIX_IPG_DEBUG_M7_TPM2(x)  (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_NS_AONMIX_IPG_DEBUG_M7_TPM2_SHIFT)) & BLK_CTRL_NS_AONMIX_IPG_DEBUG_M7_TPM2_MASK)

#define BLK_CTRL_NS_AONMIX_IPG_DEBUG_M7_WDOG1_MASK (0x8000000U)
#define BLK_CTRL_NS_AONMIX_IPG_DEBUG_M7_WDOG1_SHIFT (27U)
/*! M7_WDOG1 - Mask bit for WDOG1 debug halted mode with M7 core
 *  0b1..WDOG1 enters debug halted mode when CM7 is debug halted
 *  0b0..WDOG1 does not enter debug halted mode with CM7
 */
#define BLK_CTRL_NS_AONMIX_IPG_DEBUG_M7_WDOG1(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_NS_AONMIX_IPG_DEBUG_M7_WDOG1_SHIFT)) & BLK_CTRL_NS_AONMIX_IPG_DEBUG_M7_WDOG1_MASK)

#define BLK_CTRL_NS_AONMIX_IPG_DEBUG_M7_WDOG2_MASK (0x10000000U)
#define BLK_CTRL_NS_AONMIX_IPG_DEBUG_M7_WDOG2_SHIFT (28U)
/*! M7_WDOG2 - Mask bit for WDOG2 debug halted mode with M7 core
 *  0b1..WDOG2 enters debug halted mode when CM7 is debug halted
 *  0b0..WDOG2 does not enter debug halted mode with CM7
 */
#define BLK_CTRL_NS_AONMIX_IPG_DEBUG_M7_WDOG2(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_NS_AONMIX_IPG_DEBUG_M7_WDOG2_SHIFT)) & BLK_CTRL_NS_AONMIX_IPG_DEBUG_M7_WDOG2_MASK)

#define BLK_CTRL_NS_AONMIX_IPG_DEBUG_M7_GPT1_MASK (0x20000000U)
#define BLK_CTRL_NS_AONMIX_IPG_DEBUG_M7_GPT1_SHIFT (29U)
/*! M7_GPT1 - Mask bit for GPT1 debug halted mode with M7 core
 *  0b1..GPT1 enters debug halted mode when CM7 is debug halted
 *  0b0..GPT1 does not enter debug halted mode with CM7
 */
#define BLK_CTRL_NS_AONMIX_IPG_DEBUG_M7_GPT1(x)  (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_NS_AONMIX_IPG_DEBUG_M7_GPT1_SHIFT)) & BLK_CTRL_NS_AONMIX_IPG_DEBUG_M7_GPT1_MASK)

#define BLK_CTRL_NS_AONMIX_IPG_DEBUG_M7_CAN3_MASK (0x40000000U)
#define BLK_CTRL_NS_AONMIX_IPG_DEBUG_M7_CAN3_SHIFT (30U)
/*! M7_CAN3 - Mask bit for CAN3 debug halted mode with M7 core
 *  0b1..CAN3 enters debug halted mode when CM7 is debug halted
 *  0b0..CAN3 does not enter debug halted mode with CM7
 */
#define BLK_CTRL_NS_AONMIX_IPG_DEBUG_M7_CAN3(x)  (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_NS_AONMIX_IPG_DEBUG_M7_CAN3_SHIFT)) & BLK_CTRL_NS_AONMIX_IPG_DEBUG_M7_CAN3_MASK)

#define BLK_CTRL_NS_AONMIX_IPG_DEBUG_M7_I3C1_MASK (0x80000000U)
#define BLK_CTRL_NS_AONMIX_IPG_DEBUG_M7_I3C1_SHIFT (31U)
/*! M7_I3C1 - Mask bit for I3C1 debug halted mode with M7 core
 *  0b1..I3C1 enters debug halted mode when CM7 is debug halted
 *  0b0..I3C1 does not enter debug halted mode with CM7
 */
#define BLK_CTRL_NS_AONMIX_IPG_DEBUG_M7_I3C1(x)  (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_NS_AONMIX_IPG_DEBUG_M7_I3C1_SHIFT)) & BLK_CTRL_NS_AONMIX_IPG_DEBUG_M7_I3C1_MASK)
/*! @} */

/*! @name SSI -  */
/*! @{ */

#define BLK_CTRL_NS_AONMIX_SSI_PAUSE_MODE_MASK   (0x1U)
#define BLK_CTRL_NS_AONMIX_SSI_PAUSE_MODE_SHIFT  (0U)
/*! PAUSE_MODE - AON Domain SSI master pause mode
 *  0b0..AON Domain SSI master is not in pause mode
 *  0b1..AON Domain SSI master is in pause mode
 */
#define BLK_CTRL_NS_AONMIX_SSI_PAUSE_MODE(x)     (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_NS_AONMIX_SSI_PAUSE_MODE_SHIFT)) & BLK_CTRL_NS_AONMIX_SSI_PAUSE_MODE_MASK)

#define BLK_CTRL_NS_AONMIX_SSI_BLKHOLE_MODE_B_MASK (0x2U)
#define BLK_CTRL_NS_AONMIX_SSI_BLKHOLE_MODE_B_SHIFT (1U)
/*! BLKHOLE_MODE_B - AON Domain SSI master blackhole mode
 *  0b0..AON Domain SSI master will enter into blackhole mode
 *  0b1..AON Domain SSI master will exit from blackhole mode
 */
#define BLK_CTRL_NS_AONMIX_SSI_BLKHOLE_MODE_B(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_NS_AONMIX_SSI_BLKHOLE_MODE_B_SHIFT)) & BLK_CTRL_NS_AONMIX_SSI_BLKHOLE_MODE_B_MASK)
/*! @} */

/*! @name SAI1_MCLK_CTRL - SAI1 MCLK control register */
/*! @{ */

#define BLK_CTRL_NS_AONMIX_SAI1_MCLK_CTRL_SAI1_MCLK_DIR_MASK (0x100U)
#define BLK_CTRL_NS_AONMIX_SAI1_MCLK_CTRL_SAI1_MCLK_DIR_SHIFT (8U)
/*! SAI1_MCLK_DIR - SAI1_MCLK IO direction control. IOMUX need select SAI1 MCLK function
 *  0b0..SAI1_MCLK is input signal
 *  0b1..SAI1_MCLK is output signal
 */
#define BLK_CTRL_NS_AONMIX_SAI1_MCLK_CTRL_SAI1_MCLK_DIR(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_NS_AONMIX_SAI1_MCLK_CTRL_SAI1_MCLK_DIR_SHIFT)) & BLK_CTRL_NS_AONMIX_SAI1_MCLK_CTRL_SAI1_MCLK_DIR_MASK)
/*! @} */

/*! @name DCDC_STATUS - DCDC status register */
/*! @{ */

#define BLK_CTRL_NS_AONMIX_DCDC_STATUS_DCDC_STATUS_CAPT_CLR_MASK (0x2U)
#define BLK_CTRL_NS_AONMIX_DCDC_STATUS_DCDC_STATUS_CAPT_CLR_SHIFT (1U)
/*! DCDC_STATUS_CAPT_CLR - DCDC captured status clear
 *  0b0..No change
 *  0b1..Clear the 3 bits of DCDC captured status: DCDC_OVER_VOL, DCDC_OVER_CUR, and DCDC_IN_LOW_VOL
 */
#define BLK_CTRL_NS_AONMIX_DCDC_STATUS_DCDC_STATUS_CAPT_CLR(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_NS_AONMIX_DCDC_STATUS_DCDC_STATUS_CAPT_CLR_SHIFT)) & BLK_CTRL_NS_AONMIX_DCDC_STATUS_DCDC_STATUS_CAPT_CLR_MASK)

#define BLK_CTRL_NS_AONMIX_DCDC_STATUS_DCDC_IN_LOW_VOL_MASK (0x10000U)
#define BLK_CTRL_NS_AONMIX_DCDC_STATUS_DCDC_IN_LOW_VOL_SHIFT (16U)
/*! DCDC_IN_LOW_VOL - DCDC_IN low voltage detect
 *  0b1..Voltage on DCDC_IN is lower than 2.6V
 *  0b0..Voltage on DCDC_IN is higher than 2.6V
 */
#define BLK_CTRL_NS_AONMIX_DCDC_STATUS_DCDC_IN_LOW_VOL(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_NS_AONMIX_DCDC_STATUS_DCDC_IN_LOW_VOL_SHIFT)) & BLK_CTRL_NS_AONMIX_DCDC_STATUS_DCDC_IN_LOW_VOL_MASK)

#define BLK_CTRL_NS_AONMIX_DCDC_STATUS_DCDC_OVER_CUR_MASK (0x20000U)
#define BLK_CTRL_NS_AONMIX_DCDC_STATUS_DCDC_OVER_CUR_SHIFT (17U)
/*! DCDC_OVER_CUR - DCDC output over current alert
 *  0b1..Overcurrent on DCDC output
 *  0b0..No Overcurrent on DCDC output
 */
#define BLK_CTRL_NS_AONMIX_DCDC_STATUS_DCDC_OVER_CUR(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_NS_AONMIX_DCDC_STATUS_DCDC_OVER_CUR_SHIFT)) & BLK_CTRL_NS_AONMIX_DCDC_STATUS_DCDC_OVER_CUR_MASK)

#define BLK_CTRL_NS_AONMIX_DCDC_STATUS_DCDC_OVER_VOL_MASK (0x40000U)
#define BLK_CTRL_NS_AONMIX_DCDC_STATUS_DCDC_OVER_VOL_SHIFT (18U)
/*! DCDC_OVER_VOL - DCDC output over voltage alert
 *  0b1..Overvoltage on DCDC VDDLP0 or VDDLP8 output
 *  0b0..No Overvoltage on DCDC VDDLP0 or VDDLP8 output
 */
#define BLK_CTRL_NS_AONMIX_DCDC_STATUS_DCDC_OVER_VOL(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_NS_AONMIX_DCDC_STATUS_DCDC_OVER_VOL_SHIFT)) & BLK_CTRL_NS_AONMIX_DCDC_STATUS_DCDC_OVER_VOL_MASK)

#define BLK_CTRL_NS_AONMIX_DCDC_STATUS_DCDC_STS_DC_OK_MASK (0x80000U)
#define BLK_CTRL_NS_AONMIX_DCDC_STATUS_DCDC_STS_DC_OK_SHIFT (19U)
/*! DCDC_STS_DC_OK - DCDC status OK
 *  0b0..DCDC is settling
 *  0b1..DCDC already settled
 */
#define BLK_CTRL_NS_AONMIX_DCDC_STATUS_DCDC_STS_DC_OK(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_NS_AONMIX_DCDC_STATUS_DCDC_STS_DC_OK_SHIFT)) & BLK_CTRL_NS_AONMIX_DCDC_STATUS_DCDC_STS_DC_OK_MASK)
/*! @} */

