JayHeng/imxrt-tool-flash-algo/boards/nxp_evkmimxrt1180_rev.c/flash_algo_c0_silicon/Keil_JLink/rom_api/MIMXRT1189_cm7.h
#define BLK_CTRL_WAKEUPMIX_AXI_ATTR_CFG_AWCACHE_USB_MASK (0x20U)
#define BLK_CTRL_WAKEUPMIX_AXI_ATTR_CFG_AWCACHE_USB_SHIFT (5U)
/*! AWCACHE_USB - USB block cacheable attribute value of AXI write transactions
 *  0b0..Cacheable attribute is off for write transactions
 *  0b1..Cacheable attribute is on for write transactions
 */
#define BLK_CTRL_WAKEUPMIX_AXI_ATTR_CFG_AWCACHE_USB(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_AXI_ATTR_CFG_AWCACHE_USB_SHIFT)) & BLK_CTRL_WAKEUPMIX_AXI_ATTR_CFG_AWCACHE_USB_MASK)
/*! @} */

/*! @name SRAMCR0 - SRAM Control Register 0 */
/*! @{ */

#define BLK_CTRL_WAKEUPMIX_SRAMCR0_BTO_MASK      (0xFFU)
#define BLK_CTRL_WAKEUPMIX_SRAMCR0_BTO_SHIFT     (0U)
/*! BTO - AHB Bus Timeout Wait Cycle */
#define BLK_CTRL_WAKEUPMIX_SRAMCR0_BTO(x)        (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_SRAMCR0_BTO_SHIFT)) & BLK_CTRL_WAKEUPMIX_SRAMCR0_BTO_MASK)

#define BLK_CTRL_WAKEUPMIX_SRAMCR0_BTOEN_MASK    (0x100U)
#define BLK_CTRL_WAKEUPMIX_SRAMCR0_BTOEN_SHIFT   (8U)
/*! BTOEN - AHB Bus Timeout Enable
 *  0b0..AHB bus timeout counter is not enabled.
 *  0b1..AHB bus timeout counter is enabled.
 */
#define BLK_CTRL_WAKEUPMIX_SRAMCR0_BTOEN(x)      (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_SRAMCR0_BTOEN_SHIFT)) & BLK_CTRL_WAKEUPMIX_SRAMCR0_BTOEN_MASK)

#define BLK_CTRL_WAKEUPMIX_SRAMCR0_PS_MASK       (0x200U)
#define BLK_CTRL_WAKEUPMIX_SRAMCR0_PS_SHIFT      (9U)
/*! PS - Port Size
 *  0b0..8bit
 *  0b1..16bit
 */
#define BLK_CTRL_WAKEUPMIX_SRAMCR0_PS(x)         (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_SRAMCR0_PS_SHIFT)) & BLK_CTRL_WAKEUPMIX_SRAMCR0_PS_MASK)

#define BLK_CTRL_WAKEUPMIX_SRAMCR0_AM_MASK       (0x400U)
#define BLK_CTRL_WAKEUPMIX_SRAMCR0_AM_SHIFT      (10U)
/*! AM - Address Mode
 *  0b0..Address/Data MUX mode (ADMUX)
 *  0b1..Address/Data non-MUX mode (Non-ADMUX)
 */
#define BLK_CTRL_WAKEUPMIX_SRAMCR0_AM(x)         (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_SRAMCR0_AM_SHIFT)) & BLK_CTRL_WAKEUPMIX_SRAMCR0_AM_MASK)

#define BLK_CTRL_WAKEUPMIX_SRAMCR0_ADVP_MASK     (0x800U)
#define BLK_CTRL_WAKEUPMIX_SRAMCR0_ADVP_SHIFT    (11U)
/*! ADVP - ADV# polarity
 *  0b0..ADV# is active low.
 *  0b1..ADV# is active high.
 */
#define BLK_CTRL_WAKEUPMIX_SRAMCR0_ADVP(x)       (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_SRAMCR0_ADVP_SHIFT)) & BLK_CTRL_WAKEUPMIX_SRAMCR0_ADVP_MASK)

#define BLK_CTRL_WAKEUPMIX_SRAMCR0_CES_MASK      (0xF000U)
#define BLK_CTRL_WAKEUPMIX_SRAMCR0_CES_SHIFT     (12U)
/*! CES - CE setup time */
#define BLK_CTRL_WAKEUPMIX_SRAMCR0_CES(x)        (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_SRAMCR0_CES_SHIFT)) & BLK_CTRL_WAKEUPMIX_SRAMCR0_CES_MASK)

#define BLK_CTRL_WAKEUPMIX_SRAMCR0_CEH_MASK      (0xF0000U)
#define BLK_CTRL_WAKEUPMIX_SRAMCR0_CEH_SHIFT     (16U)
/*! CEH - CE hold time */
#define BLK_CTRL_WAKEUPMIX_SRAMCR0_CEH(x)        (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_SRAMCR0_CEH_SHIFT)) & BLK_CTRL_WAKEUPMIX_SRAMCR0_CEH_MASK)

#define BLK_CTRL_WAKEUPMIX_SRAMCR0_AS_MASK       (0xF00000U)
#define BLK_CTRL_WAKEUPMIX_SRAMCR0_AS_SHIFT      (20U)
/*! AS - Address setup time */
#define BLK_CTRL_WAKEUPMIX_SRAMCR0_AS(x)         (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_SRAMCR0_AS_SHIFT)) & BLK_CTRL_WAKEUPMIX_SRAMCR0_AS_MASK)

#define BLK_CTRL_WAKEUPMIX_SRAMCR0_AH_MASK       (0xF000000U)
#define BLK_CTRL_WAKEUPMIX_SRAMCR0_AH_SHIFT      (24U)
/*! AH - Address hold time */
#define BLK_CTRL_WAKEUPMIX_SRAMCR0_AH(x)         (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_SRAMCR0_AH_SHIFT)) & BLK_CTRL_WAKEUPMIX_SRAMCR0_AH_MASK)

#define BLK_CTRL_WAKEUPMIX_SRAMCR0_TA_MASK       (0xF0000000U)
#define BLK_CTRL_WAKEUPMIX_SRAMCR0_TA_SHIFT      (28U)
/*! TA - Turnaround time */
#define BLK_CTRL_WAKEUPMIX_SRAMCR0_TA(x)         (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_SRAMCR0_TA_SHIFT)) & BLK_CTRL_WAKEUPMIX_SRAMCR0_TA_MASK)
/*! @} */

/*! @name SRAMCR1 - SRAM Control Register 1 */
/*! @{ */

#define BLK_CTRL_WAKEUPMIX_SRAMCR1_WEL_MASK      (0x3FU)
#define BLK_CTRL_WAKEUPMIX_SRAMCR1_WEL_SHIFT     (0U)
/*! WEL - WE low time */
#define BLK_CTRL_WAKEUPMIX_SRAMCR1_WEL(x)        (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_SRAMCR1_WEL_SHIFT)) & BLK_CTRL_WAKEUPMIX_SRAMCR1_WEL_MASK)

#define BLK_CTRL_WAKEUPMIX_SRAMCR1_WEH_MASK      (0x3C0U)
#define BLK_CTRL_WAKEUPMIX_SRAMCR1_WEH_SHIFT     (6U)
/*! WEH - WE high time */
#define BLK_CTRL_WAKEUPMIX_SRAMCR1_WEH(x)        (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_SRAMCR1_WEH_SHIFT)) & BLK_CTRL_WAKEUPMIX_SRAMCR1_WEH_MASK)

#define BLK_CTRL_WAKEUPMIX_SRAMCR1_REL_MASK      (0xFC00U)
#define BLK_CTRL_WAKEUPMIX_SRAMCR1_REL_SHIFT     (10U)
/*! REL - RE low time */
#define BLK_CTRL_WAKEUPMIX_SRAMCR1_REL(x)        (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_SRAMCR1_REL_SHIFT)) & BLK_CTRL_WAKEUPMIX_SRAMCR1_REL_MASK)

#define BLK_CTRL_WAKEUPMIX_SRAMCR1_REH_MASK      (0xF0000U)
#define BLK_CTRL_WAKEUPMIX_SRAMCR1_REH_SHIFT     (16U)
/*! REH - RE high time */
#define BLK_CTRL_WAKEUPMIX_SRAMCR1_REH(x)        (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_SRAMCR1_REH_SHIFT)) & BLK_CTRL_WAKEUPMIX_SRAMCR1_REH_MASK)

#define BLK_CTRL_WAKEUPMIX_SRAMCR1_PRE_MASK      (0x300000U)
#define BLK_CTRL_WAKEUPMIX_SRAMCR1_PRE_SHIFT     (20U)
/*! PRE - Prescaler timer
 *  0b00..Time granularity is 1 clock cycle.
 *  0b01..Time granularity is 2 clock cycles.
 *  0b10..Time granularity is 3 clock cycles.
 *  0b11..Time granularity is 4 clock cycles.
 */
#define BLK_CTRL_WAKEUPMIX_SRAMCR1_PRE(x)        (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_SRAMCR1_PRE_SHIFT)) & BLK_CTRL_WAKEUPMIX_SRAMCR1_PRE_MASK)
/*! @} */

/*! @name SLAVE_STOP_MODE_CFG - Slave stop mode configure register */
/*! @{ */

#define BLK_CTRL_WAKEUPMIX_SLAVE_STOP_MODE_CFG_ADC1_IPG_STOP_MODE_MASK (0x10U)
#define BLK_CTRL_WAKEUPMIX_SLAVE_STOP_MODE_CFG_ADC1_IPG_STOP_MODE_SHIFT (4U)
/*! ADC1_IPG_STOP_MODE - ADC1 stop mode selection.
 *  0b0..This module is functional in Stop Mode
 *  0b1..This module is not functional in Stop Mode
 */
#define BLK_CTRL_WAKEUPMIX_SLAVE_STOP_MODE_CFG_ADC1_IPG_STOP_MODE(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_SLAVE_STOP_MODE_CFG_ADC1_IPG_STOP_MODE_SHIFT)) & BLK_CTRL_WAKEUPMIX_SLAVE_STOP_MODE_CFG_ADC1_IPG_STOP_MODE_MASK)

#define BLK_CTRL_WAKEUPMIX_SLAVE_STOP_MODE_CFG_ADC2_IPG_STOP_MODE_MASK (0x20U)
#define BLK_CTRL_WAKEUPMIX_SLAVE_STOP_MODE_CFG_ADC2_IPG_STOP_MODE_SHIFT (5U)
/*! ADC2_IPG_STOP_MODE - ADC2 stop mode selection.
 *  0b0..This module is functional in Stop Mode
 *  0b1..This module is not functional in Stop Mode
 */
#define BLK_CTRL_WAKEUPMIX_SLAVE_STOP_MODE_CFG_ADC2_IPG_STOP_MODE(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_SLAVE_STOP_MODE_CFG_ADC2_IPG_STOP_MODE_SHIFT)) & BLK_CTRL_WAKEUPMIX_SLAVE_STOP_MODE_CFG_ADC2_IPG_STOP_MODE_MASK)
/*! @} */

/*! @name I3C2_ASYNC_WAKEUP_CTRL - I3C2 async wakeup control register */
/*! @{ */

#define BLK_CTRL_WAKEUPMIX_I3C2_ASYNC_WAKEUP_CTRL_IRQ_CLR_MASK (0x1U)
#define BLK_CTRL_WAKEUPMIX_I3C2_ASYNC_WAKEUP_CTRL_IRQ_CLR_SHIFT (0U)
/*! IRQ_CLR - Async wakeup interrupt clear */
#define BLK_CTRL_WAKEUPMIX_I3C2_ASYNC_WAKEUP_CTRL_IRQ_CLR(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_I3C2_ASYNC_WAKEUP_CTRL_IRQ_CLR_SHIFT)) & BLK_CTRL_WAKEUPMIX_I3C2_ASYNC_WAKEUP_CTRL_IRQ_CLR_MASK)

