JayHeng/imxrt-tool-flash-algo/boards/nxp_evkmimxrt1180_rev.c/flash_algo_c0_silicon/Keil_JLink/rom_api/MIMXRT1189_cm7.h
#define BLK_CTRL_WAKEUPMIX_NETC_LINK_CFG_REVMII_RATE_MASK (0x1000000U)
#define BLK_CTRL_WAKEUPMIX_NETC_LINK_CFG_REVMII_RATE_SHIFT (24U)
/*! REVMII_RATE - When REVMII=1 and MII_PROT=MII, this bit configures RevMII rates, otherwise this field has no meaning.
 *  0b0..MII interface is operating at 100Mbps
 *  0b1..MII interface is operating at 10Mbps
 */
#define BLK_CTRL_WAKEUPMIX_NETC_LINK_CFG_REVMII_RATE(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_NETC_LINK_CFG_REVMII_RATE_SHIFT)) & BLK_CTRL_WAKEUPMIX_NETC_LINK_CFG_REVMII_RATE_MASK)

#define BLK_CTRL_WAKEUPMIX_NETC_LINK_CFG_REVMII_MASK (0x80000000U)
#define BLK_CTRL_WAKEUPMIX_NETC_LINK_CFG_REVMII_SHIFT (31U)
/*! REVMII - RevMII selection
 *  0b0..RevMII not selected
 *  0b1..RevMII selected
 */
#define BLK_CTRL_WAKEUPMIX_NETC_LINK_CFG_REVMII(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_NETC_LINK_CFG_REVMII_SHIFT)) & BLK_CTRL_WAKEUPMIX_NETC_LINK_CFG_REVMII_MASK)
/*! @} */

/* The count of BLK_CTRL_WAKEUPMIX_NETC_LINK_CFG */
#define BLK_CTRL_WAKEUPMIX_NETC_LINK_CFG_COUNT   (5U)

/*! @name NETC_REVMII_DLL - NETC RevMII RGMII delay line configuration for port0..NETC RevMII RGMII delay line configuration for port4 */
/*! @{ */

#define BLK_CTRL_WAKEUPMIX_NETC_REVMII_DLL_DLY_TARGET_MASK (0xFU)
#define BLK_CTRL_WAKEUPMIX_NETC_REVMII_DLL_DLY_TARGET_SHIFT (0U)
/*! DLY_TARGET - Delay target of slave delay line */
#define BLK_CTRL_WAKEUPMIX_NETC_REVMII_DLL_DLY_TARGET(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_NETC_REVMII_DLL_DLY_TARGET_SHIFT)) & BLK_CTRL_WAKEUPMIX_NETC_REVMII_DLL_DLY_TARGET_MASK)

#define BLK_CTRL_WAKEUPMIX_NETC_REVMII_DLL_REF_LOCK_MASK (0x10000U)
#define BLK_CTRL_WAKEUPMIX_NETC_REVMII_DLL_REF_LOCK_SHIFT (16U)
/*! REF_LOCK - Reference delay line lock flag
 *  0b0..Reference delay line is not locked
 *  0b1..Reference delay line is locked
 */
#define BLK_CTRL_WAKEUPMIX_NETC_REVMII_DLL_REF_LOCK(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_NETC_REVMII_DLL_REF_LOCK_SHIFT)) & BLK_CTRL_WAKEUPMIX_NETC_REVMII_DLL_REF_LOCK_MASK)

#define BLK_CTRL_WAKEUPMIX_NETC_REVMII_DLL_SLV_LOCK_MASK (0x20000U)
#define BLK_CTRL_WAKEUPMIX_NETC_REVMII_DLL_SLV_LOCK_SHIFT (17U)
/*! SLV_LOCK - Slave delay line lock flag
 *  0b0..Slave delay line is not locked
 *  0b1..Slave delay line is locked
 */
#define BLK_CTRL_WAKEUPMIX_NETC_REVMII_DLL_SLV_LOCK(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_NETC_REVMII_DLL_SLV_LOCK_SHIFT)) & BLK_CTRL_WAKEUPMIX_NETC_REVMII_DLL_SLV_LOCK_MASK)
/*! @} */

/* The count of BLK_CTRL_WAKEUPMIX_NETC_REVMII_DLL */
#define BLK_CTRL_WAKEUPMIX_NETC_REVMII_DLL_COUNT (5U)

/*! @name SAFETY_CLK_MON_CS - Safety clock monitor control and status register */
/*! @{ */

#define BLK_CTRL_WAKEUPMIX_SAFETY_CLK_MON_CS_MON_EN_MASK (0x1U)
#define BLK_CTRL_WAKEUPMIX_SAFETY_CLK_MON_CS_MON_EN_SHIFT (0U)
/*! MON_EN - Monitor enable bit
 *  0b0..The monitor is off
 *  0b1..The monitor is on
 */
#define BLK_CTRL_WAKEUPMIX_SAFETY_CLK_MON_CS_MON_EN(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_SAFETY_CLK_MON_CS_MON_EN_SHIFT)) & BLK_CTRL_WAKEUPMIX_SAFETY_CLK_MON_CS_MON_EN_MASK)

#define BLK_CTRL_WAKEUPMIX_SAFETY_CLK_MON_CS_IRQ_EN_MASK (0x2U)
#define BLK_CTRL_WAKEUPMIX_SAFETY_CLK_MON_CS_IRQ_EN_SHIFT (1U)
/*! IRQ_EN - Interrupt enable
 *  0b0..Clock failure will not assert interrupt
 *  0b1..Clock failure will assert interrupt
 */
#define BLK_CTRL_WAKEUPMIX_SAFETY_CLK_MON_CS_IRQ_EN(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_SAFETY_CLK_MON_CS_IRQ_EN_SHIFT)) & BLK_CTRL_WAKEUPMIX_SAFETY_CLK_MON_CS_IRQ_EN_MASK)

#define BLK_CTRL_WAKEUPMIX_SAFETY_CLK_MON_CS_FAST_RST_EN_MASK (0x4U)
#define BLK_CTRL_WAKEUPMIX_SAFETY_CLK_MON_CS_FAST_RST_EN_SHIFT (2U)
/*! FAST_RST_EN - Reset out enable
 *  0b0..Clock failure will not assert EWM_OUT
 *  0b1..Clock failure will assert EWM_OUT_b immediately regardless EWM state
 */
#define BLK_CTRL_WAKEUPMIX_SAFETY_CLK_MON_CS_FAST_RST_EN(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_SAFETY_CLK_MON_CS_FAST_RST_EN_SHIFT)) & BLK_CTRL_WAKEUPMIX_SAFETY_CLK_MON_CS_FAST_RST_EN_MASK)

#define BLK_CTRL_WAKEUPMIX_SAFETY_CLK_MON_CS_STAT_CLR_MASK (0x100U)
#define BLK_CTRL_WAKEUPMIX_SAFETY_CLK_MON_CS_STAT_CLR_SHIFT (8U)
/*! STAT_CLR - Status clear
 *  0b0..No effect to clock failure status bit
 *  0b1..Clear clock failure status bit
 */
#define BLK_CTRL_WAKEUPMIX_SAFETY_CLK_MON_CS_STAT_CLR(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_SAFETY_CLK_MON_CS_STAT_CLR_SHIFT)) & BLK_CTRL_WAKEUPMIX_SAFETY_CLK_MON_CS_STAT_CLR_MASK)

#define BLK_CTRL_WAKEUPMIX_SAFETY_CLK_MON_CS_STAT_MASK (0x1000000U)
#define BLK_CTRL_WAKEUPMIX_SAFETY_CLK_MON_CS_STAT_SHIFT (24U)
/*! STAT - XBAR_OUT220 clock failure status
 *  0b0..No failure detected by the monitor
 *  0b1..Clock failure has been detected by the monitor
 */
#define BLK_CTRL_WAKEUPMIX_SAFETY_CLK_MON_CS_STAT(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_SAFETY_CLK_MON_CS_STAT_SHIFT)) & BLK_CTRL_WAKEUPMIX_SAFETY_CLK_MON_CS_STAT_MASK)
/*! @} */

/*! @name SAFETY_CLK_MON_TH - Safety clock monitor threshold register */
/*! @{ */

#define BLK_CTRL_WAKEUPMIX_SAFETY_CLK_MON_TH_TH_LOW_MASK (0xFFFFU)
#define BLK_CTRL_WAKEUPMIX_SAFETY_CLK_MON_TH_TH_LOW_SHIFT (0U)
/*! TH_LOW - Threshold low value */
#define BLK_CTRL_WAKEUPMIX_SAFETY_CLK_MON_TH_TH_LOW(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_SAFETY_CLK_MON_TH_TH_LOW_SHIFT)) & BLK_CTRL_WAKEUPMIX_SAFETY_CLK_MON_TH_TH_LOW_MASK)

#define BLK_CTRL_WAKEUPMIX_SAFETY_CLK_MON_TH_TH_HIGH_MASK (0xFFFF0000U)
#define BLK_CTRL_WAKEUPMIX_SAFETY_CLK_MON_TH_TH_HIGH_SHIFT (16U)
/*! TH_HIGH - Threshold high value */
#define BLK_CTRL_WAKEUPMIX_SAFETY_CLK_MON_TH_TH_HIGH(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_SAFETY_CLK_MON_TH_TH_HIGH_SHIFT)) & BLK_CTRL_WAKEUPMIX_SAFETY_CLK_MON_TH_TH_HIGH_MASK)
/*! @} */

/*! @name EMC_B1_IO_CTRL - GPIO_EMC_B1 bank IO control */
/*! @{ */

#define BLK_CTRL_WAKEUPMIX_EMC_B1_IO_CTRL_GPIO_EMC1_FREEZE_MASK (0x1U)
#define BLK_CTRL_WAKEUPMIX_EMC_B1_IO_CTRL_GPIO_EMC1_FREEZE_SHIFT (0U)
/*! GPIO_EMC1_FREEZE - Compensation code freeze */
#define BLK_CTRL_WAKEUPMIX_EMC_B1_IO_CTRL_GPIO_EMC1_FREEZE(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_EMC_B1_IO_CTRL_GPIO_EMC1_FREEZE_SHIFT)) & BLK_CTRL_WAKEUPMIX_EMC_B1_IO_CTRL_GPIO_EMC1_FREEZE_MASK)

#define BLK_CTRL_WAKEUPMIX_EMC_B1_IO_CTRL_GPIO_EMC1_COMPTQ_MASK (0x2U)
#define BLK_CTRL_WAKEUPMIX_EMC_B1_IO_CTRL_GPIO_EMC1_COMPTQ_SHIFT (1U)
/*! GPIO_EMC1_COMPTQ - COMPEN and COMPTQ control the operating modes of the compensation cell */
#define BLK_CTRL_WAKEUPMIX_EMC_B1_IO_CTRL_GPIO_EMC1_COMPTQ(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_EMC_B1_IO_CTRL_GPIO_EMC1_COMPTQ_SHIFT)) & BLK_CTRL_WAKEUPMIX_EMC_B1_IO_CTRL_GPIO_EMC1_COMPTQ_MASK)

