JayHeng/imxrt-tool-flash-algo/boards/nxp_evkmimxrt1180_rev.c/flash_algo_c0_silicon/Keil_JLink/rom_api/MIMXRT1189_cm7.h
#define CCM_OBSERVE_CONTROL_CLR_SELECT_MASK      (0x1FFU)
#define CCM_OBSERVE_CONTROL_CLR_SELECT_SHIFT     (0U)
/*! SELECT - Observe signal selector */
#define CCM_OBSERVE_CONTROL_CLR_SELECT(x)        (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_CONTROL_CLR_SELECT_SHIFT)) & CCM_OBSERVE_CONTROL_CLR_SELECT_MASK)

#define CCM_OBSERVE_CONTROL_CLR_RAW_MASK         (0x1000U)
#define CCM_OBSERVE_CONTROL_CLR_RAW_SHIFT        (12U)
/*! RAW - Observe raw signal */
#define CCM_OBSERVE_CONTROL_CLR_RAW(x)           (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_CONTROL_CLR_RAW_SHIFT)) & CCM_OBSERVE_CONTROL_CLR_RAW_MASK)

#define CCM_OBSERVE_CONTROL_CLR_INV_MASK         (0x2000U)
#define CCM_OBSERVE_CONTROL_CLR_INV_SHIFT        (13U)
#define CCM_OBSERVE_CONTROL_CLR_INV(x)           (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_CONTROL_CLR_INV_SHIFT)) & CCM_OBSERVE_CONTROL_CLR_INV_MASK)

#define CCM_OBSERVE_CONTROL_CLR_RESET_MASK       (0x8000U)
#define CCM_OBSERVE_CONTROL_CLR_RESET_SHIFT      (15U)
/*! RESET - Reset observe divider */
#define CCM_OBSERVE_CONTROL_CLR_RESET(x)         (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_CONTROL_CLR_RESET_SHIFT)) & CCM_OBSERVE_CONTROL_CLR_RESET_MASK)

#define CCM_OBSERVE_CONTROL_CLR_DIVIDE_MASK      (0xFF0000U)
#define CCM_OBSERVE_CONTROL_CLR_DIVIDE_SHIFT     (16U)
/*! DIVIDE - Division factor of the divider for observed signal */
#define CCM_OBSERVE_CONTROL_CLR_DIVIDE(x)        (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_CONTROL_CLR_DIVIDE_SHIFT)) & CCM_OBSERVE_CONTROL_CLR_DIVIDE_MASK)

#define CCM_OBSERVE_CONTROL_CLR_OFF_MASK         (0x1000000U)
#define CCM_OBSERVE_CONTROL_CLR_OFF_SHIFT        (24U)
/*! OFF - Turn off */
#define CCM_OBSERVE_CONTROL_CLR_OFF(x)           (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_CONTROL_CLR_OFF_SHIFT)) & CCM_OBSERVE_CONTROL_CLR_OFF_MASK)
/*! @} */

/* The count of CCM_OBSERVE_CONTROL_CLR */
#define CCM_OBSERVE_CONTROL_CLR_COUNT            (2U)

/*! @name OBSERVE_CONTROL_TOG - Observe control */
/*! @{ */

#define CCM_OBSERVE_CONTROL_TOG_SELECT_MASK      (0x1FFU)
#define CCM_OBSERVE_CONTROL_TOG_SELECT_SHIFT     (0U)
/*! SELECT - Observe signal selector */
#define CCM_OBSERVE_CONTROL_TOG_SELECT(x)        (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_CONTROL_TOG_SELECT_SHIFT)) & CCM_OBSERVE_CONTROL_TOG_SELECT_MASK)

#define CCM_OBSERVE_CONTROL_TOG_RAW_MASK         (0x1000U)
#define CCM_OBSERVE_CONTROL_TOG_RAW_SHIFT        (12U)
/*! RAW - Observe raw signal */
#define CCM_OBSERVE_CONTROL_TOG_RAW(x)           (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_CONTROL_TOG_RAW_SHIFT)) & CCM_OBSERVE_CONTROL_TOG_RAW_MASK)

#define CCM_OBSERVE_CONTROL_TOG_INV_MASK         (0x2000U)
#define CCM_OBSERVE_CONTROL_TOG_INV_SHIFT        (13U)
#define CCM_OBSERVE_CONTROL_TOG_INV(x)           (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_CONTROL_TOG_INV_SHIFT)) & CCM_OBSERVE_CONTROL_TOG_INV_MASK)

#define CCM_OBSERVE_CONTROL_TOG_RESET_MASK       (0x8000U)
#define CCM_OBSERVE_CONTROL_TOG_RESET_SHIFT      (15U)
/*! RESET - Reset observe divider */
#define CCM_OBSERVE_CONTROL_TOG_RESET(x)         (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_CONTROL_TOG_RESET_SHIFT)) & CCM_OBSERVE_CONTROL_TOG_RESET_MASK)

#define CCM_OBSERVE_CONTROL_TOG_DIVIDE_MASK      (0xFF0000U)
#define CCM_OBSERVE_CONTROL_TOG_DIVIDE_SHIFT     (16U)
/*! DIVIDE - Division factor of the divider for observed signal */
#define CCM_OBSERVE_CONTROL_TOG_DIVIDE(x)        (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_CONTROL_TOG_DIVIDE_SHIFT)) & CCM_OBSERVE_CONTROL_TOG_DIVIDE_MASK)

#define CCM_OBSERVE_CONTROL_TOG_OFF_MASK         (0x1000000U)
#define CCM_OBSERVE_CONTROL_TOG_OFF_SHIFT        (24U)
/*! OFF - Turn off */
#define CCM_OBSERVE_CONTROL_TOG_OFF(x)           (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_CONTROL_TOG_OFF_SHIFT)) & CCM_OBSERVE_CONTROL_TOG_OFF_MASK)
/*! @} */

/* The count of CCM_OBSERVE_CONTROL_TOG */
#define CCM_OBSERVE_CONTROL_TOG_COUNT            (2U)

/*! @name OBSERVE_STATUS - Observe status */
/*! @{ */

#define CCM_OBSERVE_STATUS_SELECT_MASK           (0x1FFU)
#define CCM_OBSERVE_STATUS_SELECT_SHIFT          (0U)
/*! SELECT - Observe signal selector */
#define CCM_OBSERVE_STATUS_SELECT(x)             (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_STATUS_SELECT_SHIFT)) & CCM_OBSERVE_STATUS_SELECT_MASK)

#define CCM_OBSERVE_STATUS_RAW_MASK              (0x1000U)
#define CCM_OBSERVE_STATUS_RAW_SHIFT             (12U)
/*! RAW - Observe raw signal
 *  0b0..Select divided signal.
 *  0b1..Select raw signal.
 */
#define CCM_OBSERVE_STATUS_RAW(x)                (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_STATUS_RAW_SHIFT)) & CCM_OBSERVE_STATUS_RAW_MASK)

#define CCM_OBSERVE_STATUS_INV_MASK              (0x2000U)
#define CCM_OBSERVE_STATUS_INV_SHIFT             (13U)
/*! INV - Invert
 *  0b0..Clock phase remain same.
 *  0b1..Invert clock phase before measurement or send to IO.
 */
#define CCM_OBSERVE_STATUS_INV(x)                (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_STATUS_INV_SHIFT)) & CCM_OBSERVE_STATUS_INV_MASK)

#define CCM_OBSERVE_STATUS_RESET_MASK            (0x8000U)
#define CCM_OBSERVE_STATUS_RESET_SHIFT           (15U)
/*! RESET - Reset state
 *  0b1..Observe divider is in reset state
 *  0b0..Observe divider is not in reset state
 */
#define CCM_OBSERVE_STATUS_RESET(x)              (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_STATUS_RESET_SHIFT)) & CCM_OBSERVE_STATUS_RESET_MASK)

#define CCM_OBSERVE_STATUS_DIVIDE_MASK           (0xFF0000U)
#define CCM_OBSERVE_STATUS_DIVIDE_SHIFT          (16U)
/*! DIVIDE - Divider for observe signal */
#define CCM_OBSERVE_STATUS_DIVIDE(x)             (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_STATUS_DIVIDE_SHIFT)) & CCM_OBSERVE_STATUS_DIVIDE_MASK)

#define CCM_OBSERVE_STATUS_OFF_MASK              (0x1000000U)
#define CCM_OBSERVE_STATUS_OFF_SHIFT             (24U)
/*! OFF - Turn off slice
 *  0b0..observe slice is on
 *  0b1..observe slice is off
 */
#define CCM_OBSERVE_STATUS_OFF(x)                (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_STATUS_OFF_SHIFT)) & CCM_OBSERVE_STATUS_OFF_MASK)

#define CCM_OBSERVE_STATUS_FREQ_MEASURE_DONE_MASK (0x2000000U)
#define CCM_OBSERVE_STATUS_FREQ_MEASURE_DONE_SHIFT (25U)
/*! FREQ_MEASURE_DONE - frequency measurement done flag
 *  0b0..Frequency measurement is on-going or not started
 *  0b1..Frequency measurement is done.
 */
#define CCM_OBSERVE_STATUS_FREQ_MEASURE_DONE(x)  (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_STATUS_FREQ_MEASURE_DONE_SHIFT)) & CCM_OBSERVE_STATUS_FREQ_MEASURE_DONE_MASK)

#define CCM_OBSERVE_STATUS_POWERDOWN_MASK        (0x8000000U)
#define CCM_OBSERVE_STATUS_POWERDOWN_SHIFT       (27U)
/*! POWERDOWN - Description TBD */
#define CCM_OBSERVE_STATUS_POWERDOWN(x)          (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_STATUS_POWERDOWN_SHIFT)) & CCM_OBSERVE_STATUS_POWERDOWN_MASK)

