JayHeng/imxrt-tool-flash-algo/boards/nxp_evkmimxrt1180_rev.c/flash_algo_c0_silicon/Keil_JLink/rom_api/MIMXRT1189_cm7.h
#define CCM_GPR_SHARED3_m33_mask_gpt1_MASK       (0x2U)
#define CCM_GPR_SHARED3_m33_mask_gpt1_SHIFT      (1U)
/*! m33_mask_gpt1 - m33_mask_gpt1 */
#define CCM_GPR_SHARED3_m33_mask_gpt1(x)         (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED3_m33_mask_gpt1_SHIFT)) & CCM_GPR_SHARED3_m33_mask_gpt1_MASK)

#define CCM_GPR_SHARED3_m33_mask_gpt2_MASK       (0x4U)
#define CCM_GPR_SHARED3_m33_mask_gpt2_SHIFT      (2U)
/*! m33_mask_gpt2 - m33_mask_gpt2 */
#define CCM_GPR_SHARED3_m33_mask_gpt2(x)         (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED3_m33_mask_gpt2_SHIFT)) & CCM_GPR_SHARED3_m33_mask_gpt2_MASK)

#define CCM_GPR_SHARED3_m33_mask_can1_MASK       (0x8U)
#define CCM_GPR_SHARED3_m33_mask_can1_SHIFT      (3U)
/*! m33_mask_can1 - m33_mask_can1 */
#define CCM_GPR_SHARED3_m33_mask_can1(x)         (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED3_m33_mask_can1_SHIFT)) & CCM_GPR_SHARED3_m33_mask_can1_MASK)

#define CCM_GPR_SHARED3_m33_mask_can2_MASK       (0x10U)
#define CCM_GPR_SHARED3_m33_mask_can2_SHIFT      (4U)
/*! m33_mask_can2 - m33_mask_can2 */
#define CCM_GPR_SHARED3_m33_mask_can2(x)         (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED3_m33_mask_can2_SHIFT)) & CCM_GPR_SHARED3_m33_mask_can2_MASK)

#define CCM_GPR_SHARED3_m33_mask_can3_MASK       (0x20U)
#define CCM_GPR_SHARED3_m33_mask_can3_SHIFT      (5U)
/*! m33_mask_can3 - m33_mask_can3 */
#define CCM_GPR_SHARED3_m33_mask_can3(x)         (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED3_m33_mask_can3_SHIFT)) & CCM_GPR_SHARED3_m33_mask_can3_MASK)

#define CCM_GPR_SHARED3_m33_mask_lpuart1_MASK    (0x40U)
#define CCM_GPR_SHARED3_m33_mask_lpuart1_SHIFT   (6U)
/*! m33_mask_lpuart1 - m33_mask_lpuart1 */
#define CCM_GPR_SHARED3_m33_mask_lpuart1(x)      (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED3_m33_mask_lpuart1_SHIFT)) & CCM_GPR_SHARED3_m33_mask_lpuart1_MASK)

#define CCM_GPR_SHARED3_m33_mask_lpuart2_MASK    (0x80U)
#define CCM_GPR_SHARED3_m33_mask_lpuart2_SHIFT   (7U)
/*! m33_mask_lpuart2 - m33_mask_lpuart2 */
#define CCM_GPR_SHARED3_m33_mask_lpuart2(x)      (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED3_m33_mask_lpuart2_SHIFT)) & CCM_GPR_SHARED3_m33_mask_lpuart2_MASK)

#define CCM_GPR_SHARED3_m33_mask_lpuart3_MASK    (0x100U)
#define CCM_GPR_SHARED3_m33_mask_lpuart3_SHIFT   (8U)
/*! m33_mask_lpuart3 - m33_mask_lpuart3 */
#define CCM_GPR_SHARED3_m33_mask_lpuart3(x)      (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED3_m33_mask_lpuart3_SHIFT)) & CCM_GPR_SHARED3_m33_mask_lpuart3_MASK)

#define CCM_GPR_SHARED3_m33_mask_lpuart4_MASK    (0x200U)
#define CCM_GPR_SHARED3_m33_mask_lpuart4_SHIFT   (9U)
/*! m33_mask_lpuart4 - m33_mask_lpuart4 */
#define CCM_GPR_SHARED3_m33_mask_lpuart4(x)      (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED3_m33_mask_lpuart4_SHIFT)) & CCM_GPR_SHARED3_m33_mask_lpuart4_MASK)

#define CCM_GPR_SHARED3_m33_mask_lpuart5_MASK    (0x400U)
#define CCM_GPR_SHARED3_m33_mask_lpuart5_SHIFT   (10U)
/*! m33_mask_lpuart5 - m33_mask_lpuart5 */
#define CCM_GPR_SHARED3_m33_mask_lpuart5(x)      (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED3_m33_mask_lpuart5_SHIFT)) & CCM_GPR_SHARED3_m33_mask_lpuart5_MASK)

#define CCM_GPR_SHARED3_m33_mask_lpuart6_MASK    (0x800U)
#define CCM_GPR_SHARED3_m33_mask_lpuart6_SHIFT   (11U)
/*! m33_mask_lpuart6 - m33_mask_lpuart6 */
#define CCM_GPR_SHARED3_m33_mask_lpuart6(x)      (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED3_m33_mask_lpuart6_SHIFT)) & CCM_GPR_SHARED3_m33_mask_lpuart6_MASK)

#define CCM_GPR_SHARED3_m33_mask_lpuart7_MASK    (0x1000U)
#define CCM_GPR_SHARED3_m33_mask_lpuart7_SHIFT   (12U)
/*! m33_mask_lpuart7 - m33_mask_lpuart7 */
#define CCM_GPR_SHARED3_m33_mask_lpuart7(x)      (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED3_m33_mask_lpuart7_SHIFT)) & CCM_GPR_SHARED3_m33_mask_lpuart7_MASK)

#define CCM_GPR_SHARED3_m33_mask_lpuart8_MASK    (0x2000U)
#define CCM_GPR_SHARED3_m33_mask_lpuart8_SHIFT   (13U)
/*! m33_mask_lpuart8 - m33_mask_lpuart8 */
#define CCM_GPR_SHARED3_m33_mask_lpuart8(x)      (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED3_m33_mask_lpuart8_SHIFT)) & CCM_GPR_SHARED3_m33_mask_lpuart8_MASK)

#define CCM_GPR_SHARED3_m33_mask_lpuart9_MASK    (0x4000U)
#define CCM_GPR_SHARED3_m33_mask_lpuart9_SHIFT   (14U)
/*! m33_mask_lpuart9 - m33_mask_lpuart9 */
#define CCM_GPR_SHARED3_m33_mask_lpuart9(x)      (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED3_m33_mask_lpuart9_SHIFT)) & CCM_GPR_SHARED3_m33_mask_lpuart9_MASK)

#define CCM_GPR_SHARED3_m33_mask_lpuart10_MASK   (0x8000U)
#define CCM_GPR_SHARED3_m33_mask_lpuart10_SHIFT  (15U)
/*! m33_mask_lpuart10 - m33_mask_lpuart10 */
#define CCM_GPR_SHARED3_m33_mask_lpuart10(x)     (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED3_m33_mask_lpuart10_SHIFT)) & CCM_GPR_SHARED3_m33_mask_lpuart10_MASK)

#define CCM_GPR_SHARED3_m33_mask_lpuart11_MASK   (0x10000U)
#define CCM_GPR_SHARED3_m33_mask_lpuart11_SHIFT  (16U)
/*! m33_mask_lpuart11 - m33_mask_lpuart11 */
#define CCM_GPR_SHARED3_m33_mask_lpuart11(x)     (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED3_m33_mask_lpuart11_SHIFT)) & CCM_GPR_SHARED3_m33_mask_lpuart11_MASK)

#define CCM_GPR_SHARED3_m33_mask_lpuart12_MASK   (0x20000U)
#define CCM_GPR_SHARED3_m33_mask_lpuart12_SHIFT  (17U)
/*! m33_mask_lpuart12 - m33_mask_lpuart12 */
#define CCM_GPR_SHARED3_m33_mask_lpuart12(x)     (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED3_m33_mask_lpuart12_SHIFT)) & CCM_GPR_SHARED3_m33_mask_lpuart12_MASK)

#define CCM_GPR_SHARED3_m33_mask_lpi2c1_MASK     (0x40000U)
#define CCM_GPR_SHARED3_m33_mask_lpi2c1_SHIFT    (18U)
/*! m33_mask_lpi2c1 - m33_mask_lpi2c1 */
#define CCM_GPR_SHARED3_m33_mask_lpi2c1(x)       (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED3_m33_mask_lpi2c1_SHIFT)) & CCM_GPR_SHARED3_m33_mask_lpi2c1_MASK)

#define CCM_GPR_SHARED3_m33_mask_lpi2c2_MASK     (0x80000U)
#define CCM_GPR_SHARED3_m33_mask_lpi2c2_SHIFT    (19U)
/*! m33_mask_lpi2c2 - m33_mask_lpi2c2 */
#define CCM_GPR_SHARED3_m33_mask_lpi2c2(x)       (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED3_m33_mask_lpi2c2_SHIFT)) & CCM_GPR_SHARED3_m33_mask_lpi2c2_MASK)

#define CCM_GPR_SHARED3_m33_mask_lpi2c3_MASK     (0x100000U)
#define CCM_GPR_SHARED3_m33_mask_lpi2c3_SHIFT    (20U)
/*! m33_mask_lpi2c3 - m33_mask_lpi2c3 */
#define CCM_GPR_SHARED3_m33_mask_lpi2c3(x)       (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED3_m33_mask_lpi2c3_SHIFT)) & CCM_GPR_SHARED3_m33_mask_lpi2c3_MASK)

