JayHeng/imxrt-tool-flash-algo/boards/nxp_evkmimxrt1180_rev.c/flash_algo_c0_silicon/Keil_JLink/rom_api/MIMXRT1189_cm7.h
#define CCM_GPR_SHARED3_SET_m33_mask_lpuart10_MASK (0x8000U)
#define CCM_GPR_SHARED3_SET_m33_mask_lpuart10_SHIFT (15U)
/*! m33_mask_lpuart10 - m33_mask_lpuart10 */
#define CCM_GPR_SHARED3_SET_m33_mask_lpuart10(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED3_SET_m33_mask_lpuart10_SHIFT)) & CCM_GPR_SHARED3_SET_m33_mask_lpuart10_MASK)

#define CCM_GPR_SHARED3_SET_m33_mask_lpuart11_MASK (0x10000U)
#define CCM_GPR_SHARED3_SET_m33_mask_lpuart11_SHIFT (16U)
/*! m33_mask_lpuart11 - m33_mask_lpuart11 */
#define CCM_GPR_SHARED3_SET_m33_mask_lpuart11(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED3_SET_m33_mask_lpuart11_SHIFT)) & CCM_GPR_SHARED3_SET_m33_mask_lpuart11_MASK)

#define CCM_GPR_SHARED3_SET_m33_mask_lpuart12_MASK (0x20000U)
#define CCM_GPR_SHARED3_SET_m33_mask_lpuart12_SHIFT (17U)
/*! m33_mask_lpuart12 - m33_mask_lpuart12 */
#define CCM_GPR_SHARED3_SET_m33_mask_lpuart12(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED3_SET_m33_mask_lpuart12_SHIFT)) & CCM_GPR_SHARED3_SET_m33_mask_lpuart12_MASK)

#define CCM_GPR_SHARED3_SET_m33_mask_lpi2c1_MASK (0x40000U)
#define CCM_GPR_SHARED3_SET_m33_mask_lpi2c1_SHIFT (18U)
/*! m33_mask_lpi2c1 - m33_mask_lpi2c1 */
#define CCM_GPR_SHARED3_SET_m33_mask_lpi2c1(x)   (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED3_SET_m33_mask_lpi2c1_SHIFT)) & CCM_GPR_SHARED3_SET_m33_mask_lpi2c1_MASK)

#define CCM_GPR_SHARED3_SET_m33_mask_lpi2c2_MASK (0x80000U)
#define CCM_GPR_SHARED3_SET_m33_mask_lpi2c2_SHIFT (19U)
/*! m33_mask_lpi2c2 - m33_mask_lpi2c2 */
#define CCM_GPR_SHARED3_SET_m33_mask_lpi2c2(x)   (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED3_SET_m33_mask_lpi2c2_SHIFT)) & CCM_GPR_SHARED3_SET_m33_mask_lpi2c2_MASK)

#define CCM_GPR_SHARED3_SET_m33_mask_lpi2c3_MASK (0x100000U)
#define CCM_GPR_SHARED3_SET_m33_mask_lpi2c3_SHIFT (20U)
/*! m33_mask_lpi2c3 - m33_mask_lpi2c3 */
#define CCM_GPR_SHARED3_SET_m33_mask_lpi2c3(x)   (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED3_SET_m33_mask_lpi2c3_SHIFT)) & CCM_GPR_SHARED3_SET_m33_mask_lpi2c3_MASK)

#define CCM_GPR_SHARED3_SET_m33_mask_lpi2c4_MASK (0x200000U)
#define CCM_GPR_SHARED3_SET_m33_mask_lpi2c4_SHIFT (21U)
/*! m33_mask_lpi2c4 - m33_mask_lpi2c4 */
#define CCM_GPR_SHARED3_SET_m33_mask_lpi2c4(x)   (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED3_SET_m33_mask_lpi2c4_SHIFT)) & CCM_GPR_SHARED3_SET_m33_mask_lpi2c4_MASK)

#define CCM_GPR_SHARED3_SET_m33_mask_lpi2c5_MASK (0x400000U)
#define CCM_GPR_SHARED3_SET_m33_mask_lpi2c5_SHIFT (22U)
/*! m33_mask_lpi2c5 - m33_mask_lpi2c5 */
#define CCM_GPR_SHARED3_SET_m33_mask_lpi2c5(x)   (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED3_SET_m33_mask_lpi2c5_SHIFT)) & CCM_GPR_SHARED3_SET_m33_mask_lpi2c5_MASK)

#define CCM_GPR_SHARED3_SET_m33_mask_lpi2c6_MASK (0x800000U)
#define CCM_GPR_SHARED3_SET_m33_mask_lpi2c6_SHIFT (23U)
/*! m33_mask_lpi2c6 - m33_mask_lpi2c6 */
#define CCM_GPR_SHARED3_SET_m33_mask_lpi2c6(x)   (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED3_SET_m33_mask_lpi2c6_SHIFT)) & CCM_GPR_SHARED3_SET_m33_mask_lpi2c6_MASK)

#define CCM_GPR_SHARED3_SET_m33_mask_lpspi1_MASK (0x1000000U)
#define CCM_GPR_SHARED3_SET_m33_mask_lpspi1_SHIFT (24U)
/*! m33_mask_lpspi1 - m33_mask_lpspi1 */
#define CCM_GPR_SHARED3_SET_m33_mask_lpspi1(x)   (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED3_SET_m33_mask_lpspi1_SHIFT)) & CCM_GPR_SHARED3_SET_m33_mask_lpspi1_MASK)

#define CCM_GPR_SHARED3_SET_m33_mask_lpspi2_MASK (0x2000000U)
#define CCM_GPR_SHARED3_SET_m33_mask_lpspi2_SHIFT (25U)
/*! m33_mask_lpspi2 - m33_mask_lpspi2 */
#define CCM_GPR_SHARED3_SET_m33_mask_lpspi2(x)   (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED3_SET_m33_mask_lpspi2_SHIFT)) & CCM_GPR_SHARED3_SET_m33_mask_lpspi2_MASK)

#define CCM_GPR_SHARED3_SET_m33_mask_lpspi3_MASK (0x4000000U)
#define CCM_GPR_SHARED3_SET_m33_mask_lpspi3_SHIFT (26U)
/*! m33_mask_lpspi3 - m33_mask_lpspi3 */
#define CCM_GPR_SHARED3_SET_m33_mask_lpspi3(x)   (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED3_SET_m33_mask_lpspi3_SHIFT)) & CCM_GPR_SHARED3_SET_m33_mask_lpspi3_MASK)

#define CCM_GPR_SHARED3_SET_m33_mask_lpspi4_MASK (0x8000000U)
#define CCM_GPR_SHARED3_SET_m33_mask_lpspi4_SHIFT (27U)
/*! m33_mask_lpspi4 - m33_mask_lpspi4 */
#define CCM_GPR_SHARED3_SET_m33_mask_lpspi4(x)   (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED3_SET_m33_mask_lpspi4_SHIFT)) & CCM_GPR_SHARED3_SET_m33_mask_lpspi4_MASK)

#define CCM_GPR_SHARED3_SET_m33_mask_lpspi5_MASK (0x10000000U)
#define CCM_GPR_SHARED3_SET_m33_mask_lpspi5_SHIFT (28U)
/*! m33_mask_lpspi5 - m33_mask_lpspi5 */
#define CCM_GPR_SHARED3_SET_m33_mask_lpspi5(x)   (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED3_SET_m33_mask_lpspi5_SHIFT)) & CCM_GPR_SHARED3_SET_m33_mask_lpspi5_MASK)

#define CCM_GPR_SHARED3_SET_m33_mask_lpspi6_MASK (0x20000000U)
#define CCM_GPR_SHARED3_SET_m33_mask_lpspi6_SHIFT (29U)
/*! m33_mask_lpspi6 - m33_mask_lpspi6 */
#define CCM_GPR_SHARED3_SET_m33_mask_lpspi6(x)   (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED3_SET_m33_mask_lpspi6_SHIFT)) & CCM_GPR_SHARED3_SET_m33_mask_lpspi6_MASK)

#define CCM_GPR_SHARED3_SET_m33_mask_sinc1_MASK  (0x40000000U)
#define CCM_GPR_SHARED3_SET_m33_mask_sinc1_SHIFT (30U)
/*! m33_mask_sinc1 - m33_mask_sinc1 */
#define CCM_GPR_SHARED3_SET_m33_mask_sinc1(x)    (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED3_SET_m33_mask_sinc1_SHIFT)) & CCM_GPR_SHARED3_SET_m33_mask_sinc1_MASK)

#define CCM_GPR_SHARED3_SET_m33_mask_sinc2_MASK  (0x80000000U)
#define CCM_GPR_SHARED3_SET_m33_mask_sinc2_SHIFT (31U)
/*! m33_mask_sinc2 - m33_mask_sinc2 */
#define CCM_GPR_SHARED3_SET_m33_mask_sinc2(x)    (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED3_SET_m33_mask_sinc2_SHIFT)) & CCM_GPR_SHARED3_SET_m33_mask_sinc2_MASK)
/*! @} */

/*! @name GPR_SHARED3_CLR - General Purpose Register */
/*! @{ */

#define CCM_GPR_SHARED3_CLR_m33_mask_tpm6_MASK   (0x1U)
#define CCM_GPR_SHARED3_CLR_m33_mask_tpm6_SHIFT  (0U)
/*! m33_mask_tpm6 - m33_mask_tpm6 */
#define CCM_GPR_SHARED3_CLR_m33_mask_tpm6(x)     (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED3_CLR_m33_mask_tpm6_SHIFT)) & CCM_GPR_SHARED3_CLR_m33_mask_tpm6_MASK)

#define CCM_GPR_SHARED3_CLR_m33_mask_gpt1_MASK   (0x2U)
#define CCM_GPR_SHARED3_CLR_m33_mask_gpt1_SHIFT  (1U)
/*! m33_mask_gpt1 - m33_mask_gpt1 */
#define CCM_GPR_SHARED3_CLR_m33_mask_gpt1(x)     (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED3_CLR_m33_mask_gpt1_SHIFT)) & CCM_GPR_SHARED3_CLR_m33_mask_gpt1_MASK)

