JayHeng/imxrt-tool-flash-algo/boards/nxp_evkmimxrt1180_rev.c/flash_algo_c0_silicon/Keil_JLink/rom_api/MIMXRT1189_cm7.h
#define CCM_GPR_SHARED8_CLR_m33_adc1_ipg_stop_MASK (0x200U)
#define CCM_GPR_SHARED8_CLR_m33_adc1_ipg_stop_SHIFT (9U)
/*! m33_adc1_ipg_stop - m33_adc1_ipg_stop */
#define CCM_GPR_SHARED8_CLR_m33_adc1_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED8_CLR_m33_adc1_ipg_stop_SHIFT)) & CCM_GPR_SHARED8_CLR_m33_adc1_ipg_stop_MASK)

#define CCM_GPR_SHARED8_CLR_m33_adc2_ipg_stop_MASK (0x400U)
#define CCM_GPR_SHARED8_CLR_m33_adc2_ipg_stop_SHIFT (10U)
/*! m33_adc2_ipg_stop - m33_adc2_ipg_stop */
#define CCM_GPR_SHARED8_CLR_m33_adc2_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED8_CLR_m33_adc2_ipg_stop_SHIFT)) & CCM_GPR_SHARED8_CLR_m33_adc2_ipg_stop_MASK)

#define CCM_GPR_SHARED8_CLR_m33_flexspi1_ipg_stop_MASK (0x800U)
#define CCM_GPR_SHARED8_CLR_m33_flexspi1_ipg_stop_SHIFT (11U)
/*! m33_flexspi1_ipg_stop - m33_flexspi1_ipg_stop */
#define CCM_GPR_SHARED8_CLR_m33_flexspi1_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED8_CLR_m33_flexspi1_ipg_stop_SHIFT)) & CCM_GPR_SHARED8_CLR_m33_flexspi1_ipg_stop_MASK)

#define CCM_GPR_SHARED8_CLR_m33_flexspi2_ipg_stop_MASK (0x1000U)
#define CCM_GPR_SHARED8_CLR_m33_flexspi2_ipg_stop_SHIFT (12U)
/*! m33_flexspi2_ipg_stop - m33_flexspi2_ipg_stop */
#define CCM_GPR_SHARED8_CLR_m33_flexspi2_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED8_CLR_m33_flexspi2_ipg_stop_SHIFT)) & CCM_GPR_SHARED8_CLR_m33_flexspi2_ipg_stop_MASK)

#define CCM_GPR_SHARED8_CLR_m33_trdc_ipg_stop_MASK (0x2000U)
#define CCM_GPR_SHARED8_CLR_m33_trdc_ipg_stop_SHIFT (13U)
/*! m33_trdc_ipg_stop - m33_trdc_ipg_stop */
#define CCM_GPR_SHARED8_CLR_m33_trdc_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED8_CLR_m33_trdc_ipg_stop_SHIFT)) & CCM_GPR_SHARED8_CLR_m33_trdc_ipg_stop_MASK)

#define CCM_GPR_SHARED8_CLR_m33_semc_ipg_stop_MASK (0x4000U)
#define CCM_GPR_SHARED8_CLR_m33_semc_ipg_stop_SHIFT (14U)
/*! m33_semc_ipg_stop - m33_semc_ipg_stop */
#define CCM_GPR_SHARED8_CLR_m33_semc_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED8_CLR_m33_semc_ipg_stop_SHIFT)) & CCM_GPR_SHARED8_CLR_m33_semc_ipg_stop_MASK)

#define CCM_GPR_SHARED8_CLR_m33_iee_ipg_stop_MASK (0x8000U)
#define CCM_GPR_SHARED8_CLR_m33_iee_ipg_stop_SHIFT (15U)
/*! m33_iee_ipg_stop - m33_iee_ipg_stop */
#define CCM_GPR_SHARED8_CLR_m33_iee_ipg_stop(x)  (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED8_CLR_m33_iee_ipg_stop_SHIFT)) & CCM_GPR_SHARED8_CLR_m33_iee_ipg_stop_MASK)

#define CCM_GPR_SHARED8_CLR_m33_gpio1_ipg_stop_MASK (0x10000U)
#define CCM_GPR_SHARED8_CLR_m33_gpio1_ipg_stop_SHIFT (16U)
/*! m33_gpio1_ipg_stop - m33_gpio1_ipg_stop */
#define CCM_GPR_SHARED8_CLR_m33_gpio1_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED8_CLR_m33_gpio1_ipg_stop_SHIFT)) & CCM_GPR_SHARED8_CLR_m33_gpio1_ipg_stop_MASK)

#define CCM_GPR_SHARED8_CLR_m33_gpio2_ipg_stop_MASK (0x20000U)
#define CCM_GPR_SHARED8_CLR_m33_gpio2_ipg_stop_SHIFT (17U)
/*! m33_gpio2_ipg_stop - m33_gpio2_ipg_stop */
#define CCM_GPR_SHARED8_CLR_m33_gpio2_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED8_CLR_m33_gpio2_ipg_stop_SHIFT)) & CCM_GPR_SHARED8_CLR_m33_gpio2_ipg_stop_MASK)

#define CCM_GPR_SHARED8_CLR_m33_gpio3_ipg_stop_MASK (0x40000U)
#define CCM_GPR_SHARED8_CLR_m33_gpio3_ipg_stop_SHIFT (18U)
/*! m33_gpio3_ipg_stop - m33_gpio3_ipg_stop */
#define CCM_GPR_SHARED8_CLR_m33_gpio3_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED8_CLR_m33_gpio3_ipg_stop_SHIFT)) & CCM_GPR_SHARED8_CLR_m33_gpio3_ipg_stop_MASK)

#define CCM_GPR_SHARED8_CLR_m33_gpio4_ipg_stop_MASK (0x80000U)
#define CCM_GPR_SHARED8_CLR_m33_gpio4_ipg_stop_SHIFT (19U)
/*! m33_gpio4_ipg_stop - m33_gpio4_ipg_stop */
#define CCM_GPR_SHARED8_CLR_m33_gpio4_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED8_CLR_m33_gpio4_ipg_stop_SHIFT)) & CCM_GPR_SHARED8_CLR_m33_gpio4_ipg_stop_MASK)

#define CCM_GPR_SHARED8_CLR_m33_gpio5_ipg_stop_MASK (0x100000U)
#define CCM_GPR_SHARED8_CLR_m33_gpio5_ipg_stop_SHIFT (20U)
/*! m33_gpio5_ipg_stop - m33_gpio5_ipg_stop */
#define CCM_GPR_SHARED8_CLR_m33_gpio5_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED8_CLR_m33_gpio5_ipg_stop_SHIFT)) & CCM_GPR_SHARED8_CLR_m33_gpio5_ipg_stop_MASK)

#define CCM_GPR_SHARED8_CLR_m33_gpio6_ipg_stop_MASK (0x200000U)
#define CCM_GPR_SHARED8_CLR_m33_gpio6_ipg_stop_SHIFT (21U)
/*! m33_gpio6_ipg_stop - m33_gpio6_ipg_stop */
#define CCM_GPR_SHARED8_CLR_m33_gpio6_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED8_CLR_m33_gpio6_ipg_stop_SHIFT)) & CCM_GPR_SHARED8_CLR_m33_gpio6_ipg_stop_MASK)

#define CCM_GPR_SHARED8_CLR_m33_flexio1_ipg_stop_MASK (0x400000U)
#define CCM_GPR_SHARED8_CLR_m33_flexio1_ipg_stop_SHIFT (22U)
/*! m33_flexio1_ipg_stop - m33_flexio1_ipg_stop */
#define CCM_GPR_SHARED8_CLR_m33_flexio1_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED8_CLR_m33_flexio1_ipg_stop_SHIFT)) & CCM_GPR_SHARED8_CLR_m33_flexio1_ipg_stop_MASK)

#define CCM_GPR_SHARED8_CLR_m33_flexio2_ipg_stop_MASK (0x800000U)
#define CCM_GPR_SHARED8_CLR_m33_flexio2_ipg_stop_SHIFT (23U)
/*! m33_flexio2_ipg_stop - m33_flexio2_ipg_stop */
#define CCM_GPR_SHARED8_CLR_m33_flexio2_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED8_CLR_m33_flexio2_ipg_stop_SHIFT)) & CCM_GPR_SHARED8_CLR_m33_flexio2_ipg_stop_MASK)

#define CCM_GPR_SHARED8_CLR_m33_can1_ipg_stop_MASK (0x1000000U)
#define CCM_GPR_SHARED8_CLR_m33_can1_ipg_stop_SHIFT (24U)
/*! m33_can1_ipg_stop - m33_can1_ipg_stop */
#define CCM_GPR_SHARED8_CLR_m33_can1_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED8_CLR_m33_can1_ipg_stop_SHIFT)) & CCM_GPR_SHARED8_CLR_m33_can1_ipg_stop_MASK)

#define CCM_GPR_SHARED8_CLR_m33_can2_ipg_stop_MASK (0x2000000U)
#define CCM_GPR_SHARED8_CLR_m33_can2_ipg_stop_SHIFT (25U)
/*! m33_can2_ipg_stop - m33_can2_ipg_stop */
#define CCM_GPR_SHARED8_CLR_m33_can2_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED8_CLR_m33_can2_ipg_stop_SHIFT)) & CCM_GPR_SHARED8_CLR_m33_can2_ipg_stop_MASK)

#define CCM_GPR_SHARED8_CLR_m33_can3_ipg_stop_MASK (0x4000000U)
#define CCM_GPR_SHARED8_CLR_m33_can3_ipg_stop_SHIFT (26U)
/*! m33_can3_ipg_stop - m33_can3_ipg_stop */
#define CCM_GPR_SHARED8_CLR_m33_can3_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED8_CLR_m33_can3_ipg_stop_SHIFT)) & CCM_GPR_SHARED8_CLR_m33_can3_ipg_stop_MASK)

