JayHeng/imxrt-tool-flash-algo/boards/nxp_evkmimxrt1180_rev.c/flash_algo_c0_silicon/Keil_JLink/rom_api/MIMXRT1189_cm7.h
#define CCM_GPR_SHARED10_SET_m33_lpuart7_ipg_doze_MASK (0x4000000U)
#define CCM_GPR_SHARED10_SET_m33_lpuart7_ipg_doze_SHIFT (26U)
/*! m33_lpuart7_ipg_doze - m33_lpuart7_ipg_doze */
#define CCM_GPR_SHARED10_SET_m33_lpuart7_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED10_SET_m33_lpuart7_ipg_doze_SHIFT)) & CCM_GPR_SHARED10_SET_m33_lpuart7_ipg_doze_MASK)

#define CCM_GPR_SHARED10_SET_m33_lpuart8_ipg_doze_MASK (0x8000000U)
#define CCM_GPR_SHARED10_SET_m33_lpuart8_ipg_doze_SHIFT (27U)
/*! m33_lpuart8_ipg_doze - m33_lpuart8_ipg_doze */
#define CCM_GPR_SHARED10_SET_m33_lpuart8_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED10_SET_m33_lpuart8_ipg_doze_SHIFT)) & CCM_GPR_SHARED10_SET_m33_lpuart8_ipg_doze_MASK)

#define CCM_GPR_SHARED10_SET_m33_lpuart9_ipg_doze_MASK (0x10000000U)
#define CCM_GPR_SHARED10_SET_m33_lpuart9_ipg_doze_SHIFT (28U)
/*! m33_lpuart9_ipg_doze - m33_lpuart9_ipg_doze */
#define CCM_GPR_SHARED10_SET_m33_lpuart9_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED10_SET_m33_lpuart9_ipg_doze_SHIFT)) & CCM_GPR_SHARED10_SET_m33_lpuart9_ipg_doze_MASK)

#define CCM_GPR_SHARED10_SET_m33_lpuart10_ipg_doze_MASK (0x20000000U)
#define CCM_GPR_SHARED10_SET_m33_lpuart10_ipg_doze_SHIFT (29U)
/*! m33_lpuart10_ipg_doze - m33_lpuart10_ipg_doze */
#define CCM_GPR_SHARED10_SET_m33_lpuart10_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED10_SET_m33_lpuart10_ipg_doze_SHIFT)) & CCM_GPR_SHARED10_SET_m33_lpuart10_ipg_doze_MASK)

#define CCM_GPR_SHARED10_SET_m33_lpuart11_ipg_doze_MASK (0x40000000U)
#define CCM_GPR_SHARED10_SET_m33_lpuart11_ipg_doze_SHIFT (30U)
/*! m33_lpuart11_ipg_doze - m33_lpuart11_ipg_doze */
#define CCM_GPR_SHARED10_SET_m33_lpuart11_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED10_SET_m33_lpuart11_ipg_doze_SHIFT)) & CCM_GPR_SHARED10_SET_m33_lpuart11_ipg_doze_MASK)

#define CCM_GPR_SHARED10_SET_m33_lpuart12_ipg_doze_MASK (0x80000000U)
#define CCM_GPR_SHARED10_SET_m33_lpuart12_ipg_doze_SHIFT (31U)
/*! m33_lpuart12_ipg_doze - m33_lpuart12_ipg_doze */
#define CCM_GPR_SHARED10_SET_m33_lpuart12_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED10_SET_m33_lpuart12_ipg_doze_SHIFT)) & CCM_GPR_SHARED10_SET_m33_lpuart12_ipg_doze_MASK)
/*! @} */

/*! @name GPR_SHARED10_CLR - General Purpose Register */
/*! @{ */

#define CCM_GPR_SHARED10_CLR_m33_adc1_ipg_doze_MASK (0x1U)
#define CCM_GPR_SHARED10_CLR_m33_adc1_ipg_doze_SHIFT (0U)
/*! m33_adc1_ipg_doze - m33_adc1_ipg_doze */
#define CCM_GPR_SHARED10_CLR_m33_adc1_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED10_CLR_m33_adc1_ipg_doze_SHIFT)) & CCM_GPR_SHARED10_CLR_m33_adc1_ipg_doze_MASK)

#define CCM_GPR_SHARED10_CLR_m33_adc2_ipg_doze_MASK (0x2U)
#define CCM_GPR_SHARED10_CLR_m33_adc2_ipg_doze_SHIFT (1U)
/*! m33_adc2_ipg_doze - m33_adc2_ipg_doze */
#define CCM_GPR_SHARED10_CLR_m33_adc2_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED10_CLR_m33_adc2_ipg_doze_SHIFT)) & CCM_GPR_SHARED10_CLR_m33_adc2_ipg_doze_MASK)

#define CCM_GPR_SHARED10_CLR_m33_flexspi1_ipg_doze_MASK (0x4U)
#define CCM_GPR_SHARED10_CLR_m33_flexspi1_ipg_doze_SHIFT (2U)
/*! m33_flexspi1_ipg_doze - m33_flexspi1_ipg_doze */
#define CCM_GPR_SHARED10_CLR_m33_flexspi1_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED10_CLR_m33_flexspi1_ipg_doze_SHIFT)) & CCM_GPR_SHARED10_CLR_m33_flexspi1_ipg_doze_MASK)

#define CCM_GPR_SHARED10_CLR_m33_flexspi2_ipg_doze_MASK (0x8U)
#define CCM_GPR_SHARED10_CLR_m33_flexspi2_ipg_doze_SHIFT (3U)
/*! m33_flexspi2_ipg_doze - m33_flexspi2_ipg_doze */
#define CCM_GPR_SHARED10_CLR_m33_flexspi2_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED10_CLR_m33_flexspi2_ipg_doze_SHIFT)) & CCM_GPR_SHARED10_CLR_m33_flexspi2_ipg_doze_MASK)

#define CCM_GPR_SHARED10_CLR_m33_flexio1_ipg_doze_MASK (0x10U)
#define CCM_GPR_SHARED10_CLR_m33_flexio1_ipg_doze_SHIFT (4U)
/*! m33_flexio1_ipg_doze - m33_flexio1_ipg_doze */
#define CCM_GPR_SHARED10_CLR_m33_flexio1_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED10_CLR_m33_flexio1_ipg_doze_SHIFT)) & CCM_GPR_SHARED10_CLR_m33_flexio1_ipg_doze_MASK)

#define CCM_GPR_SHARED10_CLR_m33_flexio2_ipg_doze_MASK (0x20U)
#define CCM_GPR_SHARED10_CLR_m33_flexio2_ipg_doze_SHIFT (5U)
/*! m33_flexio2_ipg_doze - m33_flexio2_ipg_doze */
#define CCM_GPR_SHARED10_CLR_m33_flexio2_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED10_CLR_m33_flexio2_ipg_doze_SHIFT)) & CCM_GPR_SHARED10_CLR_m33_flexio2_ipg_doze_MASK)

#define CCM_GPR_SHARED10_CLR_m33_lpit1_ipg_doze_MASK (0x40U)
#define CCM_GPR_SHARED10_CLR_m33_lpit1_ipg_doze_SHIFT (6U)
/*! m33_lpit1_ipg_doze - m33_lpit1_ipg_doze */
#define CCM_GPR_SHARED10_CLR_m33_lpit1_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED10_CLR_m33_lpit1_ipg_doze_SHIFT)) & CCM_GPR_SHARED10_CLR_m33_lpit1_ipg_doze_MASK)

#define CCM_GPR_SHARED10_CLR_m33_lpit2_ipg_doze_MASK (0x80U)
#define CCM_GPR_SHARED10_CLR_m33_lpit2_ipg_doze_SHIFT (7U)
/*! m33_lpit2_ipg_doze - m33_lpit2_ipg_doze */
#define CCM_GPR_SHARED10_CLR_m33_lpit2_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED10_CLR_m33_lpit2_ipg_doze_SHIFT)) & CCM_GPR_SHARED10_CLR_m33_lpit2_ipg_doze_MASK)

#define CCM_GPR_SHARED10_CLR_m33_lpit3_ipg_doze_MASK (0x100U)
#define CCM_GPR_SHARED10_CLR_m33_lpit3_ipg_doze_SHIFT (8U)
/*! m33_lpit3_ipg_doze - m33_lpit3_ipg_doze */
#define CCM_GPR_SHARED10_CLR_m33_lpit3_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED10_CLR_m33_lpit3_ipg_doze_SHIFT)) & CCM_GPR_SHARED10_CLR_m33_lpit3_ipg_doze_MASK)

#define CCM_GPR_SHARED10_CLR_m33_tpm1_ipg_doze_MASK (0x200U)
#define CCM_GPR_SHARED10_CLR_m33_tpm1_ipg_doze_SHIFT (9U)
/*! m33_tpm1_ipg_doze - m33_tpm1_ipg_doze */
#define CCM_GPR_SHARED10_CLR_m33_tpm1_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED10_CLR_m33_tpm1_ipg_doze_SHIFT)) & CCM_GPR_SHARED10_CLR_m33_tpm1_ipg_doze_MASK)

#define CCM_GPR_SHARED10_CLR_m33_tpm2_ipg_doze_MASK (0x400U)
#define CCM_GPR_SHARED10_CLR_m33_tpm2_ipg_doze_SHIFT (10U)
/*! m33_tpm2_ipg_doze - m33_tpm2_ipg_doze */
#define CCM_GPR_SHARED10_CLR_m33_tpm2_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED10_CLR_m33_tpm2_ipg_doze_SHIFT)) & CCM_GPR_SHARED10_CLR_m33_tpm2_ipg_doze_MASK)

#define CCM_GPR_SHARED10_CLR_m33_tpm3_ipg_doze_MASK (0x800U)
#define CCM_GPR_SHARED10_CLR_m33_tpm3_ipg_doze_SHIFT (11U)
/*! m33_tpm3_ipg_doze - m33_tpm3_ipg_doze */
#define CCM_GPR_SHARED10_CLR_m33_tpm3_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED10_CLR_m33_tpm3_ipg_doze_SHIFT)) & CCM_GPR_SHARED10_CLR_m33_tpm3_ipg_doze_MASK)

