JayHeng/imxrt-tool-flash-algo/boards/nxp_evkmimxrt1180_rev.c/flash_algo_c0_silicon/Keil_JLink/rom_api/MIMXRT1189_cm7.h
#define CCM_GPR_SHARED12_SET_m7_iee_ipg_stop_MASK (0x8000U)
#define CCM_GPR_SHARED12_SET_m7_iee_ipg_stop_SHIFT (15U)
/*! m7_iee_ipg_stop - m7_iee_ipg_stop */
#define CCM_GPR_SHARED12_SET_m7_iee_ipg_stop(x)  (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED12_SET_m7_iee_ipg_stop_SHIFT)) & CCM_GPR_SHARED12_SET_m7_iee_ipg_stop_MASK)

#define CCM_GPR_SHARED12_SET_m7_gpio1_ipg_stop_MASK (0x10000U)
#define CCM_GPR_SHARED12_SET_m7_gpio1_ipg_stop_SHIFT (16U)
/*! m7_gpio1_ipg_stop - m7_gpio1_ipg_stop */
#define CCM_GPR_SHARED12_SET_m7_gpio1_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED12_SET_m7_gpio1_ipg_stop_SHIFT)) & CCM_GPR_SHARED12_SET_m7_gpio1_ipg_stop_MASK)

#define CCM_GPR_SHARED12_SET_m7_gpio2_ipg_stop_MASK (0x20000U)
#define CCM_GPR_SHARED12_SET_m7_gpio2_ipg_stop_SHIFT (17U)
/*! m7_gpio2_ipg_stop - m7_gpio2_ipg_stop */
#define CCM_GPR_SHARED12_SET_m7_gpio2_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED12_SET_m7_gpio2_ipg_stop_SHIFT)) & CCM_GPR_SHARED12_SET_m7_gpio2_ipg_stop_MASK)

#define CCM_GPR_SHARED12_SET_m7_gpio3_ipg_stop_MASK (0x40000U)
#define CCM_GPR_SHARED12_SET_m7_gpio3_ipg_stop_SHIFT (18U)
/*! m7_gpio3_ipg_stop - m7_gpio3_ipg_stop */
#define CCM_GPR_SHARED12_SET_m7_gpio3_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED12_SET_m7_gpio3_ipg_stop_SHIFT)) & CCM_GPR_SHARED12_SET_m7_gpio3_ipg_stop_MASK)

#define CCM_GPR_SHARED12_SET_m7_gpio4_ipg_stop_MASK (0x80000U)
#define CCM_GPR_SHARED12_SET_m7_gpio4_ipg_stop_SHIFT (19U)
/*! m7_gpio4_ipg_stop - m7_gpio4_ipg_stop */
#define CCM_GPR_SHARED12_SET_m7_gpio4_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED12_SET_m7_gpio4_ipg_stop_SHIFT)) & CCM_GPR_SHARED12_SET_m7_gpio4_ipg_stop_MASK)

#define CCM_GPR_SHARED12_SET_m7_gpio5_ipg_stop_MASK (0x100000U)
#define CCM_GPR_SHARED12_SET_m7_gpio5_ipg_stop_SHIFT (20U)
/*! m7_gpio5_ipg_stop - m7_gpio5_ipg_stop */
#define CCM_GPR_SHARED12_SET_m7_gpio5_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED12_SET_m7_gpio5_ipg_stop_SHIFT)) & CCM_GPR_SHARED12_SET_m7_gpio5_ipg_stop_MASK)

#define CCM_GPR_SHARED12_SET_m7_gpio6_ipg_stop_MASK (0x200000U)
#define CCM_GPR_SHARED12_SET_m7_gpio6_ipg_stop_SHIFT (21U)
/*! m7_gpio6_ipg_stop - m7_gpio6_ipg_stop */
#define CCM_GPR_SHARED12_SET_m7_gpio6_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED12_SET_m7_gpio6_ipg_stop_SHIFT)) & CCM_GPR_SHARED12_SET_m7_gpio6_ipg_stop_MASK)

#define CCM_GPR_SHARED12_SET_m7_flexio1_ipg_stop_MASK (0x400000U)
#define CCM_GPR_SHARED12_SET_m7_flexio1_ipg_stop_SHIFT (22U)
/*! m7_flexio1_ipg_stop - m7_flexio1_ipg_stop */
#define CCM_GPR_SHARED12_SET_m7_flexio1_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED12_SET_m7_flexio1_ipg_stop_SHIFT)) & CCM_GPR_SHARED12_SET_m7_flexio1_ipg_stop_MASK)

#define CCM_GPR_SHARED12_SET_m7_flexio2_ipg_stop_MASK (0x800000U)
#define CCM_GPR_SHARED12_SET_m7_flexio2_ipg_stop_SHIFT (23U)
/*! m7_flexio2_ipg_stop - m7_flexio2_ipg_stop */
#define CCM_GPR_SHARED12_SET_m7_flexio2_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED12_SET_m7_flexio2_ipg_stop_SHIFT)) & CCM_GPR_SHARED12_SET_m7_flexio2_ipg_stop_MASK)

#define CCM_GPR_SHARED12_SET_m7_can1_ipg_stop_MASK (0x1000000U)
#define CCM_GPR_SHARED12_SET_m7_can1_ipg_stop_SHIFT (24U)
/*! m7_can1_ipg_stop - m7_can1_ipg_stop */
#define CCM_GPR_SHARED12_SET_m7_can1_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED12_SET_m7_can1_ipg_stop_SHIFT)) & CCM_GPR_SHARED12_SET_m7_can1_ipg_stop_MASK)

#define CCM_GPR_SHARED12_SET_m7_can2_ipg_stop_MASK (0x2000000U)
#define CCM_GPR_SHARED12_SET_m7_can2_ipg_stop_SHIFT (25U)
/*! m7_can2_ipg_stop - m7_can2_ipg_stop */
#define CCM_GPR_SHARED12_SET_m7_can2_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED12_SET_m7_can2_ipg_stop_SHIFT)) & CCM_GPR_SHARED12_SET_m7_can2_ipg_stop_MASK)

#define CCM_GPR_SHARED12_SET_m7_can3_ipg_stop_MASK (0x4000000U)
#define CCM_GPR_SHARED12_SET_m7_can3_ipg_stop_SHIFT (26U)
/*! m7_can3_ipg_stop - m7_can3_ipg_stop */
#define CCM_GPR_SHARED12_SET_m7_can3_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED12_SET_m7_can3_ipg_stop_SHIFT)) & CCM_GPR_SHARED12_SET_m7_can3_ipg_stop_MASK)

#define CCM_GPR_SHARED12_SET_m7_lpuart1_ipg_stop_MASK (0x8000000U)
#define CCM_GPR_SHARED12_SET_m7_lpuart1_ipg_stop_SHIFT (27U)
/*! m7_lpuart1_ipg_stop - m7_lpuart1_ipg_stop */
#define CCM_GPR_SHARED12_SET_m7_lpuart1_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED12_SET_m7_lpuart1_ipg_stop_SHIFT)) & CCM_GPR_SHARED12_SET_m7_lpuart1_ipg_stop_MASK)

#define CCM_GPR_SHARED12_SET_m7_lpuart2_ipg_stop_MASK (0x10000000U)
#define CCM_GPR_SHARED12_SET_m7_lpuart2_ipg_stop_SHIFT (28U)
/*! m7_lpuart2_ipg_stop - m7_lpuart2_ipg_stop */
#define CCM_GPR_SHARED12_SET_m7_lpuart2_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED12_SET_m7_lpuart2_ipg_stop_SHIFT)) & CCM_GPR_SHARED12_SET_m7_lpuart2_ipg_stop_MASK)

#define CCM_GPR_SHARED12_SET_m7_lpuart3_ipg_stop_MASK (0x20000000U)
#define CCM_GPR_SHARED12_SET_m7_lpuart3_ipg_stop_SHIFT (29U)
/*! m7_lpuart3_ipg_stop - m7_lpuart3_ipg_stop */
#define CCM_GPR_SHARED12_SET_m7_lpuart3_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED12_SET_m7_lpuart3_ipg_stop_SHIFT)) & CCM_GPR_SHARED12_SET_m7_lpuart3_ipg_stop_MASK)

#define CCM_GPR_SHARED12_SET_m7_lpuart4_ipg_stop_MASK (0x40000000U)
#define CCM_GPR_SHARED12_SET_m7_lpuart4_ipg_stop_SHIFT (30U)
/*! m7_lpuart4_ipg_stop - m7_lpuart4_ipg_stop */
#define CCM_GPR_SHARED12_SET_m7_lpuart4_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED12_SET_m7_lpuart4_ipg_stop_SHIFT)) & CCM_GPR_SHARED12_SET_m7_lpuart4_ipg_stop_MASK)

#define CCM_GPR_SHARED12_SET_m7_lpuart5_ipg_stop_MASK (0x80000000U)
#define CCM_GPR_SHARED12_SET_m7_lpuart5_ipg_stop_SHIFT (31U)
/*! m7_lpuart5_ipg_stop - m7_lpuart5_ipg_stop */
#define CCM_GPR_SHARED12_SET_m7_lpuart5_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED12_SET_m7_lpuart5_ipg_stop_SHIFT)) & CCM_GPR_SHARED12_SET_m7_lpuart5_ipg_stop_MASK)
/*! @} */

/*! @name GPR_SHARED12_CLR - General Purpose Register */
/*! @{ */

#define CCM_GPR_SHARED12_CLR_m7_cm7_ipg_stop_MASK (0x1U)
#define CCM_GPR_SHARED12_CLR_m7_cm7_ipg_stop_SHIFT (0U)
/*! m7_cm7_ipg_stop - m7_cm7_ipg_stop */
#define CCM_GPR_SHARED12_CLR_m7_cm7_ipg_stop(x)  (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED12_CLR_m7_cm7_ipg_stop_SHIFT)) & CCM_GPR_SHARED12_CLR_m7_cm7_ipg_stop_MASK)

#define CCM_GPR_SHARED12_CLR_m7_cm33_ipg_stop_MASK (0x2U)
#define CCM_GPR_SHARED12_CLR_m7_cm33_ipg_stop_SHIFT (1U)
/*! m7_cm33_ipg_stop - m7_cm33_ipg_stop */
#define CCM_GPR_SHARED12_CLR_m7_cm33_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED12_CLR_m7_cm33_ipg_stop_SHIFT)) & CCM_GPR_SHARED12_CLR_m7_cm33_ipg_stop_MASK)

