JayHeng/imxrt-tool-flash-algo/boards/nxp_evkmimxrt1180_rev.c/flash_algo_c0_silicon/Keil_JLink/rom_api/MIMXRT1189_cm7.h
#define CCM_GPR_SHARED13_TOG_m7_lpspi5_ipg_stop_MASK (0x20000U)
#define CCM_GPR_SHARED13_TOG_m7_lpspi5_ipg_stop_SHIFT (17U)
/*! m7_lpspi5_ipg_stop - m7_lpspi5_ipg_stop */
#define CCM_GPR_SHARED13_TOG_m7_lpspi5_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED13_TOG_m7_lpspi5_ipg_stop_SHIFT)) & CCM_GPR_SHARED13_TOG_m7_lpspi5_ipg_stop_MASK)

#define CCM_GPR_SHARED13_TOG_m7_lpspi6_ipg_stop_MASK (0x40000U)
#define CCM_GPR_SHARED13_TOG_m7_lpspi6_ipg_stop_SHIFT (18U)
/*! m7_lpspi6_ipg_stop - m7_lpspi6_ipg_stop */
#define CCM_GPR_SHARED13_TOG_m7_lpspi6_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED13_TOG_m7_lpspi6_ipg_stop_SHIFT)) & CCM_GPR_SHARED13_TOG_m7_lpspi6_ipg_stop_MASK)

#define CCM_GPR_SHARED13_TOG_m7_sinc1_ipg_stop_MASK (0x80000U)
#define CCM_GPR_SHARED13_TOG_m7_sinc1_ipg_stop_SHIFT (19U)
/*! m7_sinc1_ipg_stop - m7_sinc1_ipg_stop */
#define CCM_GPR_SHARED13_TOG_m7_sinc1_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED13_TOG_m7_sinc1_ipg_stop_SHIFT)) & CCM_GPR_SHARED13_TOG_m7_sinc1_ipg_stop_MASK)

#define CCM_GPR_SHARED13_TOG_m7_sinc2_ipg_stop_MASK (0x100000U)
#define CCM_GPR_SHARED13_TOG_m7_sinc2_ipg_stop_SHIFT (20U)
/*! m7_sinc2_ipg_stop - m7_sinc2_ipg_stop */
#define CCM_GPR_SHARED13_TOG_m7_sinc2_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED13_TOG_m7_sinc2_ipg_stop_SHIFT)) & CCM_GPR_SHARED13_TOG_m7_sinc2_ipg_stop_MASK)

#define CCM_GPR_SHARED13_TOG_m7_sinc3_ipg_stop_MASK (0x200000U)
#define CCM_GPR_SHARED13_TOG_m7_sinc3_ipg_stop_SHIFT (21U)
/*! m7_sinc3_ipg_stop - m7_sinc3_ipg_stop */
#define CCM_GPR_SHARED13_TOG_m7_sinc3_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED13_TOG_m7_sinc3_ipg_stop_SHIFT)) & CCM_GPR_SHARED13_TOG_m7_sinc3_ipg_stop_MASK)

#define CCM_GPR_SHARED13_TOG_m7_sai1_ipg_stop_MASK (0x400000U)
#define CCM_GPR_SHARED13_TOG_m7_sai1_ipg_stop_SHIFT (22U)
/*! m7_sai1_ipg_stop - m7_sai1_ipg_stop */
#define CCM_GPR_SHARED13_TOG_m7_sai1_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED13_TOG_m7_sai1_ipg_stop_SHIFT)) & CCM_GPR_SHARED13_TOG_m7_sai1_ipg_stop_MASK)

#define CCM_GPR_SHARED13_TOG_m7_sai2_ipg_stop_MASK (0x800000U)
#define CCM_GPR_SHARED13_TOG_m7_sai2_ipg_stop_SHIFT (23U)
/*! m7_sai2_ipg_stop - m7_sai2_ipg_stop */
#define CCM_GPR_SHARED13_TOG_m7_sai2_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED13_TOG_m7_sai2_ipg_stop_SHIFT)) & CCM_GPR_SHARED13_TOG_m7_sai2_ipg_stop_MASK)

#define CCM_GPR_SHARED13_TOG_m7_sai3_ipg_stop_MASK (0x1000000U)
#define CCM_GPR_SHARED13_TOG_m7_sai3_ipg_stop_SHIFT (24U)
/*! m7_sai3_ipg_stop - m7_sai3_ipg_stop */
#define CCM_GPR_SHARED13_TOG_m7_sai3_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED13_TOG_m7_sai3_ipg_stop_SHIFT)) & CCM_GPR_SHARED13_TOG_m7_sai3_ipg_stop_MASK)

#define CCM_GPR_SHARED13_TOG_m7_sai4_ipg_stop_MASK (0x2000000U)
#define CCM_GPR_SHARED13_TOG_m7_sai4_ipg_stop_SHIFT (25U)
/*! m7_sai4_ipg_stop - m7_sai4_ipg_stop */
#define CCM_GPR_SHARED13_TOG_m7_sai4_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED13_TOG_m7_sai4_ipg_stop_SHIFT)) & CCM_GPR_SHARED13_TOG_m7_sai4_ipg_stop_MASK)

#define CCM_GPR_SHARED13_TOG_m7_mic_ipg_stop_MASK (0x4000000U)
#define CCM_GPR_SHARED13_TOG_m7_mic_ipg_stop_SHIFT (26U)
/*! m7_mic_ipg_stop - m7_mic_ipg_stop */
#define CCM_GPR_SHARED13_TOG_m7_mic_ipg_stop(x)  (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED13_TOG_m7_mic_ipg_stop_SHIFT)) & CCM_GPR_SHARED13_TOG_m7_mic_ipg_stop_MASK)
/*! @} */

/*! @name GPR_SHARED13_AUTHEN - GPR access control */
/*! @{ */

#define CCM_GPR_SHARED13_AUTHEN_TZ_USER_MASK     (0x100U)
#define CCM_GPR_SHARED13_AUTHEN_TZ_USER_SHIFT    (8U)
/*! TZ_USER - User access permission
 *  0b1..Registers of shared GPR slice can be changed in user mode.
 *  0b0..Registers of shared GPR slice cannot be changed in user mode.
 */
#define CCM_GPR_SHARED13_AUTHEN_TZ_USER(x)       (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED13_AUTHEN_TZ_USER_SHIFT)) & CCM_GPR_SHARED13_AUTHEN_TZ_USER_MASK)

#define CCM_GPR_SHARED13_AUTHEN_TZ_NS_MASK       (0x200U)
#define CCM_GPR_SHARED13_AUTHEN_TZ_NS_SHIFT      (9U)
/*! TZ_NS - Non-secure access permission
 *  0b0..Cannot be changed in Non-secure mode.
 *  0b1..Can be changed in Non-secure mode.
 */
#define CCM_GPR_SHARED13_AUTHEN_TZ_NS(x)         (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED13_AUTHEN_TZ_NS_SHIFT)) & CCM_GPR_SHARED13_AUTHEN_TZ_NS_MASK)

#define CCM_GPR_SHARED13_AUTHEN_LOCK_TZ_MASK     (0x800U)
#define CCM_GPR_SHARED13_AUTHEN_LOCK_TZ_SHIFT    (11U)
/*! LOCK_TZ - Lock TrustZone settings
 *  0b0..TrustZone settings is not locked.
 *  0b1..TrustZone settings is locked.
 */
#define CCM_GPR_SHARED13_AUTHEN_LOCK_TZ(x)       (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED13_AUTHEN_LOCK_TZ_SHIFT)) & CCM_GPR_SHARED13_AUTHEN_LOCK_TZ_MASK)

#define CCM_GPR_SHARED13_AUTHEN_LOCK_LIST_MASK   (0x8000U)
#define CCM_GPR_SHARED13_AUTHEN_LOCK_LIST_SHIFT  (15U)
/*! LOCK_LIST - Lock white list
 *  0b0..Whitelist is not locked.
 *  0b1..Whitelist is locked.
 */
#define CCM_GPR_SHARED13_AUTHEN_LOCK_LIST(x)     (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED13_AUTHEN_LOCK_LIST_SHIFT)) & CCM_GPR_SHARED13_AUTHEN_LOCK_LIST_MASK)

#define CCM_GPR_SHARED13_AUTHEN_WHITE_LIST_MASK  (0xFFFF0000U)
#define CCM_GPR_SHARED13_AUTHEN_WHITE_LIST_SHIFT (16U)
/*! WHITE_LIST - Whitelist settings */
#define CCM_GPR_SHARED13_AUTHEN_WHITE_LIST(x)    (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED13_AUTHEN_WHITE_LIST_SHIFT)) & CCM_GPR_SHARED13_AUTHEN_WHITE_LIST_MASK)
/*! @} */

/*! @name GPR_SHARED13_AUTHEN_SET - GPR access control */
/*! @{ */

#define CCM_GPR_SHARED13_AUTHEN_SET_TZ_USER_MASK (0x100U)
#define CCM_GPR_SHARED13_AUTHEN_SET_TZ_USER_SHIFT (8U)
/*! TZ_USER - User access permission */
#define CCM_GPR_SHARED13_AUTHEN_SET_TZ_USER(x)   (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED13_AUTHEN_SET_TZ_USER_SHIFT)) & CCM_GPR_SHARED13_AUTHEN_SET_TZ_USER_MASK)

#define CCM_GPR_SHARED13_AUTHEN_SET_TZ_NS_MASK   (0x200U)
#define CCM_GPR_SHARED13_AUTHEN_SET_TZ_NS_SHIFT  (9U)
/*! TZ_NS - Non-secure access permission */
#define CCM_GPR_SHARED13_AUTHEN_SET_TZ_NS(x)     (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED13_AUTHEN_SET_TZ_NS_SHIFT)) & CCM_GPR_SHARED13_AUTHEN_SET_TZ_NS_MASK)

