JayHeng/imxrt-tool-flash-algo/boards/nxp_evkmimxrt1180_rev.c/flash_algo_c0_silicon/Keil_JLink/rom_api/MIMXRT1189_cm7.h
#define DCDC_CURRENT_TRG_VDD1P8CTRL_TRG_MASK     (0x1F00U)
#define DCDC_CURRENT_TRG_VDD1P8CTRL_TRG_SHIFT    (8U)
#define DCDC_CURRENT_TRG_VDD1P8CTRL_TRG(x)       (((uint32_t)(((uint32_t)(x)) << DCDC_CURRENT_TRG_VDD1P8CTRL_TRG_SHIFT)) & DCDC_CURRENT_TRG_VDD1P8CTRL_TRG_MASK)

#define DCDC_CURRENT_TRG_DCDC_UPDATING_MASK      (0x8000U)
#define DCDC_CURRENT_TRG_DCDC_UPDATING_SHIFT     (15U)
/*! DCDC_UPDATING
 *  0b0..Last DCDC change has been done. New value can be written to TRG register to trigger a new change of DCDC voltage.
 *  0b1..Last DCDC change is still not done. New value should not be written to TRG register to trigger a new change of DCDC voltage.
 */
#define DCDC_CURRENT_TRG_DCDC_UPDATING(x)        (((uint32_t)(((uint32_t)(x)) << DCDC_CURRENT_TRG_DCDC_UPDATING_SHIFT)) & DCDC_CURRENT_TRG_DCDC_UPDATING_MASK)

#define DCDC_CURRENT_TRG_VDD1P0CTRL_LP_TRG_MASK  (0x1F0000U)
#define DCDC_CURRENT_TRG_VDD1P0CTRL_LP_TRG_SHIFT (16U)
#define DCDC_CURRENT_TRG_VDD1P0CTRL_LP_TRG(x)    (((uint32_t)(((uint32_t)(x)) << DCDC_CURRENT_TRG_VDD1P0CTRL_LP_TRG_SHIFT)) & DCDC_CURRENT_TRG_VDD1P0CTRL_LP_TRG_MASK)

#define DCDC_CURRENT_TRG_LP_EN_1P0_MASK          (0x80000000U)
#define DCDC_CURRENT_TRG_LP_EN_1P0_SHIFT         (31U)
/*! LP_EN_1P0 - This value comes from the smaller one between TRG_SW_0 and TRG_SW_1. This bit only
 *    controls 1P0. 1P8 is always controlled by VDD1P8CTRL_TRG
 *  0b0..DCDC 1P0 works in run mode. Its output voltage is controlled by VDD1P0CTRL_TRG.
 *  0b1..DCDC 1P0 works in low power mode. Its output voltage is controlled by VDD1P0CTRL_LP_TRG and its output current is less than 50mA.
 */
#define DCDC_CURRENT_TRG_LP_EN_1P0(x)            (((uint32_t)(((uint32_t)(x)) << DCDC_CURRENT_TRG_LP_EN_1P0_SHIFT)) & DCDC_CURRENT_TRG_LP_EN_1P0_MASK)
/*! @} */

/*! @name FILTER_CNT - FILTER CNT */
/*! @{ */

#define DCDC_FILTER_CNT_FILTER_CNT_CFG_MASK      (0xFFFFFFFFU)
#define DCDC_FILTER_CNT_FILTER_CNT_CFG_SHIFT     (0U)
/*! FILTER_CNT_CFG - FILTER_CNT_CFG */
#define DCDC_FILTER_CNT_FILTER_CNT_CFG(x)        (((uint32_t)(((uint32_t)(x)) << DCDC_FILTER_CNT_FILTER_CNT_CFG_SHIFT)) & DCDC_FILTER_CNT_FILTER_CNT_CFG_MASK)
/*! @} */

/*! @name TRG_0_AUTHEN - TRG_0 Authentication Control */
/*! @{ */

#define DCDC_TRG_0_AUTHEN_TZ_USER_MASK           (0x100U)
#define DCDC_TRG_0_AUTHEN_TZ_USER_SHIFT          (8U)
/*! TZ_USER - Allow user mode write
 *  0b0..TRG_0 registers can only be written in privilege mode.
 *  0b1..TRG_0 registers can be written either in privilege mode or user mode.
 */
#define DCDC_TRG_0_AUTHEN_TZ_USER(x)             (((uint32_t)(((uint32_t)(x)) << DCDC_TRG_0_AUTHEN_TZ_USER_SHIFT)) & DCDC_TRG_0_AUTHEN_TZ_USER_MASK)

#define DCDC_TRG_0_AUTHEN_TZ_NS_MASK             (0x200U)
#define DCDC_TRG_0_AUTHEN_TZ_NS_SHIFT            (9U)
/*! TZ_NS - Allow non-secure mode access
 *  0b0..TRG_0 registers can only be written in secure mode.
 *  0b1..TRG_0 registers can be written either in secure mode or non-secure mode.
 */
#define DCDC_TRG_0_AUTHEN_TZ_NS(x)               (((uint32_t)(((uint32_t)(x)) << DCDC_TRG_0_AUTHEN_TZ_NS_SHIFT)) & DCDC_TRG_0_AUTHEN_TZ_NS_MASK)

#define DCDC_TRG_0_AUTHEN_LOCK_TZ_MASK           (0x800U)
#define DCDC_TRG_0_AUTHEN_LOCK_TZ_SHIFT          (11U)
/*! LOCK_TZ - Lock TZ_NS and TZ_USER
 *  0b0..TZ_NS and TZ_USER value can be changed.
 *  0b1..LOCK_TZ, TZ_NS and TZ_USER value cannot be changed.
 */
#define DCDC_TRG_0_AUTHEN_LOCK_TZ(x)             (((uint32_t)(((uint32_t)(x)) << DCDC_TRG_0_AUTHEN_LOCK_TZ_SHIFT)) & DCDC_TRG_0_AUTHEN_LOCK_TZ_MASK)

#define DCDC_TRG_0_AUTHEN_LOCK_LIST_MASK         (0x8000U)
#define DCDC_TRG_0_AUTHEN_LOCK_LIST_SHIFT        (15U)
/*! LOCK_LIST - White list lock
 *  0b0..WHITE_LIST value can be changed.
 *  0b1..LOCK_LIST and WHITE_LIST value cannot be changed.
 */
#define DCDC_TRG_0_AUTHEN_LOCK_LIST(x)           (((uint32_t)(((uint32_t)(x)) << DCDC_TRG_0_AUTHEN_LOCK_LIST_SHIFT)) & DCDC_TRG_0_AUTHEN_LOCK_LIST_MASK)

#define DCDC_TRG_0_AUTHEN_WHITE_LIST_MASK        (0xFFFF0000U)
#define DCDC_TRG_0_AUTHEN_WHITE_LIST_SHIFT       (16U)
/*! WHITE_LIST - Domain ID white list
 *  0b0000000000000001..Core with domain ID=0 can write TRG_0 registers.
 *  0b0000000000000010..Core with domain ID=1 can write TRG_0 registers.
 *  0b0000000000000100..Core with domain ID=2 can write TRG_0 registers.
 *  0b0000000000001000..Core with domain ID=3 can write TRG_0 registers.
 *  0b0000000000010000..Core with domain ID=4 can write TRG_0 registers.
 *  0b0000000000100000..Core with domain ID=5 can write TRG_0 registers.
 *  0b0000000001000000..Core with domain ID=6 can write TRG_0 registers.
 *  0b0000000010000000..Core with domain ID=7 can write TRG_0 registers.
 *  0b0000000100000000..Core with domain ID=8 can write TRG_0 registers.
 *  0b0000001000000000..Core with domain ID=9 can write TRG_0 registers.
 *  0b0000010000000000..Core with domain ID=10 can write TRG_0 registers.
 *  0b0000100000000000..Core with domain ID=11 can write TRG_0 registers.
 *  0b0001000000000000..Core with domain ID=12 can write TRG_0 registers.
 *  0b0010000000000000..Core with domain ID=13 can write TRG_0 registers.
 *  0b0100000000000000..Core with domain ID=14 can write TRG_0 registers.
 *  0b1000000000000000..Core with domain ID=15 can write TRG_0 registers.
 */
#define DCDC_TRG_0_AUTHEN_WHITE_LIST(x)          (((uint32_t)(((uint32_t)(x)) << DCDC_TRG_0_AUTHEN_WHITE_LIST_SHIFT)) & DCDC_TRG_0_AUTHEN_WHITE_LIST_MASK)
/*! @} */

/*! @name TRG_SW_0 - Target SW Control for CORE 0 */
/*! @{ */

#define DCDC_TRG_SW_0_VDD1P0CTRL_TRG_MASK        (0x1FU)
#define DCDC_TRG_SW_0_VDD1P0CTRL_TRG_SHIFT       (0U)
#define DCDC_TRG_SW_0_VDD1P0CTRL_TRG(x)          (((uint32_t)(((uint32_t)(x)) << DCDC_TRG_SW_0_VDD1P0CTRL_TRG_SHIFT)) & DCDC_TRG_SW_0_VDD1P0CTRL_TRG_MASK)

#define DCDC_TRG_SW_0_VDD1P8CTRL_TRG_MASK        (0x1F00U)
#define DCDC_TRG_SW_0_VDD1P8CTRL_TRG_SHIFT       (8U)
#define DCDC_TRG_SW_0_VDD1P8CTRL_TRG(x)          (((uint32_t)(((uint32_t)(x)) << DCDC_TRG_SW_0_VDD1P8CTRL_TRG_SHIFT)) & DCDC_TRG_SW_0_VDD1P8CTRL_TRG_MASK)

#define DCDC_TRG_SW_0_VDD1P0CTRL_LP_TRG_MASK     (0x1F0000U)
#define DCDC_TRG_SW_0_VDD1P0CTRL_LP_TRG_SHIFT    (16U)
#define DCDC_TRG_SW_0_VDD1P0CTRL_LP_TRG(x)       (((uint32_t)(((uint32_t)(x)) << DCDC_TRG_SW_0_VDD1P0CTRL_LP_TRG_SHIFT)) & DCDC_TRG_SW_0_VDD1P0CTRL_LP_TRG_MASK)

#define DCDC_TRG_SW_0_LP_EN_1P0_MASK             (0x80000000U)
#define DCDC_TRG_SW_0_LP_EN_1P0_SHIFT            (31U)
/*! LP_EN_1P0 - LP_EN_1P0 only controls 1P0. 1P8 is always controlled by VDD1P8CTRL_TRG */
#define DCDC_TRG_SW_0_LP_EN_1P0(x)               (((uint32_t)(((uint32_t)(x)) << DCDC_TRG_SW_0_LP_EN_1P0_SHIFT)) & DCDC_TRG_SW_0_LP_EN_1P0_MASK)
/*! @} */

/*! @name TRG_GPC_0 - Target GPC Control for CORE 0 */
/*! @{ */

#define DCDC_TRG_GPC_0_VDD1P0CTRL_TRG_MASK       (0x1FU)
#define DCDC_TRG_GPC_0_VDD1P0CTRL_TRG_SHIFT      (0U)
#define DCDC_TRG_GPC_0_VDD1P0CTRL_TRG(x)         (((uint32_t)(((uint32_t)(x)) << DCDC_TRG_GPC_0_VDD1P0CTRL_TRG_SHIFT)) & DCDC_TRG_GPC_0_VDD1P0CTRL_TRG_MASK)

