JayHeng/imxrt-tool-flash-algo/boards/nxp_evkmimxrt1180_rev.c/flash_algo_c0_silicon/Keil_JLink/rom_api/MIMXRT1189_cm7.h
#define DCDC_TRG_GPC_0_VDD1P8CTRL_TRG_MASK       (0x1F00U)
#define DCDC_TRG_GPC_0_VDD1P8CTRL_TRG_SHIFT      (8U)
#define DCDC_TRG_GPC_0_VDD1P8CTRL_TRG(x)         (((uint32_t)(((uint32_t)(x)) << DCDC_TRG_GPC_0_VDD1P8CTRL_TRG_SHIFT)) & DCDC_TRG_GPC_0_VDD1P8CTRL_TRG_MASK)

#define DCDC_TRG_GPC_0_VDD1P0CTRL_LP_TRG_MASK    (0x1F0000U)
#define DCDC_TRG_GPC_0_VDD1P0CTRL_LP_TRG_SHIFT   (16U)
#define DCDC_TRG_GPC_0_VDD1P0CTRL_LP_TRG(x)      (((uint32_t)(((uint32_t)(x)) << DCDC_TRG_GPC_0_VDD1P0CTRL_LP_TRG_SHIFT)) & DCDC_TRG_GPC_0_VDD1P0CTRL_LP_TRG_MASK)

#define DCDC_TRG_GPC_0_LP_EN_1P0_MASK            (0x80000000U)
#define DCDC_TRG_GPC_0_LP_EN_1P0_SHIFT           (31U)
/*! LP_EN_1P0 - LP_EN_1P0 only controls 1P0. 1P8 is always controlled by VDD1P8CTRL_TRG */
#define DCDC_TRG_GPC_0_LP_EN_1P0(x)              (((uint32_t)(((uint32_t)(x)) << DCDC_TRG_GPC_0_LP_EN_1P0_SHIFT)) & DCDC_TRG_GPC_0_LP_EN_1P0_MASK)
/*! @} */

/*! @name TRG_1_AUTHEN - TRG_1 Authentication Control */
/*! @{ */

#define DCDC_TRG_1_AUTHEN_TZ_USER_MASK           (0x100U)
#define DCDC_TRG_1_AUTHEN_TZ_USER_SHIFT          (8U)
/*! TZ_USER - Allow user mode write
 *  0b0..TRG_1 registers can only be written in privilege mode.
 *  0b1..TRG_1 registers can be written either in privilege mode or user mode.
 */
#define DCDC_TRG_1_AUTHEN_TZ_USER(x)             (((uint32_t)(((uint32_t)(x)) << DCDC_TRG_1_AUTHEN_TZ_USER_SHIFT)) & DCDC_TRG_1_AUTHEN_TZ_USER_MASK)

#define DCDC_TRG_1_AUTHEN_TZ_NS_MASK             (0x200U)
#define DCDC_TRG_1_AUTHEN_TZ_NS_SHIFT            (9U)
/*! TZ_NS - Allow non-secure mode access
 *  0b0..TRG_1 registers can only be written in secure mode.
 *  0b1..TRG_1 registers can be written either in secure mode or non-secure mode.
 */
#define DCDC_TRG_1_AUTHEN_TZ_NS(x)               (((uint32_t)(((uint32_t)(x)) << DCDC_TRG_1_AUTHEN_TZ_NS_SHIFT)) & DCDC_TRG_1_AUTHEN_TZ_NS_MASK)

#define DCDC_TRG_1_AUTHEN_LOCK_TZ_MASK           (0x800U)
#define DCDC_TRG_1_AUTHEN_LOCK_TZ_SHIFT          (11U)
/*! LOCK_TZ - Lock TZ_NS and TZ_USER
 *  0b0..TZ_NS and TZ_USER value can be changed.
 *  0b1..LOCK_TZ, TZ_NS and TZ_USER value cannot be changed.
 */
#define DCDC_TRG_1_AUTHEN_LOCK_TZ(x)             (((uint32_t)(((uint32_t)(x)) << DCDC_TRG_1_AUTHEN_LOCK_TZ_SHIFT)) & DCDC_TRG_1_AUTHEN_LOCK_TZ_MASK)

#define DCDC_TRG_1_AUTHEN_LOCK_LIST_MASK         (0x8000U)
#define DCDC_TRG_1_AUTHEN_LOCK_LIST_SHIFT        (15U)
/*! LOCK_LIST - White list lock
 *  0b0..WHITE_LIST value can be changed.
 *  0b1..LOCK_LIST and WHITE_LIST value cannot be changed.
 */
#define DCDC_TRG_1_AUTHEN_LOCK_LIST(x)           (((uint32_t)(((uint32_t)(x)) << DCDC_TRG_1_AUTHEN_LOCK_LIST_SHIFT)) & DCDC_TRG_1_AUTHEN_LOCK_LIST_MASK)

#define DCDC_TRG_1_AUTHEN_WHITE_LIST_MASK        (0xFFFF0000U)
#define DCDC_TRG_1_AUTHEN_WHITE_LIST_SHIFT       (16U)
/*! WHITE_LIST - Domain ID white list
 *  0b0000000000000001..Core with domain ID=0 can write TRG_1 registers.
 *  0b0000000000000010..Core with domain ID=1 can write TRG_1 registers.
 *  0b0000000000000100..Core with domain ID=2 can write TRG_1 registers.
 *  0b0000000000001000..Core with domain ID=3 can write TRG_1 registers.
 *  0b0000000000010000..Core with domain ID=4 can write TRG_1 registers.
 *  0b0000000000100000..Core with domain ID=5 can write TRG_1 registers.
 *  0b0000000001000000..Core with domain ID=6 can write TRG_1 registers.
 *  0b0000000010000000..Core with domain ID=7 can write TRG_1 registers.
 *  0b0000000100000000..Core with domain ID=8 can write TRG_1 registers.
 *  0b0000001000000000..Core with domain ID=9 can write TRG_1 registers.
 *  0b0000010000000000..Core with domain ID=10 can write TRG_1 registers.
 *  0b0000100000000000..Core with domain ID=11 can write TRG_1 registers.
 *  0b0001000000000000..Core with domain ID=12 can write TRG_1 registers.
 *  0b0010000000000000..Core with domain ID=13 can write TRG_1 registers.
 *  0b0100000000000000..Core with domain ID=14 can write TRG_1 registers.
 *  0b1000000000000000..Core with domain ID=15 can write TRG_1 registers.
 */
#define DCDC_TRG_1_AUTHEN_WHITE_LIST(x)          (((uint32_t)(((uint32_t)(x)) << DCDC_TRG_1_AUTHEN_WHITE_LIST_SHIFT)) & DCDC_TRG_1_AUTHEN_WHITE_LIST_MASK)
/*! @} */

/*! @name TRG_SW_1 - Target SW Control for CORE 1 */
/*! @{ */

#define DCDC_TRG_SW_1_VDD1P0CTRL_TRG_MASK        (0x1FU)
#define DCDC_TRG_SW_1_VDD1P0CTRL_TRG_SHIFT       (0U)
#define DCDC_TRG_SW_1_VDD1P0CTRL_TRG(x)          (((uint32_t)(((uint32_t)(x)) << DCDC_TRG_SW_1_VDD1P0CTRL_TRG_SHIFT)) & DCDC_TRG_SW_1_VDD1P0CTRL_TRG_MASK)

#define DCDC_TRG_SW_1_VDD1P8CTRL_TRG_MASK        (0x1F00U)
#define DCDC_TRG_SW_1_VDD1P8CTRL_TRG_SHIFT       (8U)
#define DCDC_TRG_SW_1_VDD1P8CTRL_TRG(x)          (((uint32_t)(((uint32_t)(x)) << DCDC_TRG_SW_1_VDD1P8CTRL_TRG_SHIFT)) & DCDC_TRG_SW_1_VDD1P8CTRL_TRG_MASK)

#define DCDC_TRG_SW_1_VDD1P0CTRL_LP_TRG_MASK     (0x1F0000U)
#define DCDC_TRG_SW_1_VDD1P0CTRL_LP_TRG_SHIFT    (16U)
#define DCDC_TRG_SW_1_VDD1P0CTRL_LP_TRG(x)       (((uint32_t)(((uint32_t)(x)) << DCDC_TRG_SW_1_VDD1P0CTRL_LP_TRG_SHIFT)) & DCDC_TRG_SW_1_VDD1P0CTRL_LP_TRG_MASK)

#define DCDC_TRG_SW_1_LP_EN_1P0_MASK             (0x80000000U)
#define DCDC_TRG_SW_1_LP_EN_1P0_SHIFT            (31U)
/*! LP_EN_1P0 - LP_EN_1P0 only controls 1P0. 1P8 is always controlled by VDD1P8CTRL_TRG */
#define DCDC_TRG_SW_1_LP_EN_1P0(x)               (((uint32_t)(((uint32_t)(x)) << DCDC_TRG_SW_1_LP_EN_1P0_SHIFT)) & DCDC_TRG_SW_1_LP_EN_1P0_MASK)
/*! @} */

/*! @name TRG_GPC_1 - Target GPC Control for CORE 1 */
/*! @{ */

#define DCDC_TRG_GPC_1_VDD1P0CTRL_TRG_MASK       (0x1FU)
#define DCDC_TRG_GPC_1_VDD1P0CTRL_TRG_SHIFT      (0U)
#define DCDC_TRG_GPC_1_VDD1P0CTRL_TRG(x)         (((uint32_t)(((uint32_t)(x)) << DCDC_TRG_GPC_1_VDD1P0CTRL_TRG_SHIFT)) & DCDC_TRG_GPC_1_VDD1P0CTRL_TRG_MASK)

#define DCDC_TRG_GPC_1_VDD1P8CTRL_TRG_MASK       (0x1F00U)
#define DCDC_TRG_GPC_1_VDD1P8CTRL_TRG_SHIFT      (8U)
#define DCDC_TRG_GPC_1_VDD1P8CTRL_TRG(x)         (((uint32_t)(((uint32_t)(x)) << DCDC_TRG_GPC_1_VDD1P8CTRL_TRG_SHIFT)) & DCDC_TRG_GPC_1_VDD1P8CTRL_TRG_MASK)

#define DCDC_TRG_GPC_1_VDD1P0CTRL_LP_TRG_MASK    (0x1F0000U)
#define DCDC_TRG_GPC_1_VDD1P0CTRL_LP_TRG_SHIFT   (16U)
#define DCDC_TRG_GPC_1_VDD1P0CTRL_LP_TRG(x)      (((uint32_t)(((uint32_t)(x)) << DCDC_TRG_GPC_1_VDD1P0CTRL_LP_TRG_SHIFT)) & DCDC_TRG_GPC_1_VDD1P0CTRL_LP_TRG_MASK)

#define DCDC_TRG_GPC_1_LP_EN_1P0_MASK            (0x80000000U)
#define DCDC_TRG_GPC_1_LP_EN_1P0_SHIFT           (31U)
/*! LP_EN_1P0 - LP_EN_1P0 only controls 1P0. 1P8 is always controlled by VDD1P8CTRL_TRG */
#define DCDC_TRG_GPC_1_LP_EN_1P0(x)              (((uint32_t)(((uint32_t)(x)) << DCDC_TRG_GPC_1_LP_EN_1P0_SHIFT)) & DCDC_TRG_GPC_1_LP_EN_1P0_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group DCDC_Register_Masks */


/* DCDC - Peripheral instance base addresses */
/** Peripheral DCDC base address */
#define DCDC_BASE                                (0x44520000u)
/** Peripheral DCDC base pointer */
#define DCDC                                     ((DCDC_Type *)DCDC_BASE)
/** Array initializer of DCDC peripheral base addresses */
#define DCDC_BASE_ADDRS                          { DCDC_BASE }
/** Array initializer of DCDC peripheral base pointers */
#define DCDC_BASE_PTRS                           { DCDC }
/** Interrupt vectors for the DCDC peripheral type */
#define DCDC_IRQS                                { DCDC_IRQn }

/*!
 * @}
 */ /* end of group DCDC_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- DMA Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup DMA_Peripheral_Access_Layer DMA Peripheral Access Layer
 * @{
 */

/** DMA - Register Layout Typedef */
typedef struct {
  __IO uint32_t MP_CSR;                            /**< Management Page Control, offset: 0x0 */
  __I  uint32_t MP_ES;                             /**< Management Page Error Status, offset: 0x4 */
  __I  uint32_t MP_INT;                            /**< Management Page Interrupt Request Status, offset: 0x8 */
  __I  uint32_t MP_HRS;                            /**< Management Page Hardware Request Status, offset: 0xC */
       uint8_t RESERVED_0[240];
  __IO uint32_t CH_GRPRI[32];                      /**< Channel Arbitration Group, array offset: 0x100, array step: 0x4 */
       uint8_t RESERVED_1[65152];
  struct {                                         /* offset: 0x10000, array step: 0x10000 */
    __IO uint32_t CH_CSR;                            /**< Channel Control and Status, array offset: 0x10000, array step: 0x10000 */
    __IO uint32_t CH_ES;                             /**< Channel Error Status, array offset: 0x10004, array step: 0x10000 */
    __IO uint32_t CH_INT;                            /**< Channel Interrupt Status, array offset: 0x10008, array step: 0x10000 */
    __IO uint32_t CH_SBR;                            /**< Channel System Bus, array offset: 0x1000C, array step: 0x10000 */
    __IO uint32_t CH_PRI;                            /**< Channel Priority, array offset: 0x10010, array step: 0x10000 */
    __IO uint32_t CH_MUX;                            /**< Channel Multiplexor Configuration, array offset: 0x10014, array step: 0x10000 */
         uint8_t RESERVED_0[8];
    __IO uint32_t TCD_SADDR;                         /**< TCD Source Address, array offset: 0x10020, array step: 0x10000 */
    __IO uint16_t TCD_SOFF;                          /**< TCD Signed Source Address Offset, array offset: 0x10024, array step: 0x10000 */
    __IO uint16_t TCD_ATTR;                          /**< TCD Transfer Attributes, array offset: 0x10026, array step: 0x10000 */
    union {                                          /* offset: 0x10028, array step: 0x10000 */
      __IO uint32_t TCD_NBYTES_MLOFFNO;                /**< TCD Transfer Size Without Minor Loop Offsets, array offset: 0x10028, array step: 0x10000 */
      __IO uint32_t TCD_NBYTES_MLOFFYES;               /**< TCD Transfer Size with Minor Loop Offsets, array offset: 0x10028, array step: 0x10000 */
    };
    __IO uint32_t TCD_SLAST_SDA;                     /**< TCD Last Source Address Adjustment / Store DADDR Address, array offset: 0x1002C, array step: 0x10000 */
    __IO uint32_t TCD_DADDR;                         /**< TCD Destination Address, array offset: 0x10030, array step: 0x10000 */
    __IO uint16_t TCD_DOFF;                          /**< TCD Signed Destination Address Offset, array offset: 0x10034, array step: 0x10000 */
    union {                                          /* offset: 0x10036, array step: 0x10000 */
      __IO uint16_t TCD_CITER_ELINKNO;                 /**< TCD Current Major Loop Count (Minor Loop Channel Linking Disabled), array offset: 0x10036, array step: 0x10000 */
      __IO uint16_t TCD_CITER_ELINKYES;                /**< TCD Current Major Loop Count (Minor Loop Channel Linking Enabled), array offset: 0x10036, array step: 0x10000 */
    };
    __IO uint32_t TCD_DLAST_SGA;                     /**< TCD Last Destination Address Adjustment / Scatter Gather Address, array offset: 0x10038, array step: 0x10000 */
    __IO uint16_t TCD_CSR;                           /**< TCD Control and Status, array offset: 0x1003C, array step: 0x10000 */
    union {                                          /* offset: 0x1003E, array step: 0x10000 */
      __IO uint16_t TCD_BITER_ELINKNO;                 /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled), array offset: 0x1003E, array step: 0x10000 */
      __IO uint16_t TCD_BITER_ELINKYES;                /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled), array offset: 0x1003E, array step: 0x10000 */
    };
         uint8_t RESERVED_1[65472];
  } CH[32];
} DMA_Type;

/* ----------------------------------------------------------------------------
   -- DMA Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup DMA_Register_Masks DMA Register Masks
 * @{
 */

/*! @name MP_CSR - Management Page Control */
/*! @{ */

#define DMA_MP_CSR_EDBG_MASK                     (0x2U)
#define DMA_MP_CSR_EDBG_SHIFT                    (1U)
/*! EDBG - Enable Debug
 *  0b0..Debug mode disabled
 *  0b1..Debug mode is enabled.
 */
#define DMA_MP_CSR_EDBG(x)                       (((uint32_t)(((uint32_t)(x)) << DMA_MP_CSR_EDBG_SHIFT)) & DMA_MP_CSR_EDBG_MASK)

#define DMA_MP_CSR_ERCA_MASK                     (0x4U)
#define DMA_MP_CSR_ERCA_SHIFT                    (2U)
/*! ERCA - Enable Round Robin Channel Arbitration
 *  0b0..Round-robin channel arbitration disabled
 *  0b1..Round-robin channel arbitration enabled
 */
#define DMA_MP_CSR_ERCA(x)                       (((uint32_t)(((uint32_t)(x)) << DMA_MP_CSR_ERCA_SHIFT)) & DMA_MP_CSR_ERCA_MASK)

#define DMA_MP_CSR_HAE_MASK                      (0x10U)
#define DMA_MP_CSR_HAE_SHIFT                     (4U)
/*! HAE - Halt After Error
 *  0b0..Normal operation
 *  0b1..Any error causes the HALT field to be set to 1
 */
#define DMA_MP_CSR_HAE(x)                        (((uint32_t)(((uint32_t)(x)) << DMA_MP_CSR_HAE_SHIFT)) & DMA_MP_CSR_HAE_MASK)

