JayHeng/imxrt-tool-flash-algo/boards/nxp_evkmimxrt1180_rev.c/flash_algo_c0_silicon/Keil_JLink/rom_api/MIMXRT1189_cm7.h
#define DMA4_CH_SBR_EMI_MASK                     (0x10000U)
#define DMA4_CH_SBR_EMI_SHIFT                    (16U)
/*! EMI - Enable Master ID replication
 *  0b0..Master ID replication is disabled
 *  0b1..Master ID replication is enabled
 */
#define DMA4_CH_SBR_EMI(x)                       (((uint32_t)(((uint32_t)(x)) << DMA4_CH_SBR_EMI_SHIFT)) & DMA4_CH_SBR_EMI_MASK)

#define DMA4_CH_SBR_ATTR_MASK                    (0x7E0000U)
#define DMA4_CH_SBR_ATTR_SHIFT                   (17U)
/*! ATTR - Attribute Output */
#define DMA4_CH_SBR_ATTR(x)                      (((uint32_t)(((uint32_t)(x)) << DMA4_CH_SBR_ATTR_SHIFT)) & DMA4_CH_SBR_ATTR_MASK)
/*! @} */

/* The count of DMA4_CH_SBR */
#define DMA4_CH_SBR_COUNT                        (64U)

/*! @name CH_PRI - Channel Priority Register */
/*! @{ */

#define DMA4_CH_PRI_APL_MASK                     (0x7U)
#define DMA4_CH_PRI_APL_SHIFT                    (0U)
/*! APL - Arbitration Priority Level */
#define DMA4_CH_PRI_APL(x)                       (((uint32_t)(((uint32_t)(x)) << DMA4_CH_PRI_APL_SHIFT)) & DMA4_CH_PRI_APL_MASK)

#define DMA4_CH_PRI_DPA_MASK                     (0x40000000U)
#define DMA4_CH_PRI_DPA_SHIFT                    (30U)
/*! DPA - Disable Preempt Ability.
 *  0b0..The channel can suspend a lower priority channel.
 *  0b1..The channel cannot suspend any other channel, regardless of channel priority.
 */
#define DMA4_CH_PRI_DPA(x)                       (((uint32_t)(((uint32_t)(x)) << DMA4_CH_PRI_DPA_SHIFT)) & DMA4_CH_PRI_DPA_MASK)

#define DMA4_CH_PRI_ECP_MASK                     (0x80000000U)
#define DMA4_CH_PRI_ECP_SHIFT                    (31U)
/*! ECP - Enable Channel Preemption.
 *  0b0..The channel cannot be suspended by a higher priority channel's service request.
 *  0b1..The channel can be temporarily suspended by the service request of a higher priority channel.
 */
#define DMA4_CH_PRI_ECP(x)                       (((uint32_t)(((uint32_t)(x)) << DMA4_CH_PRI_ECP_SHIFT)) & DMA4_CH_PRI_ECP_MASK)
/*! @} */

/* The count of DMA4_CH_PRI */
#define DMA4_CH_PRI_COUNT                        (64U)

/*! @name CH_MUX - Channel Multiplexor Configuration */
/*! @{ */

#define DMA4_CH_MUX_SRC_MASK                     (0xFFU)
#define DMA4_CH_MUX_SRC_SHIFT                    (0U)
/*! SRC - Service Request Source */
#define DMA4_CH_MUX_SRC(x)                       (((uint32_t)(((uint32_t)(x)) << DMA4_CH_MUX_SRC_SHIFT)) & DMA4_CH_MUX_SRC_MASK)
/*! @} */

/* The count of DMA4_CH_MUX */
#define DMA4_CH_MUX_COUNT                        (64U)

/*! @name CH_MATTR - Memory Attributes Register */
/*! @{ */

#define DMA4_CH_MATTR_RCACHE_MASK                (0xFU)
#define DMA4_CH_MATTR_RCACHE_SHIFT               (0U)
/*! RCACHE - Read Cache Attributes */
#define DMA4_CH_MATTR_RCACHE(x)                  (((uint16_t)(((uint16_t)(x)) << DMA4_CH_MATTR_RCACHE_SHIFT)) & DMA4_CH_MATTR_RCACHE_MASK)

#define DMA4_CH_MATTR_WCACHE_MASK                (0xF0U)
#define DMA4_CH_MATTR_WCACHE_SHIFT               (4U)
/*! WCACHE - Write Cache Attributes */
#define DMA4_CH_MATTR_WCACHE(x)                  (((uint16_t)(((uint16_t)(x)) << DMA4_CH_MATTR_WCACHE_SHIFT)) & DMA4_CH_MATTR_WCACHE_MASK)
/*! @} */

/* The count of DMA4_CH_MATTR */
#define DMA4_CH_MATTR_COUNT                      (64U)

/*! @name SADDR - TCD Source Address Register */
/*! @{ */

#define DMA4_SADDR_SADDR_MASK                    (0xFFFFFFFFU)
#define DMA4_SADDR_SADDR_SHIFT                   (0U)
/*! SADDR - Source Address */
#define DMA4_SADDR_SADDR(x)                      (((uint32_t)(((uint32_t)(x)) << DMA4_SADDR_SADDR_SHIFT)) & DMA4_SADDR_SADDR_MASK)
/*! @} */

/* The count of DMA4_SADDR */
#define DMA4_SADDR_COUNT                         (64U)

/*! @name SOFF - TCD Signed Source Address Offset Register */
/*! @{ */

#define DMA4_SOFF_SOFF_MASK                      (0xFFFFU)
#define DMA4_SOFF_SOFF_SHIFT                     (0U)
/*! SOFF - Source address signed offset */
#define DMA4_SOFF_SOFF(x)                        (((uint16_t)(((uint16_t)(x)) << DMA4_SOFF_SOFF_SHIFT)) & DMA4_SOFF_SOFF_MASK)
/*! @} */

/* The count of DMA4_SOFF */
#define DMA4_SOFF_COUNT                          (64U)

/*! @name ATTR - TCD Transfer Attributes Register */
/*! @{ */

#define DMA4_ATTR_DSIZE_MASK                     (0x7U)
#define DMA4_ATTR_DSIZE_SHIFT                    (0U)
/*! DSIZE - Destination data transfer size
 *  0b000..8-bit
 *  0b001..16-bit
 *  0b010..32-bit
 *  0b011..64-bit
 *  0b100..16-byte
 *  0b101..32-byte
 *  0b110..64-byte
 *  0b111..128-byte
 */
#define DMA4_ATTR_DSIZE(x)                       (((uint16_t)(((uint16_t)(x)) << DMA4_ATTR_DSIZE_SHIFT)) & DMA4_ATTR_DSIZE_MASK)

#define DMA4_ATTR_DMOD_MASK                      (0xF8U)
#define DMA4_ATTR_DMOD_SHIFT                     (3U)
/*! DMOD - Destination address modulo */
#define DMA4_ATTR_DMOD(x)                        (((uint16_t)(((uint16_t)(x)) << DMA4_ATTR_DMOD_SHIFT)) & DMA4_ATTR_DMOD_MASK)

#define DMA4_ATTR_SSIZE_MASK                     (0x700U)
#define DMA4_ATTR_SSIZE_SHIFT                    (8U)
/*! SSIZE - Source data transfer size
 *  0b000..8-bit
 *  0b001..16-bit
 *  0b010..32-bit
 *  0b011..64-bit
 *  0b100..16-byte
 *  0b101..32-byte
 *  0b110..64-byte
 *  0b111..128-byte
 */
#define DMA4_ATTR_SSIZE(x)                       (((uint16_t)(((uint16_t)(x)) << DMA4_ATTR_SSIZE_SHIFT)) & DMA4_ATTR_SSIZE_MASK)

#define DMA4_ATTR_SMOD_MASK                      (0xF800U)
#define DMA4_ATTR_SMOD_SHIFT                     (11U)
/*! SMOD - Source address modulo
 *  0b00000..Source address modulo feature is disabled
 *  0b00001..Source address modulo feature is enabled for any non-zero value [1-31]
 */
#define DMA4_ATTR_SMOD(x)                        (((uint16_t)(((uint16_t)(x)) << DMA4_ATTR_SMOD_SHIFT)) & DMA4_ATTR_SMOD_MASK)
/*! @} */

/* The count of DMA4_ATTR */
#define DMA4_ATTR_COUNT                          (64U)

/*! @name NBYTES_MLOFFNO - TCD Transfer Size without Minor Loop Offsets Register */
/*! @{ */

#define DMA4_NBYTES_MLOFFNO_NBYTES_MASK          (0x3FFFFFFFU)
#define DMA4_NBYTES_MLOFFNO_NBYTES_SHIFT         (0U)
/*! NBYTES - Number of Bytes to transfer per service request */
#define DMA4_NBYTES_MLOFFNO_NBYTES(x)            (((uint32_t)(((uint32_t)(x)) << DMA4_NBYTES_MLOFFNO_NBYTES_SHIFT)) & DMA4_NBYTES_MLOFFNO_NBYTES_MASK)

#define DMA4_NBYTES_MLOFFNO_DMLOE_MASK           (0x40000000U)
#define DMA4_NBYTES_MLOFFNO_DMLOE_SHIFT          (30U)
/*! DMLOE - Destination Minor Loop Offset Enable
 *  0b0..The minor loop offset is not applied to the DADDR
 *  0b1..The minor loop offset is applied to the DADDR
 */
#define DMA4_NBYTES_MLOFFNO_DMLOE(x)             (((uint32_t)(((uint32_t)(x)) << DMA4_NBYTES_MLOFFNO_DMLOE_SHIFT)) & DMA4_NBYTES_MLOFFNO_DMLOE_MASK)

#define DMA4_NBYTES_MLOFFNO_SMLOE_MASK           (0x80000000U)
#define DMA4_NBYTES_MLOFFNO_SMLOE_SHIFT          (31U)
/*! SMLOE - Source Minor Loop Offset Enable
 *  0b0..The minor loop offset is not applied to the SADDR
 *  0b1..The minor loop offset is applied to the SADDR
 */
#define DMA4_NBYTES_MLOFFNO_SMLOE(x)             (((uint32_t)(((uint32_t)(x)) << DMA4_NBYTES_MLOFFNO_SMLOE_SHIFT)) & DMA4_NBYTES_MLOFFNO_SMLOE_MASK)
/*! @} */

/* The count of DMA4_NBYTES_MLOFFNO */
#define DMA4_NBYTES_MLOFFNO_COUNT                (64U)

/*! @name NBYTES_MLOFFYES - TCD Transfer Size with Minor Loop Offsets Register */
/*! @{ */

#define DMA4_NBYTES_MLOFFYES_NBYTES_MASK         (0x3FFU)
#define DMA4_NBYTES_MLOFFYES_NBYTES_SHIFT        (0U)
/*! NBYTES - Number of Bytes to transfer per service request */
#define DMA4_NBYTES_MLOFFYES_NBYTES(x)           (((uint32_t)(((uint32_t)(x)) << DMA4_NBYTES_MLOFFYES_NBYTES_SHIFT)) & DMA4_NBYTES_MLOFFYES_NBYTES_MASK)

