JayHeng/imxrt-tool-flash-algo/boards/nxp_evkmimxrt1180_rev.c/flash_algo_c0_silicon/Keil_JLink/rom_api/MIMXRT1189_cm7.h
#define ECAT_ESC_RESET_ECAT_WRITE_PDI_BF0_MASK   (0xFFU)
#define ECAT_ESC_RESET_ECAT_WRITE_PDI_BF0_SHIFT  (0U)
/*! BF0 - A reset is asserted after writing 0x52 ('R'), 0x45 ('E') and 0x53 ('S') in this register with 3 consecutive frames. */
#define ECAT_ESC_RESET_ECAT_WRITE_PDI_BF0(x)     (((uint8_t)(((uint8_t)(x)) << ECAT_ESC_RESET_ECAT_WRITE_PDI_BF0_SHIFT)) & ECAT_ESC_RESET_ECAT_WRITE_PDI_BF0_MASK)
/*! @} */

/*! @name ESC_RESET_PDI_WRITE - ESC Reset PDI WRITE */
/*! @{ */

#define ECAT_ESC_RESET_PDI_WRITE_BF0_MASK        (0xFFU)
#define ECAT_ESC_RESET_PDI_WRITE_BF0_SHIFT       (0U)
/*! BF0 - A reset is asserted after writing 0x52 ('R'), 0x45 ('E') and 0x53 ('S') in this register with 3 consecutive commands. */
#define ECAT_ESC_RESET_PDI_WRITE_BF0(x)          (((uint8_t)(((uint8_t)(x)) << ECAT_ESC_RESET_PDI_WRITE_BF0_SHIFT)) & ECAT_ESC_RESET_PDI_WRITE_BF0_MASK)
/*! @} */

/*! @name ESC_RESET_PDI_WRITE_PDI - ESC Reset PDI WRITE */
/*! @{ */

#define ECAT_ESC_RESET_PDI_WRITE_PDI_BF0_MASK    (0xFFU)
#define ECAT_ESC_RESET_PDI_WRITE_PDI_BF0_SHIFT   (0U)
/*! BF0 - A reset is asserted after writing 0x52 ('R'), 0x45 ('E') and 0x53 ('S') in this register with 3 consecutive commands. */
#define ECAT_ESC_RESET_PDI_WRITE_PDI_BF0(x)      (((uint8_t)(((uint8_t)(x)) << ECAT_ESC_RESET_PDI_WRITE_PDI_BF0_SHIFT)) & ECAT_ESC_RESET_PDI_WRITE_PDI_BF0_MASK)
/*! @} */

/*! @name ESC_DL_CONTROL - ESC DL Control */
/*! @{ */

#define ECAT_ESC_DL_CONTROL_BF0_MASK             (0x1U)
#define ECAT_ESC_DL_CONTROL_BF0_SHIFT            (0U)
/*! BF0 - Forwarding Rule
 *  0b0..EtherCAT frames are processed, non-EtherCAT frames are forwarded without processing or modification.
 *  0b1..EtherCAT frames are processed, non-EtherCAT frames are destroyed.
 */
#define ECAT_ESC_DL_CONTROL_BF0(x)               (((uint32_t)(((uint32_t)(x)) << ECAT_ESC_DL_CONTROL_BF0_SHIFT)) & ECAT_ESC_DL_CONTROL_BF0_MASK)

#define ECAT_ESC_DL_CONTROL_BF1_MASK             (0x2U)
#define ECAT_ESC_DL_CONTROL_BF1_SHIFT            (1U)
/*! BF1 - Temporary use of settings in 0x0100:0x0103[8:15]:
 *  0b0..permanent use
 *  0b1..use for about 1 second, then revert to previous settings
 */
#define ECAT_ESC_DL_CONTROL_BF1(x)               (((uint32_t)(((uint32_t)(x)) << ECAT_ESC_DL_CONTROL_BF1_SHIFT)) & ECAT_ESC_DL_CONTROL_BF1_MASK)

#define ECAT_ESC_DL_CONTROL_BF2_MASK             (0xFCU)
#define ECAT_ESC_DL_CONTROL_BF2_SHIFT            (2U)
/*! BF2 - Reserved, Write 0 */
#define ECAT_ESC_DL_CONTROL_BF2(x)               (((uint32_t)(((uint32_t)(x)) << ECAT_ESC_DL_CONTROL_BF2_SHIFT)) & ECAT_ESC_DL_CONTROL_BF2_MASK)

#define ECAT_ESC_DL_CONTROL_BF8_MASK             (0x300U)
#define ECAT_ESC_DL_CONTROL_BF8_SHIFT            (8U)
/*! BF8 - Loop Port 0:
 *  0b00..Auto
 *  0b01..Auto Close
 *  0b10..Open
 *  0b11..Closed
 */
#define ECAT_ESC_DL_CONTROL_BF8(x)               (((uint32_t)(((uint32_t)(x)) << ECAT_ESC_DL_CONTROL_BF8_SHIFT)) & ECAT_ESC_DL_CONTROL_BF8_MASK)

#define ECAT_ESC_DL_CONTROL_BF10_MASK            (0xC00U)
#define ECAT_ESC_DL_CONTROL_BF10_SHIFT           (10U)
/*! BF10 - Loop Port 1:
 *  0b00..Auto
 *  0b01..Auto Close
 *  0b10..Open
 *  0b11..Closed
 */
#define ECAT_ESC_DL_CONTROL_BF10(x)              (((uint32_t)(((uint32_t)(x)) << ECAT_ESC_DL_CONTROL_BF10_SHIFT)) & ECAT_ESC_DL_CONTROL_BF10_MASK)

#define ECAT_ESC_DL_CONTROL_BF12_MASK            (0x3000U)
#define ECAT_ESC_DL_CONTROL_BF12_SHIFT           (12U)
/*! BF12 - Reserved */
#define ECAT_ESC_DL_CONTROL_BF12(x)              (((uint32_t)(((uint32_t)(x)) << ECAT_ESC_DL_CONTROL_BF12_SHIFT)) & ECAT_ESC_DL_CONTROL_BF12_MASK)

#define ECAT_ESC_DL_CONTROL_BF14_MASK            (0xC000U)
#define ECAT_ESC_DL_CONTROL_BF14_SHIFT           (14U)
/*! BF14 - Reserved */
#define ECAT_ESC_DL_CONTROL_BF14(x)              (((uint32_t)(((uint32_t)(x)) << ECAT_ESC_DL_CONTROL_BF14_SHIFT)) & ECAT_ESC_DL_CONTROL_BF14_MASK)

#define ECAT_ESC_DL_CONTROL_BF16_MASK            (0x70000U)
#define ECAT_ESC_DL_CONTROL_BF16_SHIFT           (16U)
/*! BF16 - RX FIFO Size (ESC delays start of forwarding until FIFO is at least half full). */
#define ECAT_ESC_DL_CONTROL_BF16(x)              (((uint32_t)(((uint32_t)(x)) << ECAT_ESC_DL_CONTROL_BF16_SHIFT)) & ECAT_ESC_DL_CONTROL_BF16_MASK)

#define ECAT_ESC_DL_CONTROL_BF20_MASK            (0x300000U)
#define ECAT_ESC_DL_CONTROL_BF20_SHIFT           (20U)
/*! BF20 - Reserved, write 0 */
#define ECAT_ESC_DL_CONTROL_BF20(x)              (((uint32_t)(((uint32_t)(x)) << ECAT_ESC_DL_CONTROL_BF20_SHIFT)) & ECAT_ESC_DL_CONTROL_BF20_MASK)

#define ECAT_ESC_DL_CONTROL_BF23_MASK            (0x800000U)
#define ECAT_ESC_DL_CONTROL_BF23_SHIFT           (23U)
/*! BF23 - Reserved, write 0 */
#define ECAT_ESC_DL_CONTROL_BF23(x)              (((uint32_t)(((uint32_t)(x)) << ECAT_ESC_DL_CONTROL_BF23_SHIFT)) & ECAT_ESC_DL_CONTROL_BF23_MASK)

#define ECAT_ESC_DL_CONTROL_BF24_MASK            (0x1000000U)
#define ECAT_ESC_DL_CONTROL_BF24_SHIFT           (24U)
/*! BF24 - Station alias:
 *  0b0..Ignore Station Alias
 *  0b1..Alias can be used for all configured address command types (FPRD, FPWR, ...)
 */
#define ECAT_ESC_DL_CONTROL_BF24(x)              (((uint32_t)(((uint32_t)(x)) << ECAT_ESC_DL_CONTROL_BF24_SHIFT)) & ECAT_ESC_DL_CONTROL_BF24_MASK)

#define ECAT_ESC_DL_CONTROL_BF25_MASK            (0xFE000000U)
#define ECAT_ESC_DL_CONTROL_BF25_SHIFT           (25U)
/*! BF25 - Reserved, write 0 */
#define ECAT_ESC_DL_CONTROL_BF25(x)              (((uint32_t)(((uint32_t)(x)) << ECAT_ESC_DL_CONTROL_BF25_SHIFT)) & ECAT_ESC_DL_CONTROL_BF25_MASK)
/*! @} */

/*! @name ESC_DL_CONTROL_PDI - ESC DL Control */
/*! @{ */

#define ECAT_ESC_DL_CONTROL_PDI_BF0_MASK         (0x1U)
#define ECAT_ESC_DL_CONTROL_PDI_BF0_SHIFT        (0U)
/*! BF0 - Forwarding Rule
 *  0b0..EtherCAT frames are processed, non-EtherCAT frames are forwarded without processing or modification.
 *  0b1..EtherCAT frames are processed, non-EtherCAT frames are destroyed.
 */
#define ECAT_ESC_DL_CONTROL_PDI_BF0(x)           (((uint32_t)(((uint32_t)(x)) << ECAT_ESC_DL_CONTROL_PDI_BF0_SHIFT)) & ECAT_ESC_DL_CONTROL_PDI_BF0_MASK)

#define ECAT_ESC_DL_CONTROL_PDI_BF1_MASK         (0x2U)
#define ECAT_ESC_DL_CONTROL_PDI_BF1_SHIFT        (1U)
/*! BF1 - Temporary use of settings in 0x0100:0x0103[8:15]:
 *  0b0..permanent use
 *  0b1..use for about 1 second, then revert to previous settings
 */
#define ECAT_ESC_DL_CONTROL_PDI_BF1(x)           (((uint32_t)(((uint32_t)(x)) << ECAT_ESC_DL_CONTROL_PDI_BF1_SHIFT)) & ECAT_ESC_DL_CONTROL_PDI_BF1_MASK)

#define ECAT_ESC_DL_CONTROL_PDI_BF2_MASK         (0xFCU)
#define ECAT_ESC_DL_CONTROL_PDI_BF2_SHIFT        (2U)
/*! BF2 - Reserved, Write 0 */
#define ECAT_ESC_DL_CONTROL_PDI_BF2(x)           (((uint32_t)(((uint32_t)(x)) << ECAT_ESC_DL_CONTROL_PDI_BF2_SHIFT)) & ECAT_ESC_DL_CONTROL_PDI_BF2_MASK)

