JayHeng/imxrt-tool-flash-algo/boards/nxp_evkmimxrt1180_rev.c/flash_algo_c0_silicon/Keil_JLink/rom_api/MIMXRT1189_cm7.h
#define ECAT_PDI_INFORMATION_BF1_MASK            (0x2U)
#define ECAT_PDI_INFORMATION_BF1_SHIFT           (1U)
/*! BF1 - ESC configuration area loaded from EEPROM:
 *  0b0..not loaded
 *  0b1..loaded
 */
#define ECAT_PDI_INFORMATION_BF1(x)              (((uint16_t)(((uint16_t)(x)) << ECAT_PDI_INFORMATION_BF1_SHIFT)) & ECAT_PDI_INFORMATION_BF1_MASK)

#define ECAT_PDI_INFORMATION_BF2_MASK            (0x4U)
#define ECAT_PDI_INFORMATION_BF2_SHIFT           (2U)
/*! BF2 - PDI active:
 *  0b0..PDI not active
 *  0b1..PDI active
 */
#define ECAT_PDI_INFORMATION_BF2(x)              (((uint16_t)(((uint16_t)(x)) << ECAT_PDI_INFORMATION_BF2_SHIFT)) & ECAT_PDI_INFORMATION_BF2_MASK)

#define ECAT_PDI_INFORMATION_BF3_MASK            (0x8U)
#define ECAT_PDI_INFORMATION_BF3_SHIFT           (3U)
/*! BF3 - PDI configuration invalid:
 *  0b0..PDI configuration ok
 *  0b1..PDI configuration invalid
 */
#define ECAT_PDI_INFORMATION_BF3(x)              (((uint16_t)(((uint16_t)(x)) << ECAT_PDI_INFORMATION_BF3_SHIFT)) & ECAT_PDI_INFORMATION_BF3_MASK)

#define ECAT_PDI_INFORMATION_BF4_MASK            (0xFFF0U)
#define ECAT_PDI_INFORMATION_BF4_SHIFT           (4U)
/*! BF4 - Reserved */
#define ECAT_PDI_INFORMATION_BF4(x)              (((uint16_t)(((uint16_t)(x)) << ECAT_PDI_INFORMATION_BF4_SHIFT)) & ECAT_PDI_INFORMATION_BF4_MASK)
/*! @} */

/*! @name PDI_ON_CHIP_BUS_CONFIGURATION - Register PDI On-chip bus configuration */
/*! @{ */

#define ECAT_PDI_ON_CHIP_BUS_CONFIGURATION_BF0_MASK (0x1FU)
#define ECAT_PDI_ON_CHIP_BUS_CONFIGURATION_BF0_SHIFT (0U)
/*! BF0 - On-chip bus clock:
 *  0b00000..asynchronous
 *  0b00001-0b11111..synchronous multiplication factor (N * 25 MHz)
 */
#define ECAT_PDI_ON_CHIP_BUS_CONFIGURATION_BF0(x) (((uint8_t)(((uint8_t)(x)) << ECAT_PDI_ON_CHIP_BUS_CONFIGURATION_BF0_SHIFT)) & ECAT_PDI_ON_CHIP_BUS_CONFIGURATION_BF0_MASK)

#define ECAT_PDI_ON_CHIP_BUS_CONFIGURATION_BF5_MASK (0xE0U)
#define ECAT_PDI_ON_CHIP_BUS_CONFIGURATION_BF5_SHIFT (5U)
/*! BF5 - On-chip bus
 *  0b000..Intel® Avalon®
 *  0b001..AXI® 010: Xilinx® PLB v4.6
 *  0b100..Xilinx OPB
 */
#define ECAT_PDI_ON_CHIP_BUS_CONFIGURATION_BF5(x) (((uint8_t)(((uint8_t)(x)) << ECAT_PDI_ON_CHIP_BUS_CONFIGURATION_BF5_SHIFT)) & ECAT_PDI_ON_CHIP_BUS_CONFIGURATION_BF5_MASK)
/*! @} */

/*! @name SYNC_LATCH_1_AND_0_PDI_CONFIGURATION - PDI Configuration Sync Latch 1 and 0 PDI Configuration */
/*! @{ */

#define ECAT_SYNC_LATCH_1_AND_0_PDI_CONFIGURATION_BF0_MASK (0x3U)
#define ECAT_SYNC_LATCH_1_AND_0_PDI_CONFIGURATION_BF0_SHIFT (0U)
/*! BF0 - SYNC0 output driver/polarity:
 *  0b00..Push-Pull active low
 *  0b01..Open Drain (active low)
 *  0b10..Push-Pull active high
 *  0b11..Open Source (active high)
 */
#define ECAT_SYNC_LATCH_1_AND_0_PDI_CONFIGURATION_BF0(x) (((uint8_t)(((uint8_t)(x)) << ECAT_SYNC_LATCH_1_AND_0_PDI_CONFIGURATION_BF0_SHIFT)) & ECAT_SYNC_LATCH_1_AND_0_PDI_CONFIGURATION_BF0_MASK)

#define ECAT_SYNC_LATCH_1_AND_0_PDI_CONFIGURATION_BF2_MASK (0x4U)
#define ECAT_SYNC_LATCH_1_AND_0_PDI_CONFIGURATION_BF2_SHIFT (2U)
/*! BF2 - SYNC0/LATCH0 configuration*:
 *  0b0..LATCH0 Input
 *  0b1..SYNC0 Output
 */
#define ECAT_SYNC_LATCH_1_AND_0_PDI_CONFIGURATION_BF2(x) (((uint8_t)(((uint8_t)(x)) << ECAT_SYNC_LATCH_1_AND_0_PDI_CONFIGURATION_BF2_SHIFT)) & ECAT_SYNC_LATCH_1_AND_0_PDI_CONFIGURATION_BF2_MASK)

#define ECAT_SYNC_LATCH_1_AND_0_PDI_CONFIGURATION_BF3_MASK (0x8U)
#define ECAT_SYNC_LATCH_1_AND_0_PDI_CONFIGURATION_BF3_SHIFT (3U)
/*! BF3 - SYNC0 mapped to AL Event Request register 0x0220[2]:
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define ECAT_SYNC_LATCH_1_AND_0_PDI_CONFIGURATION_BF3(x) (((uint8_t)(((uint8_t)(x)) << ECAT_SYNC_LATCH_1_AND_0_PDI_CONFIGURATION_BF3_SHIFT)) & ECAT_SYNC_LATCH_1_AND_0_PDI_CONFIGURATION_BF3_MASK)

#define ECAT_SYNC_LATCH_1_AND_0_PDI_CONFIGURATION_BF4_MASK (0x30U)
#define ECAT_SYNC_LATCH_1_AND_0_PDI_CONFIGURATION_BF4_SHIFT (4U)
/*! BF4 - SYNC1 output driver/polarity:
 *  0b00..Push-Pull active low
 *  0b01..Open Drain (active low)
 *  0b10..Push-Pull active high
 *  0b11..Open Source (active high)
 */
#define ECAT_SYNC_LATCH_1_AND_0_PDI_CONFIGURATION_BF4(x) (((uint8_t)(((uint8_t)(x)) << ECAT_SYNC_LATCH_1_AND_0_PDI_CONFIGURATION_BF4_SHIFT)) & ECAT_SYNC_LATCH_1_AND_0_PDI_CONFIGURATION_BF4_MASK)

#define ECAT_SYNC_LATCH_1_AND_0_PDI_CONFIGURATION_BF6_MASK (0x40U)
#define ECAT_SYNC_LATCH_1_AND_0_PDI_CONFIGURATION_BF6_SHIFT (6U)
/*! BF6 - SYNC1/LATCH1 configuration*
 *  0b0..LATCH1 input
 *  0b1..SYNC1 output
 */
#define ECAT_SYNC_LATCH_1_AND_0_PDI_CONFIGURATION_BF6(x) (((uint8_t)(((uint8_t)(x)) << ECAT_SYNC_LATCH_1_AND_0_PDI_CONFIGURATION_BF6_SHIFT)) & ECAT_SYNC_LATCH_1_AND_0_PDI_CONFIGURATION_BF6_MASK)

#define ECAT_SYNC_LATCH_1_AND_0_PDI_CONFIGURATION_BF7_MASK (0x80U)
#define ECAT_SYNC_LATCH_1_AND_0_PDI_CONFIGURATION_BF7_SHIFT (7U)
/*! BF7 - SYNC1 mapped to AL Event Request register 0x0220[3]:
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define ECAT_SYNC_LATCH_1_AND_0_PDI_CONFIGURATION_BF7(x) (((uint8_t)(((uint8_t)(x)) << ECAT_SYNC_LATCH_1_AND_0_PDI_CONFIGURATION_BF7_SHIFT)) & ECAT_SYNC_LATCH_1_AND_0_PDI_CONFIGURATION_BF7_MASK)
/*! @} */

/*! @name PDI_ON_CHIP_BUS_EXTENDED_CONFIGURATION - Register PDI On-chip bus extended configuration. */
/*! @{ */

#define ECAT_PDI_ON_CHIP_BUS_EXTENDED_CONFIGURATION_BF0_MASK (0x3U)
#define ECAT_PDI_ON_CHIP_BUS_EXTENDED_CONFIGURATION_BF0_SHIFT (0U)
/*! BF0 - Read prefetch size (in cycles of PDI width):
 *  0b00..4 cycles
 *  0b01..1 cycle (typical)
 *  0b10..2 cycles
 *  0b11..Reserved
 */
#define ECAT_PDI_ON_CHIP_BUS_EXTENDED_CONFIGURATION_BF0(x) (((uint16_t)(((uint16_t)(x)) << ECAT_PDI_ON_CHIP_BUS_EXTENDED_CONFIGURATION_BF0_SHIFT)) & ECAT_PDI_ON_CHIP_BUS_EXTENDED_CONFIGURATION_BF0_MASK)

#define ECAT_PDI_ON_CHIP_BUS_EXTENDED_CONFIGURATION_BF2_MASK (0xFCU)
#define ECAT_PDI_ON_CHIP_BUS_EXTENDED_CONFIGURATION_BF2_SHIFT (2U)
/*! BF2 - Reserved */
#define ECAT_PDI_ON_CHIP_BUS_EXTENDED_CONFIGURATION_BF2(x) (((uint16_t)(((uint16_t)(x)) << ECAT_PDI_ON_CHIP_BUS_EXTENDED_CONFIGURATION_BF2_SHIFT)) & ECAT_PDI_ON_CHIP_BUS_EXTENDED_CONFIGURATION_BF2_MASK)

