JayHeng/imxrt-tool-flash-algo/boards/nxp_evkmimxrt1180_rev.c/flash_algo_c0_silicon/Keil_JLink/rom_api/MIMXRT1189_cm7.h
#define ECAT_ECAT_EVENT_REQUEST_BF11_MASK        (0x800U)
#define ECAT_ECAT_EVENT_REQUEST_BF11_SHIFT       (11U)
/*! BF11 - Mirrors values of each SyncManager Status:
 *  0b0..No Sync Channel 7 event
 *  0b1..Sync Channel 7 event pending
 */
#define ECAT_ECAT_EVENT_REQUEST_BF11(x)          (((uint16_t)(((uint16_t)(x)) << ECAT_ECAT_EVENT_REQUEST_BF11_SHIFT)) & ECAT_ECAT_EVENT_REQUEST_BF11_MASK)

#define ECAT_ECAT_EVENT_REQUEST_BF12_MASK        (0xF000U)
#define ECAT_ECAT_EVENT_REQUEST_BF12_SHIFT       (12U)
/*! BF12 - Reserved */
#define ECAT_ECAT_EVENT_REQUEST_BF12(x)          (((uint16_t)(((uint16_t)(x)) << ECAT_ECAT_EVENT_REQUEST_BF12_SHIFT)) & ECAT_ECAT_EVENT_REQUEST_BF12_MASK)
/*! @} */

/*! @name AL_EVENT_REQUEST - AL Event request */
/*! @{ */

#define ECAT_AL_EVENT_REQUEST_BF0_MASK           (0x1U)
#define ECAT_AL_EVENT_REQUEST_BF0_SHIFT          (0U)
/*! BF0 - AL Control event:
 *  0b0..No AL Control Register change
 *  0b1..AL Control Register has been written3
 */
#define ECAT_AL_EVENT_REQUEST_BF0(x)             (((uint32_t)(((uint32_t)(x)) << ECAT_AL_EVENT_REQUEST_BF0_SHIFT)) & ECAT_AL_EVENT_REQUEST_BF0_MASK)

#define ECAT_AL_EVENT_REQUEST_BF1_MASK           (0x2U)
#define ECAT_AL_EVENT_REQUEST_BF1_SHIFT          (1U)
/*! BF1 - DC Latch event:
 *  0b0..No change on DC Latch Inputs
 *  0b1..At least one change on DC Latch Inputs
 */
#define ECAT_AL_EVENT_REQUEST_BF1(x)             (((uint32_t)(((uint32_t)(x)) << ECAT_AL_EVENT_REQUEST_BF1_SHIFT)) & ECAT_AL_EVENT_REQUEST_BF1_MASK)

#define ECAT_AL_EVENT_REQUEST_BF2_MASK           (0x4U)
#define ECAT_AL_EVENT_REQUEST_BF2_SHIFT          (2U)
/*! BF2 - State of DC SYNC0 (if register 0x0151[3]=1): */
#define ECAT_AL_EVENT_REQUEST_BF2(x)             (((uint32_t)(((uint32_t)(x)) << ECAT_AL_EVENT_REQUEST_BF2_SHIFT)) & ECAT_AL_EVENT_REQUEST_BF2_MASK)

#define ECAT_AL_EVENT_REQUEST_BF3_MASK           (0x8U)
#define ECAT_AL_EVENT_REQUEST_BF3_SHIFT          (3U)
/*! BF3 - State of DC SYNC1 (if register 0x0151[7]=1): */
#define ECAT_AL_EVENT_REQUEST_BF3(x)             (((uint32_t)(((uint32_t)(x)) << ECAT_AL_EVENT_REQUEST_BF3_SHIFT)) & ECAT_AL_EVENT_REQUEST_BF3_MASK)

#define ECAT_AL_EVENT_REQUEST_BF4_MASK           (0x10U)
#define ECAT_AL_EVENT_REQUEST_BF4_SHIFT          (4U)
/*! BF4 - SyncManager activation register (SyncManager register offset 0x6) changed:
 *  0b0..No change in any SyncManager
 *  0b1..At least one SyncManager changed
 */
#define ECAT_AL_EVENT_REQUEST_BF4(x)             (((uint32_t)(((uint32_t)(x)) << ECAT_AL_EVENT_REQUEST_BF4_SHIFT)) & ECAT_AL_EVENT_REQUEST_BF4_MASK)

#define ECAT_AL_EVENT_REQUEST_BF5_MASK           (0x20U)
#define ECAT_AL_EVENT_REQUEST_BF5_SHIFT          (5U)
/*! BF5 - EEPROM Emulation:
 *  0b0..No command pending
 *  0b1..EEPROM command pending
 */
#define ECAT_AL_EVENT_REQUEST_BF5(x)             (((uint32_t)(((uint32_t)(x)) << ECAT_AL_EVENT_REQUEST_BF5_SHIFT)) & ECAT_AL_EVENT_REQUEST_BF5_MASK)

#define ECAT_AL_EVENT_REQUEST_BF6_MASK           (0x40U)
#define ECAT_AL_EVENT_REQUEST_BF6_SHIFT          (6U)
/*! BF6 - Watchdog Process Data:
 *  0b0..Has not expired
 *  0b1..Has expired
 */
#define ECAT_AL_EVENT_REQUEST_BF6(x)             (((uint32_t)(((uint32_t)(x)) << ECAT_AL_EVENT_REQUEST_BF6_SHIFT)) & ECAT_AL_EVENT_REQUEST_BF6_MASK)

#define ECAT_AL_EVENT_REQUEST_BF7_MASK           (0x80U)
#define ECAT_AL_EVENT_REQUEST_BF7_SHIFT          (7U)
/*! BF7 - Reserved */
#define ECAT_AL_EVENT_REQUEST_BF7(x)             (((uint32_t)(((uint32_t)(x)) << ECAT_AL_EVENT_REQUEST_BF7_SHIFT)) & ECAT_AL_EVENT_REQUEST_BF7_MASK)

#define ECAT_AL_EVENT_REQUEST_BF8_MASK           (0x100U)
#define ECAT_AL_EVENT_REQUEST_BF8_SHIFT          (8U)
/*! BF8 - SyncManager interrupts (SyncManager register offset 0x5, bit [0] or [1]):
 *  0b0..No SyncManager 0 interrupt
 *  0b1..SyncManager 0 interrupt pending
 */
#define ECAT_AL_EVENT_REQUEST_BF8(x)             (((uint32_t)(((uint32_t)(x)) << ECAT_AL_EVENT_REQUEST_BF8_SHIFT)) & ECAT_AL_EVENT_REQUEST_BF8_MASK)

#define ECAT_AL_EVENT_REQUEST_BF9_MASK           (0x200U)
#define ECAT_AL_EVENT_REQUEST_BF9_SHIFT          (9U)
/*! BF9 - Bit field access for ECAT: r/-
 *  0b0..No SyncManager 1 interrupt
 *  0b1..SyncManager 1 interrupt pending
 */
#define ECAT_AL_EVENT_REQUEST_BF9(x)             (((uint32_t)(((uint32_t)(x)) << ECAT_AL_EVENT_REQUEST_BF9_SHIFT)) & ECAT_AL_EVENT_REQUEST_BF9_MASK)

#define ECAT_AL_EVENT_REQUEST_BF10_MASK          (0x400U)
#define ECAT_AL_EVENT_REQUEST_BF10_SHIFT         (10U)
/*! BF10 - Bit field access for ECAT: r/-
 *  0b0..No SyncManager2 interrupt
 *  0b1..SyncManager 2 interrupt pending
 */
#define ECAT_AL_EVENT_REQUEST_BF10(x)            (((uint32_t)(((uint32_t)(x)) << ECAT_AL_EVENT_REQUEST_BF10_SHIFT)) & ECAT_AL_EVENT_REQUEST_BF10_MASK)

#define ECAT_AL_EVENT_REQUEST_BF11_MASK          (0x800U)
#define ECAT_AL_EVENT_REQUEST_BF11_SHIFT         (11U)
/*! BF11 - Bit field access for ECAT: r/-
 *  0b0..No SyncManager 3 interrupt
 *  0b1..SyncManager 3 interrupt pending
 */
#define ECAT_AL_EVENT_REQUEST_BF11(x)            (((uint32_t)(((uint32_t)(x)) << ECAT_AL_EVENT_REQUEST_BF11_SHIFT)) & ECAT_AL_EVENT_REQUEST_BF11_MASK)

#define ECAT_AL_EVENT_REQUEST_BF12_MASK          (0x1000U)
#define ECAT_AL_EVENT_REQUEST_BF12_SHIFT         (12U)
/*! BF12 - Bit field access for ECAT: r/-
 *  0b0..No SyncManager4 interrupt
 *  0b1..SyncManager 4 interrupt pending
 */
#define ECAT_AL_EVENT_REQUEST_BF12(x)            (((uint32_t)(((uint32_t)(x)) << ECAT_AL_EVENT_REQUEST_BF12_SHIFT)) & ECAT_AL_EVENT_REQUEST_BF12_MASK)

#define ECAT_AL_EVENT_REQUEST_BF13_MASK          (0x2000U)
#define ECAT_AL_EVENT_REQUEST_BF13_SHIFT         (13U)
/*! BF13 - Bit field access for ECAT: r/-
 *  0b0..No SyncManager 5 interrupt
 *  0b1..SyncManager 5 interrupt pending
 */
#define ECAT_AL_EVENT_REQUEST_BF13(x)            (((uint32_t)(((uint32_t)(x)) << ECAT_AL_EVENT_REQUEST_BF13_SHIFT)) & ECAT_AL_EVENT_REQUEST_BF13_MASK)

#define ECAT_AL_EVENT_REQUEST_BF14_MASK          (0x4000U)
#define ECAT_AL_EVENT_REQUEST_BF14_SHIFT         (14U)
/*! BF14 - Bit field access for ECAT: r/-
 *  0b0..No SyncManager 6 interrupt
 *  0b1..SyncManager6 interrupt pending
 */
#define ECAT_AL_EVENT_REQUEST_BF14(x)            (((uint32_t)(((uint32_t)(x)) << ECAT_AL_EVENT_REQUEST_BF14_SHIFT)) & ECAT_AL_EVENT_REQUEST_BF14_MASK)

