JayHeng/imxrt-tool-flash-algo/boards/nxp_evkmimxrt1180_rev.c/flash_algo_c0_silicon/Keil_JLink/rom_api/MIMXRT1189_cm7.h
#define ECAT_EEPROM_CONTROL_STATUS_PDI_BF11_MASK (0x800U)
#define ECAT_EEPROM_CONTROL_STATUS_PDI_BF11_SHIFT (11U)
/*! BF11 - Checksum Error in ESC Configuration Area:
 *  0b0..Checksum ok
 *  0b1..Checksum error
 */
#define ECAT_EEPROM_CONTROL_STATUS_PDI_BF11(x)   (((uint16_t)(((uint16_t)(x)) << ECAT_EEPROM_CONTROL_STATUS_PDI_BF11_SHIFT)) & ECAT_EEPROM_CONTROL_STATUS_PDI_BF11_MASK)

#define ECAT_EEPROM_CONTROL_STATUS_PDI_BF12_MASK (0x1000U)
#define ECAT_EEPROM_CONTROL_STATUS_PDI_BF12_SHIFT (12U)
/*! BF12 - EEPROM loading status:
 *  0b0..EEPROM loaded, device information ok
 *  0b1..EEPROM not loaded, device information not available (EEPROM loading in progress or finished with a failure)
 */
#define ECAT_EEPROM_CONTROL_STATUS_PDI_BF12(x)   (((uint16_t)(((uint16_t)(x)) << ECAT_EEPROM_CONTROL_STATUS_PDI_BF12_SHIFT)) & ECAT_EEPROM_CONTROL_STATUS_PDI_BF12_MASK)

#define ECAT_EEPROM_CONTROL_STATUS_PDI_BF13_MASK (0x2000U)
#define ECAT_EEPROM_CONTROL_STATUS_PDI_BF13_SHIFT (13U)
/*! BF13 - Error Acknowledge/Command3:
 *  0b0..No error
 *  0b1..Missing EEPROM acknowledge or invalid command
 */
#define ECAT_EEPROM_CONTROL_STATUS_PDI_BF13(x)   (((uint16_t)(((uint16_t)(x)) << ECAT_EEPROM_CONTROL_STATUS_PDI_BF13_SHIFT)) & ECAT_EEPROM_CONTROL_STATUS_PDI_BF13_MASK)

#define ECAT_EEPROM_CONTROL_STATUS_PDI_BF14_MASK (0x4000U)
#define ECAT_EEPROM_CONTROL_STATUS_PDI_BF14_SHIFT (14U)
/*! BF14 - Error Write Enable3:
 *  0b0..No error
 *  0b1..Write Command without Write enable
 */
#define ECAT_EEPROM_CONTROL_STATUS_PDI_BF14(x)   (((uint16_t)(((uint16_t)(x)) << ECAT_EEPROM_CONTROL_STATUS_PDI_BF14_SHIFT)) & ECAT_EEPROM_CONTROL_STATUS_PDI_BF14_MASK)

#define ECAT_EEPROM_CONTROL_STATUS_PDI_BF15_MASK (0x8000U)
#define ECAT_EEPROM_CONTROL_STATUS_PDI_BF15_SHIFT (15U)
/*! BF15 - Busy:
 *  0b0..EEPROM Interface is idle
 *  0b1..EEPROM Interface is busy
 */
#define ECAT_EEPROM_CONTROL_STATUS_PDI_BF15(x)   (((uint16_t)(((uint16_t)(x)) << ECAT_EEPROM_CONTROL_STATUS_PDI_BF15_SHIFT)) & ECAT_EEPROM_CONTROL_STATUS_PDI_BF15_MASK)
/*! @} */

/*! @name EEPROM_ADDRESS - EEPROM Address */
/*! @{ */

#define ECAT_EEPROM_ADDRESS_BF0_MASK             (0xFFFFFFFFU)
#define ECAT_EEPROM_ADDRESS_BF0_SHIFT            (0U)
/*! BF0 - EEPROM Address */
#define ECAT_EEPROM_ADDRESS_BF0(x)               (((uint32_t)(((uint32_t)(x)) << ECAT_EEPROM_ADDRESS_BF0_SHIFT)) & ECAT_EEPROM_ADDRESS_BF0_MASK)
/*! @} */

/*! @name EEPROM_DATA - EEPROM Data */
/*! @{ */

#define ECAT_EEPROM_DATA_BF0_MASK                (0xFFFFU)
#define ECAT_EEPROM_DATA_BF0_SHIFT               (0U)
/*! BF0 - EEPROM Write data (data to be written to EEPROM) or EEPROM Read data (data read from EEPROM,. lower bytes) */
#define ECAT_EEPROM_DATA_BF0(x)                  (((uint64_t)(((uint64_t)(x)) << ECAT_EEPROM_DATA_BF0_SHIFT)) & ECAT_EEPROM_DATA_BF0_MASK)

#define ECAT_EEPROM_DATA_BF16_MASK               (0xFFFFFFFFFFFF0000U)
#define ECAT_EEPROM_DATA_BF16_SHIFT              (16U)
/*! BF16 - EEPROM Read data (data read from EEPROM, higher bytes) */
#define ECAT_EEPROM_DATA_BF16(x)                 (((uint64_t)(((uint64_t)(x)) << ECAT_EEPROM_DATA_BF16_SHIFT)) & ECAT_EEPROM_DATA_BF16_MASK)
/*! @} */

/*! @name MII_MANAGEMENT_CONTROL_OR_STATUS - MII Management Control/Status */
/*! @{ */

#define ECAT_MII_MANAGEMENT_CONTROL_OR_STATUS_BF0_MASK (0x1U)
#define ECAT_MII_MANAGEMENT_CONTROL_OR_STATUS_BF0_SHIFT (0U)
/*! BF0 - Write enable*:
 *  0b0..Write disabled
 *  0b1..Write enabled
 */
#define ECAT_MII_MANAGEMENT_CONTROL_OR_STATUS_BF0(x) (((uint16_t)(((uint16_t)(x)) << ECAT_MII_MANAGEMENT_CONTROL_OR_STATUS_BF0_SHIFT)) & ECAT_MII_MANAGEMENT_CONTROL_OR_STATUS_BF0_MASK)

#define ECAT_MII_MANAGEMENT_CONTROL_OR_STATUS_BF1_MASK (0x2U)
#define ECAT_MII_MANAGEMENT_CONTROL_OR_STATUS_BF1_SHIFT (1U)
/*! BF1 - Management Interface can be controlled by PDI (registers 0x0516-0x0517):
 *  0b0..Only ECAT control
 *  0b1..PDI control possible
 */
#define ECAT_MII_MANAGEMENT_CONTROL_OR_STATUS_BF1(x) (((uint16_t)(((uint16_t)(x)) << ECAT_MII_MANAGEMENT_CONTROL_OR_STATUS_BF1_SHIFT)) & ECAT_MII_MANAGEMENT_CONTROL_OR_STATUS_BF1_MASK)

#define ECAT_MII_MANAGEMENT_CONTROL_OR_STATUS_BF2_MASK (0x4U)
#define ECAT_MII_MANAGEMENT_CONTROL_OR_STATUS_BF2_SHIFT (2U)
/*! BF2 - MI link detection and configuration:
 *  0b0..Disabled for all ports
 *  0b1..Enabled for at least one MII port, refer to PHY Port Status (0x0518 ff.) for details
 */
#define ECAT_MII_MANAGEMENT_CONTROL_OR_STATUS_BF2(x) (((uint16_t)(((uint16_t)(x)) << ECAT_MII_MANAGEMENT_CONTROL_OR_STATUS_BF2_SHIFT)) & ECAT_MII_MANAGEMENT_CONTROL_OR_STATUS_BF2_MASK)

#define ECAT_MII_MANAGEMENT_CONTROL_OR_STATUS_BF3_MASK (0xF8U)
#define ECAT_MII_MANAGEMENT_CONTROL_OR_STATUS_BF3_SHIFT (3U)
/*! BF3 - PHY address of port 0 */
#define ECAT_MII_MANAGEMENT_CONTROL_OR_STATUS_BF3(x) (((uint16_t)(((uint16_t)(x)) << ECAT_MII_MANAGEMENT_CONTROL_OR_STATUS_BF3_SHIFT)) & ECAT_MII_MANAGEMENT_CONTROL_OR_STATUS_BF3_MASK)

#define ECAT_MII_MANAGEMENT_CONTROL_OR_STATUS_BF8_MASK (0x300U)
#define ECAT_MII_MANAGEMENT_CONTROL_OR_STATUS_BF8_SHIFT (8U)
/*! BF8 - Command register*:
 *  0b00..No command/MI idle (clear error bits)
 *  0b01..Read
 *  0b10..Write
 *  0b11..Reserved/invalid command (do not issue)
 */
#define ECAT_MII_MANAGEMENT_CONTROL_OR_STATUS_BF8(x) (((uint16_t)(((uint16_t)(x)) << ECAT_MII_MANAGEMENT_CONTROL_OR_STATUS_BF8_SHIFT)) & ECAT_MII_MANAGEMENT_CONTROL_OR_STATUS_BF8_MASK)

#define ECAT_MII_MANAGEMENT_CONTROL_OR_STATUS_BF10_MASK (0x1C00U)
#define ECAT_MII_MANAGEMENT_CONTROL_OR_STATUS_BF10_SHIFT (10U)
/*! BF10 - Reserved, write 0 */
#define ECAT_MII_MANAGEMENT_CONTROL_OR_STATUS_BF10(x) (((uint16_t)(((uint16_t)(x)) << ECAT_MII_MANAGEMENT_CONTROL_OR_STATUS_BF10_SHIFT)) & ECAT_MII_MANAGEMENT_CONTROL_OR_STATUS_BF10_MASK)

#define ECAT_MII_MANAGEMENT_CONTROL_OR_STATUS_BF13_MASK (0x2000U)
#define ECAT_MII_MANAGEMENT_CONTROL_OR_STATUS_BF13_SHIFT (13U)
/*! BF13 - Read error:
 *  0b0..No read error
 *  0b1..Read error occurred (PHY or register not available)
 */
#define ECAT_MII_MANAGEMENT_CONTROL_OR_STATUS_BF13(x) (((uint16_t)(((uint16_t)(x)) << ECAT_MII_MANAGEMENT_CONTROL_OR_STATUS_BF13_SHIFT)) & ECAT_MII_MANAGEMENT_CONTROL_OR_STATUS_BF13_MASK)

#define ECAT_MII_MANAGEMENT_CONTROL_OR_STATUS_BF14_MASK (0x4000U)
#define ECAT_MII_MANAGEMENT_CONTROL_OR_STATUS_BF14_SHIFT (14U)
/*! BF14 - Command error:
 *  0b0..Last Command was successful
 *  0b1..Invalid command or write command without Write Enable
 */
#define ECAT_MII_MANAGEMENT_CONTROL_OR_STATUS_BF14(x) (((uint16_t)(((uint16_t)(x)) << ECAT_MII_MANAGEMENT_CONTROL_OR_STATUS_BF14_SHIFT)) & ECAT_MII_MANAGEMENT_CONTROL_OR_STATUS_BF14_MASK)

#define ECAT_MII_MANAGEMENT_CONTROL_OR_STATUS_BF15_MASK (0x8000U)
#define ECAT_MII_MANAGEMENT_CONTROL_OR_STATUS_BF15_SHIFT (15U)
/*! BF15 - Busy:
 *  0b0..MII Management Interface is idle
 *  0b1..MII Management Interface is busy
 */
#define ECAT_MII_MANAGEMENT_CONTROL_OR_STATUS_BF15(x) (((uint16_t)(((uint16_t)(x)) << ECAT_MII_MANAGEMENT_CONTROL_OR_STATUS_BF15_SHIFT)) & ECAT_MII_MANAGEMENT_CONTROL_OR_STATUS_BF15_MASK)
/*! @} */

