JayHeng/imxrt-tool-flash-algo/boards/nxp_evkmimxrt1180_rev.c/flash_algo_c0_silicon/Keil_JLink/rom_api/MIMXRT1189_cm7.h
/*! @name MII_MANAGEMENT_ECAT_ACCESS_STATE - MII Management ECAT Access State */
/*! @{ */

#define ECAT_MII_MANAGEMENT_ECAT_ACCESS_STATE_BF0_MASK (0x1U)
#define ECAT_MII_MANAGEMENT_ECAT_ACCESS_STATE_BF0_SHIFT (0U)
/*! BF0 - Access to MII management:
 *  0b0..ECAT enables PDI takeover of MII management interface
 *  0b1..ECAT claims exclusive access to MII management interface
 */
#define ECAT_MII_MANAGEMENT_ECAT_ACCESS_STATE_BF0(x) (((uint8_t)(((uint8_t)(x)) << ECAT_MII_MANAGEMENT_ECAT_ACCESS_STATE_BF0_SHIFT)) & ECAT_MII_MANAGEMENT_ECAT_ACCESS_STATE_BF0_MASK)

#define ECAT_MII_MANAGEMENT_ECAT_ACCESS_STATE_BF1_MASK (0xFEU)
#define ECAT_MII_MANAGEMENT_ECAT_ACCESS_STATE_BF1_SHIFT (1U)
/*! BF1 - Reserved, write 0 */
#define ECAT_MII_MANAGEMENT_ECAT_ACCESS_STATE_BF1(x) (((uint8_t)(((uint8_t)(x)) << ECAT_MII_MANAGEMENT_ECAT_ACCESS_STATE_BF1_SHIFT)) & ECAT_MII_MANAGEMENT_ECAT_ACCESS_STATE_BF1_MASK)
/*! @} */

/*! @name MII_MANAGEMENT_ECAT_ACCESS_STATE_PDI - MII Management ECAT Access State */
/*! @{ */

#define ECAT_MII_MANAGEMENT_ECAT_ACCESS_STATE_PDI_BF0_MASK (0x1U)
#define ECAT_MII_MANAGEMENT_ECAT_ACCESS_STATE_PDI_BF0_SHIFT (0U)
/*! BF0 - Access to MII management:
 *  0b0..ECAT enables PDI takeover of MII management interface
 *  0b1..ECAT claims exclusive access to MII management interface
 */
#define ECAT_MII_MANAGEMENT_ECAT_ACCESS_STATE_PDI_BF0(x) (((uint8_t)(((uint8_t)(x)) << ECAT_MII_MANAGEMENT_ECAT_ACCESS_STATE_PDI_BF0_SHIFT)) & ECAT_MII_MANAGEMENT_ECAT_ACCESS_STATE_PDI_BF0_MASK)

#define ECAT_MII_MANAGEMENT_ECAT_ACCESS_STATE_PDI_BF1_MASK (0xFEU)
#define ECAT_MII_MANAGEMENT_ECAT_ACCESS_STATE_PDI_BF1_SHIFT (1U)
/*! BF1 - Reserved, write 0 */
#define ECAT_MII_MANAGEMENT_ECAT_ACCESS_STATE_PDI_BF1(x) (((uint8_t)(((uint8_t)(x)) << ECAT_MII_MANAGEMENT_ECAT_ACCESS_STATE_PDI_BF1_SHIFT)) & ECAT_MII_MANAGEMENT_ECAT_ACCESS_STATE_PDI_BF1_MASK)
/*! @} */

/*! @name MII_MANAGEMENT_PDI_ACCESS_STATE - MII Management PDI Access State */
/*! @{ */

#define ECAT_MII_MANAGEMENT_PDI_ACCESS_STATE_BF0_MASK (0x1U)
#define ECAT_MII_MANAGEMENT_PDI_ACCESS_STATE_BF0_SHIFT (0U)
/*! BF0 - Access to MII management:
 *  0b0..ECAT has access to MII management
 *  0b1..PDI has access to MII management
 */
#define ECAT_MII_MANAGEMENT_PDI_ACCESS_STATE_BF0(x) (((uint8_t)(((uint8_t)(x)) << ECAT_MII_MANAGEMENT_PDI_ACCESS_STATE_BF0_SHIFT)) & ECAT_MII_MANAGEMENT_PDI_ACCESS_STATE_BF0_MASK)

#define ECAT_MII_MANAGEMENT_PDI_ACCESS_STATE_BF1_MASK (0x2U)
#define ECAT_MII_MANAGEMENT_PDI_ACCESS_STATE_BF1_SHIFT (1U)
/*! BF1 - Force PDI Access State:
 *  0b0..Do not change Bit 0x0517[0]
 *  0b1..Reset Bit 0x0517[0] to 0
 */
#define ECAT_MII_MANAGEMENT_PDI_ACCESS_STATE_BF1(x) (((uint8_t)(((uint8_t)(x)) << ECAT_MII_MANAGEMENT_PDI_ACCESS_STATE_BF1_SHIFT)) & ECAT_MII_MANAGEMENT_PDI_ACCESS_STATE_BF1_MASK)

#define ECAT_MII_MANAGEMENT_PDI_ACCESS_STATE_BF2_MASK (0xFCU)
#define ECAT_MII_MANAGEMENT_PDI_ACCESS_STATE_BF2_SHIFT (2U)
/*! BF2 - Reserved, write 0 */
#define ECAT_MII_MANAGEMENT_PDI_ACCESS_STATE_BF2(x) (((uint8_t)(((uint8_t)(x)) << ECAT_MII_MANAGEMENT_PDI_ACCESS_STATE_BF2_SHIFT)) & ECAT_MII_MANAGEMENT_PDI_ACCESS_STATE_BF2_MASK)
/*! @} */

/*! @name MII_MANAGEMENT_PDI_ACCESS_STATE_PDI - MII Management PDI Access State */
/*! @{ */

#define ECAT_MII_MANAGEMENT_PDI_ACCESS_STATE_PDI_BF0_MASK (0x1U)
#define ECAT_MII_MANAGEMENT_PDI_ACCESS_STATE_PDI_BF0_SHIFT (0U)
/*! BF0 - Access to MII management:
 *  0b0..ECAT has access to MII management
 *  0b1..PDI has access to MII management
 */
#define ECAT_MII_MANAGEMENT_PDI_ACCESS_STATE_PDI_BF0(x) (((uint8_t)(((uint8_t)(x)) << ECAT_MII_MANAGEMENT_PDI_ACCESS_STATE_PDI_BF0_SHIFT)) & ECAT_MII_MANAGEMENT_PDI_ACCESS_STATE_PDI_BF0_MASK)

#define ECAT_MII_MANAGEMENT_PDI_ACCESS_STATE_PDI_BF1_MASK (0x2U)
#define ECAT_MII_MANAGEMENT_PDI_ACCESS_STATE_PDI_BF1_SHIFT (1U)
/*! BF1 - Force PDI Access State:
 *  0b0..Do not change Bit 0x0517[0]
 *  0b1..Reset Bit 0x0517[0] to 0
 */
#define ECAT_MII_MANAGEMENT_PDI_ACCESS_STATE_PDI_BF1(x) (((uint8_t)(((uint8_t)(x)) << ECAT_MII_MANAGEMENT_PDI_ACCESS_STATE_PDI_BF1_SHIFT)) & ECAT_MII_MANAGEMENT_PDI_ACCESS_STATE_PDI_BF1_MASK)

#define ECAT_MII_MANAGEMENT_PDI_ACCESS_STATE_PDI_BF2_MASK (0xFCU)
#define ECAT_MII_MANAGEMENT_PDI_ACCESS_STATE_PDI_BF2_SHIFT (2U)
/*! BF2 - Reserved, write 0 */
#define ECAT_MII_MANAGEMENT_PDI_ACCESS_STATE_PDI_BF2(x) (((uint8_t)(((uint8_t)(x)) << ECAT_MII_MANAGEMENT_PDI_ACCESS_STATE_PDI_BF2_SHIFT)) & ECAT_MII_MANAGEMENT_PDI_ACCESS_STATE_PDI_BF2_MASK)
/*! @} */

/*! @name PHY_PORT_STATUS_PHY_PORT_STATSUS - PHY Port */
/*! @{ */

#define ECAT_PHY_PORT_STATUS_PHY_PORT_STATSUS_BF0_MASK (0x1U)
#define ECAT_PHY_PORT_STATUS_PHY_PORT_STATSUS_BF0_SHIFT (0U)
/*! BF0 - Physical link status (PHY status register 1.2):
 *  0b0..No physical link
 *  0b1..Physical link detected
 */
#define ECAT_PHY_PORT_STATUS_PHY_PORT_STATSUS_BF0(x) (((uint8_t)(((uint8_t)(x)) << ECAT_PHY_PORT_STATUS_PHY_PORT_STATSUS_BF0_SHIFT)) & ECAT_PHY_PORT_STATUS_PHY_PORT_STATSUS_BF0_MASK)

#define ECAT_PHY_PORT_STATUS_PHY_PORT_STATSUS_BF1_MASK (0x2U)
#define ECAT_PHY_PORT_STATUS_PHY_PORT_STATSUS_BF1_SHIFT (1U)
/*! BF1 - Link status (100 Mbit/s, Full Duplex, Auto negotiation):
 *  0b0..No link
 *  0b1..Link detected
 */
#define ECAT_PHY_PORT_STATUS_PHY_PORT_STATSUS_BF1(x) (((uint8_t)(((uint8_t)(x)) << ECAT_PHY_PORT_STATUS_PHY_PORT_STATSUS_BF1_SHIFT)) & ECAT_PHY_PORT_STATUS_PHY_PORT_STATSUS_BF1_MASK)

#define ECAT_PHY_PORT_STATUS_PHY_PORT_STATSUS_BF2_MASK (0x4U)
#define ECAT_PHY_PORT_STATUS_PHY_PORT_STATSUS_BF2_SHIFT (2U)
/*! BF2 - Link status error:
 *  0b0..No error
 *  0b1..Link error, link inhibited
 */
#define ECAT_PHY_PORT_STATUS_PHY_PORT_STATSUS_BF2(x) (((uint8_t)(((uint8_t)(x)) << ECAT_PHY_PORT_STATUS_PHY_PORT_STATSUS_BF2_SHIFT)) & ECAT_PHY_PORT_STATUS_PHY_PORT_STATSUS_BF2_MASK)

#define ECAT_PHY_PORT_STATUS_PHY_PORT_STATSUS_BF3_MASK (0x8U)
#define ECAT_PHY_PORT_STATUS_PHY_PORT_STATSUS_BF3_SHIFT (3U)
/*! BF3 - Read error:
 *  0b0..No read error occurred
 *  0b1..A read error has occurred
 */
#define ECAT_PHY_PORT_STATUS_PHY_PORT_STATSUS_BF3(x) (((uint8_t)(((uint8_t)(x)) << ECAT_PHY_PORT_STATUS_PHY_PORT_STATSUS_BF3_SHIFT)) & ECAT_PHY_PORT_STATUS_PHY_PORT_STATSUS_BF3_MASK)

