JayHeng/imxrt-tool-flash-algo/boards/nxp_evkmimxrt1180_rev.c/flash_algo_c0_silicon/Keil_JLink/rom_api/MIMXRT1189_cm7.h
#define ECAT_PHY_PORT_STATUS_PHY_PORT_STATSUS_BF4_MASK (0x10U)
#define ECAT_PHY_PORT_STATUS_PHY_PORT_STATSUS_BF4_SHIFT (4U)
/*! BF4 - Link partner error:
 *  0b0..No error detected
 *  0b1..Link partner error
 */
#define ECAT_PHY_PORT_STATUS_PHY_PORT_STATSUS_BF4(x) (((uint8_t)(((uint8_t)(x)) << ECAT_PHY_PORT_STATUS_PHY_PORT_STATSUS_BF4_SHIFT)) & ECAT_PHY_PORT_STATUS_PHY_PORT_STATSUS_BF4_MASK)

#define ECAT_PHY_PORT_STATUS_PHY_PORT_STATSUS_BF5_MASK (0x20U)
#define ECAT_PHY_PORT_STATUS_PHY_PORT_STATSUS_BF5_SHIFT (5U)
/*! BF5 - PHY configuration updated
 *  0b0..No update
 *  0b1..PHY configuration was updated
 */
#define ECAT_PHY_PORT_STATUS_PHY_PORT_STATSUS_BF5(x) (((uint8_t)(((uint8_t)(x)) << ECAT_PHY_PORT_STATUS_PHY_PORT_STATSUS_BF5_SHIFT)) & ECAT_PHY_PORT_STATUS_PHY_PORT_STATSUS_BF5_MASK)

#define ECAT_PHY_PORT_STATUS_PHY_PORT_STATSUS_BF6_MASK (0xC0U)
#define ECAT_PHY_PORT_STATUS_PHY_PORT_STATSUS_BF6_SHIFT (6U)
/*! BF6 - Reserved */
#define ECAT_PHY_PORT_STATUS_PHY_PORT_STATSUS_BF6(x) (((uint8_t)(((uint8_t)(x)) << ECAT_PHY_PORT_STATUS_PHY_PORT_STATSUS_BF6_SHIFT)) & ECAT_PHY_PORT_STATUS_PHY_PORT_STATSUS_BF6_MASK)
/*! @} */

/* The count of ECAT_PHY_PORT_STATUS_PHY_PORT_STATSUS */
#define ECAT_PHY_PORT_STATUS_PHY_PORT_STATSUS_COUNT (2U)

/*! @name FMMU_LOGICAL_START_ADDRESS - Register Logical Start address FMMU */
/*! @{ */

#define ECAT_FMMU_LOGICAL_START_ADDRESS_BF0_MASK (0xFFFFFFFFU)
#define ECAT_FMMU_LOGICAL_START_ADDRESS_BF0_SHIFT (0U)
/*! BF0 - Logical start address within the EtherCAT Address Space. */
#define ECAT_FMMU_LOGICAL_START_ADDRESS_BF0(x)   (((uint32_t)(((uint32_t)(x)) << ECAT_FMMU_LOGICAL_START_ADDRESS_BF0_SHIFT)) & ECAT_FMMU_LOGICAL_START_ADDRESS_BF0_MASK)
/*! @} */

/* The count of ECAT_FMMU_LOGICAL_START_ADDRESS */
#define ECAT_FMMU_LOGICAL_START_ADDRESS_COUNT    (8U)

/*! @name FMMU_LOGICAL_START_ADDRESS_PDI - Register Logical Start address FMMU */
/*! @{ */

#define ECAT_FMMU_LOGICAL_START_ADDRESS_PDI_BF0_MASK (0xFFFFFFFFU)
#define ECAT_FMMU_LOGICAL_START_ADDRESS_PDI_BF0_SHIFT (0U)
/*! BF0 - Logical start address within the EtherCAT Address Space. */
#define ECAT_FMMU_LOGICAL_START_ADDRESS_PDI_BF0(x) (((uint32_t)(((uint32_t)(x)) << ECAT_FMMU_LOGICAL_START_ADDRESS_PDI_BF0_SHIFT)) & ECAT_FMMU_LOGICAL_START_ADDRESS_PDI_BF0_MASK)
/*! @} */

/* The count of ECAT_FMMU_LOGICAL_START_ADDRESS_PDI */
#define ECAT_FMMU_LOGICAL_START_ADDRESS_PDI_COUNT (8U)

/*! @name FMMU_LENGTH - Register Length FMMU */
/*! @{ */

#define ECAT_FMMU_LENGTH_BF0_MASK                (0xFFFFU)
#define ECAT_FMMU_LENGTH_BF0_SHIFT               (0U)
/*! BF0 - Offset from the first logical FMMU byte to the last FMMU byte + 1 */
#define ECAT_FMMU_LENGTH_BF0(x)                  (((uint16_t)(((uint16_t)(x)) << ECAT_FMMU_LENGTH_BF0_SHIFT)) & ECAT_FMMU_LENGTH_BF0_MASK)
/*! @} */

/* The count of ECAT_FMMU_LENGTH */
#define ECAT_FMMU_LENGTH_COUNT                   (8U)

/*! @name FMMU_LENGTH_PDI - Register Length FMMU */
/*! @{ */

#define ECAT_FMMU_LENGTH_PDI_BF0_MASK            (0xFFFFU)
#define ECAT_FMMU_LENGTH_PDI_BF0_SHIFT           (0U)
/*! BF0 - Offset from the first logical FMMU byte to the last FMMU byte + 1 */
#define ECAT_FMMU_LENGTH_PDI_BF0(x)              (((uint16_t)(((uint16_t)(x)) << ECAT_FMMU_LENGTH_PDI_BF0_SHIFT)) & ECAT_FMMU_LENGTH_PDI_BF0_MASK)
/*! @} */

/* The count of ECAT_FMMU_LENGTH_PDI */
#define ECAT_FMMU_LENGTH_PDI_COUNT               (8U)

/*! @name FMMU_LOGICAL_START_BIT - Register Start bit FMMU y in logical address space */
/*! @{ */

#define ECAT_FMMU_LOGICAL_START_BIT_BF0_MASK     (0x7U)
#define ECAT_FMMU_LOGICAL_START_BIT_BF0_SHIFT    (0U)
/*! BF0 - Logical starting bit that shall be mapped (bits are counted from least significant bit 0 to most significant bit 7) */
#define ECAT_FMMU_LOGICAL_START_BIT_BF0(x)       (((uint8_t)(((uint8_t)(x)) << ECAT_FMMU_LOGICAL_START_BIT_BF0_SHIFT)) & ECAT_FMMU_LOGICAL_START_BIT_BF0_MASK)

#define ECAT_FMMU_LOGICAL_START_BIT_BF3_MASK     (0xF8U)
#define ECAT_FMMU_LOGICAL_START_BIT_BF3_SHIFT    (3U)
/*! BF3 - Reserved, write 0 */
#define ECAT_FMMU_LOGICAL_START_BIT_BF3(x)       (((uint8_t)(((uint8_t)(x)) << ECAT_FMMU_LOGICAL_START_BIT_BF3_SHIFT)) & ECAT_FMMU_LOGICAL_START_BIT_BF3_MASK)
/*! @} */

/* The count of ECAT_FMMU_LOGICAL_START_BIT */
#define ECAT_FMMU_LOGICAL_START_BIT_COUNT        (8U)

/*! @name FMMU_LOGICAL_START_BIT_PDI - Register Start bit FMMU y in logical address space */
/*! @{ */

#define ECAT_FMMU_LOGICAL_START_BIT_PDI_BF0_MASK (0x7U)
#define ECAT_FMMU_LOGICAL_START_BIT_PDI_BF0_SHIFT (0U)
/*! BF0 - Logical starting bit that shall be mapped (bits are counted from least significant bit 0 to most significant bit 7) */
#define ECAT_FMMU_LOGICAL_START_BIT_PDI_BF0(x)   (((uint8_t)(((uint8_t)(x)) << ECAT_FMMU_LOGICAL_START_BIT_PDI_BF0_SHIFT)) & ECAT_FMMU_LOGICAL_START_BIT_PDI_BF0_MASK)

#define ECAT_FMMU_LOGICAL_START_BIT_PDI_BF3_MASK (0xF8U)
#define ECAT_FMMU_LOGICAL_START_BIT_PDI_BF3_SHIFT (3U)
/*! BF3 - Reserved, write 0 */
#define ECAT_FMMU_LOGICAL_START_BIT_PDI_BF3(x)   (((uint8_t)(((uint8_t)(x)) << ECAT_FMMU_LOGICAL_START_BIT_PDI_BF3_SHIFT)) & ECAT_FMMU_LOGICAL_START_BIT_PDI_BF3_MASK)
/*! @} */

/* The count of ECAT_FMMU_LOGICAL_START_BIT_PDI */
#define ECAT_FMMU_LOGICAL_START_BIT_PDI_COUNT    (8U)

/*! @name FMMU_LOGICAL_STOP_BIT - Register Stop bit FMMU y in logical address space */
/*! @{ */

#define ECAT_FMMU_LOGICAL_STOP_BIT_BF0_MASK      (0x7U)
#define ECAT_FMMU_LOGICAL_STOP_BIT_BF0_SHIFT     (0U)
/*! BF0 - Last logical bit that shall be mapped (bits are counted from least significant bit 0 to most significant bit 7) */
#define ECAT_FMMU_LOGICAL_STOP_BIT_BF0(x)        (((uint8_t)(((uint8_t)(x)) << ECAT_FMMU_LOGICAL_STOP_BIT_BF0_SHIFT)) & ECAT_FMMU_LOGICAL_STOP_BIT_BF0_MASK)

#define ECAT_FMMU_LOGICAL_STOP_BIT_BF3_MASK      (0xF8U)
#define ECAT_FMMU_LOGICAL_STOP_BIT_BF3_SHIFT     (3U)
/*! BF3 - Reserved, write 0 */
#define ECAT_FMMU_LOGICAL_STOP_BIT_BF3(x)        (((uint8_t)(((uint8_t)(x)) << ECAT_FMMU_LOGICAL_STOP_BIT_BF3_SHIFT)) & ECAT_FMMU_LOGICAL_STOP_BIT_BF3_MASK)
/*! @} */

/* The count of ECAT_FMMU_LOGICAL_STOP_BIT */
#define ECAT_FMMU_LOGICAL_STOP_BIT_COUNT         (8U)

/*! @name FMMU_LOGICAL_STOP_BIT_PDI - Register Stop bit FMMU y in logical address space */
/*! @{ */

