JayHeng/imxrt-tool-flash-algo/boards/nxp_evkmimxrt1180_rev.c/flash_algo_c0_silicon/Keil_JLink/rom_api/MIMXRT1189_cm7.h
/* The count of ECAT_FMMU_TYPE_PDI */
#define ECAT_FMMU_TYPE_PDI_COUNT                 (8U)

/*! @name FMMU_ACTIVATE - Register Activate FMMU */
/*! @{ */

#define ECAT_FMMU_ACTIVATE_BF0_MASK              (0x1U)
#define ECAT_FMMU_ACTIVATE_BF0_SHIFT             (0U)
/*! BF0 - Bit field access for ECAT: r/w
 *  0b0..FMMU deactivated
 *  0b1..FMMU activated. FMMU checks logically addressed blocks to be mapped according to configured mapping
 */
#define ECAT_FMMU_ACTIVATE_BF0(x)                (((uint8_t)(((uint8_t)(x)) << ECAT_FMMU_ACTIVATE_BF0_SHIFT)) & ECAT_FMMU_ACTIVATE_BF0_MASK)

#define ECAT_FMMU_ACTIVATE_BF1_MASK              (0xFEU)
#define ECAT_FMMU_ACTIVATE_BF1_SHIFT             (1U)
/*! BF1 - Reserved, write 0 */
#define ECAT_FMMU_ACTIVATE_BF1(x)                (((uint8_t)(((uint8_t)(x)) << ECAT_FMMU_ACTIVATE_BF1_SHIFT)) & ECAT_FMMU_ACTIVATE_BF1_MASK)
/*! @} */

/* The count of ECAT_FMMU_ACTIVATE */
#define ECAT_FMMU_ACTIVATE_COUNT                 (8U)

/*! @name FMMU_ACTIVATE_PDI - Register Activate FMMU */
/*! @{ */

#define ECAT_FMMU_ACTIVATE_PDI_BF0_MASK          (0x1U)
#define ECAT_FMMU_ACTIVATE_PDI_BF0_SHIFT         (0U)
/*! BF0
 *  0b0..FMMU deactivated
 *  0b1..FMMU activated. FMMU checks logically addressed blocks to be mapped according to configured mapping
 */
#define ECAT_FMMU_ACTIVATE_PDI_BF0(x)            (((uint8_t)(((uint8_t)(x)) << ECAT_FMMU_ACTIVATE_PDI_BF0_SHIFT)) & ECAT_FMMU_ACTIVATE_PDI_BF0_MASK)

#define ECAT_FMMU_ACTIVATE_PDI_BF1_MASK          (0xFEU)
#define ECAT_FMMU_ACTIVATE_PDI_BF1_SHIFT         (1U)
/*! BF1 - Reserved, write 0 */
#define ECAT_FMMU_ACTIVATE_PDI_BF1(x)            (((uint8_t)(((uint8_t)(x)) << ECAT_FMMU_ACTIVATE_PDI_BF1_SHIFT)) & ECAT_FMMU_ACTIVATE_PDI_BF1_MASK)
/*! @} */

/* The count of ECAT_FMMU_ACTIVATE_PDI */
#define ECAT_FMMU_ACTIVATE_PDI_COUNT             (8U)

/*! @name SYNCMANAGER_PHYSICAL_START_ADDRESS - Register physical Start Address SyncManager */
/*! @{ */

#define ECAT_SYNCMANAGER_PHYSICAL_START_ADDRESS_BF0_MASK (0xFFFFU)
#define ECAT_SYNCMANAGER_PHYSICAL_START_ADDRESS_BF0_SHIFT (0U)
/*! BF0 - First byte that will be handled by SyncManager */
#define ECAT_SYNCMANAGER_PHYSICAL_START_ADDRESS_BF0(x) (((uint16_t)(((uint16_t)(x)) << ECAT_SYNCMANAGER_PHYSICAL_START_ADDRESS_BF0_SHIFT)) & ECAT_SYNCMANAGER_PHYSICAL_START_ADDRESS_BF0_MASK)
/*! @} */

/* The count of ECAT_SYNCMANAGER_PHYSICAL_START_ADDRESS */
#define ECAT_SYNCMANAGER_PHYSICAL_START_ADDRESS_COUNT (16U)

/*! @name SYNCMANAGER_PHYSICAL_START_ADDRESS_PDI - Register physical Start Address SyncManager */
/*! @{ */

#define ECAT_SYNCMANAGER_PHYSICAL_START_ADDRESS_PDI_BF0_MASK (0xFFFFU)
#define ECAT_SYNCMANAGER_PHYSICAL_START_ADDRESS_PDI_BF0_SHIFT (0U)
/*! BF0 - First byte that will be handled by SyncManager */
#define ECAT_SYNCMANAGER_PHYSICAL_START_ADDRESS_PDI_BF0(x) (((uint16_t)(((uint16_t)(x)) << ECAT_SYNCMANAGER_PHYSICAL_START_ADDRESS_PDI_BF0_SHIFT)) & ECAT_SYNCMANAGER_PHYSICAL_START_ADDRESS_PDI_BF0_MASK)
/*! @} */

/* The count of ECAT_SYNCMANAGER_PHYSICAL_START_ADDRESS_PDI */
#define ECAT_SYNCMANAGER_PHYSICAL_START_ADDRESS_PDI_COUNT (16U)

/*! @name SYNCMANAGER_LENGTH - Register Length SyncManager */
/*! @{ */

#define ECAT_SYNCMANAGER_LENGTH_BF0_MASK         (0xFFFFU)
#define ECAT_SYNCMANAGER_LENGTH_BF0_SHIFT        (0U)
/*! BF0 - Number of bytes assigned to SyncManager (shall be greater than 1 */
#define ECAT_SYNCMANAGER_LENGTH_BF0(x)           (((uint16_t)(((uint16_t)(x)) << ECAT_SYNCMANAGER_LENGTH_BF0_SHIFT)) & ECAT_SYNCMANAGER_LENGTH_BF0_MASK)
/*! @} */

/* The count of ECAT_SYNCMANAGER_LENGTH */
#define ECAT_SYNCMANAGER_LENGTH_COUNT            (16U)

/*! @name SYNCMANAGER_LENGTH_PDI - Register Length SyncManager */
/*! @{ */

#define ECAT_SYNCMANAGER_LENGTH_PDI_BF0_MASK     (0xFFFFU)
#define ECAT_SYNCMANAGER_LENGTH_PDI_BF0_SHIFT    (0U)
/*! BF0 - Number of bytes assigned to SyncManager (shall be greater than 1 */
#define ECAT_SYNCMANAGER_LENGTH_PDI_BF0(x)       (((uint16_t)(((uint16_t)(x)) << ECAT_SYNCMANAGER_LENGTH_PDI_BF0_SHIFT)) & ECAT_SYNCMANAGER_LENGTH_PDI_BF0_MASK)
/*! @} */

/* The count of ECAT_SYNCMANAGER_LENGTH_PDI */
#define ECAT_SYNCMANAGER_LENGTH_PDI_COUNT        (16U)

/*! @name SYNCMANAGER_CONTROL_REGISTER - Register Control Register SyncManager */
/*! @{ */

#define ECAT_SYNCMANAGER_CONTROL_REGISTER_BF0_MASK (0x3U)
#define ECAT_SYNCMANAGER_CONTROL_REGISTER_BF0_SHIFT (0U)
/*! BF0 - Operation Mode:
 *  0b00..Buffered (3 buffer mode)
 *  0b01..Reserved
 *  0b10..Mailbox (Single buffer mode)
 *  0b11..Reserved
 */
#define ECAT_SYNCMANAGER_CONTROL_REGISTER_BF0(x) (((uint8_t)(((uint8_t)(x)) << ECAT_SYNCMANAGER_CONTROL_REGISTER_BF0_SHIFT)) & ECAT_SYNCMANAGER_CONTROL_REGISTER_BF0_MASK)

#define ECAT_SYNCMANAGER_CONTROL_REGISTER_BF2_MASK (0xCU)
#define ECAT_SYNCMANAGER_CONTROL_REGISTER_BF2_SHIFT (2U)
/*! BF2 - Direction:
 *  0b00..Read: ECAT read access, PDI write access.
 *  0b01..Write: ECAT write access, PDI read access.
 *  0b10..Reserved
 *  0b11..Reserved
 */
#define ECAT_SYNCMANAGER_CONTROL_REGISTER_BF2(x) (((uint8_t)(((uint8_t)(x)) << ECAT_SYNCMANAGER_CONTROL_REGISTER_BF2_SHIFT)) & ECAT_SYNCMANAGER_CONTROL_REGISTER_BF2_MASK)

#define ECAT_SYNCMANAGER_CONTROL_REGISTER_BF4_MASK (0x10U)
#define ECAT_SYNCMANAGER_CONTROL_REGISTER_BF4_SHIFT (4U)
/*! BF4 - Interrupt in ECAT Event Request Register:
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define ECAT_SYNCMANAGER_CONTROL_REGISTER_BF4(x) (((uint8_t)(((uint8_t)(x)) << ECAT_SYNCMANAGER_CONTROL_REGISTER_BF4_SHIFT)) & ECAT_SYNCMANAGER_CONTROL_REGISTER_BF4_MASK)

#define ECAT_SYNCMANAGER_CONTROL_REGISTER_BF5_MASK (0x20U)
#define ECAT_SYNCMANAGER_CONTROL_REGISTER_BF5_SHIFT (5U)
/*! BF5 - Interrupt in AL Event Request Register:
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define ECAT_SYNCMANAGER_CONTROL_REGISTER_BF5(x) (((uint8_t)(((uint8_t)(x)) << ECAT_SYNCMANAGER_CONTROL_REGISTER_BF5_SHIFT)) & ECAT_SYNCMANAGER_CONTROL_REGISTER_BF5_MASK)

#define ECAT_SYNCMANAGER_CONTROL_REGISTER_BF6_MASK (0x40U)
#define ECAT_SYNCMANAGER_CONTROL_REGISTER_BF6_SHIFT (6U)
/*! BF6 - Watchdog Trigger Enable:
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define ECAT_SYNCMANAGER_CONTROL_REGISTER_BF6(x) (((uint8_t)(((uint8_t)(x)) << ECAT_SYNCMANAGER_CONTROL_REGISTER_BF6_SHIFT)) & ECAT_SYNCMANAGER_CONTROL_REGISTER_BF6_MASK)

#define ECAT_SYNCMANAGER_CONTROL_REGISTER_BF7_MASK (0x80U)
#define ECAT_SYNCMANAGER_CONTROL_REGISTER_BF7_SHIFT (7U)
/*! BF7 - Reserved, write 0 */
#define ECAT_SYNCMANAGER_CONTROL_REGISTER_BF7(x) (((uint8_t)(((uint8_t)(x)) << ECAT_SYNCMANAGER_CONTROL_REGISTER_BF7_SHIFT)) & ECAT_SYNCMANAGER_CONTROL_REGISTER_BF7_MASK)
/*! @} */

/* The count of ECAT_SYNCMANAGER_CONTROL_REGISTER */
#define ECAT_SYNCMANAGER_CONTROL_REGISTER_COUNT  (16U)

/*! @name SYNCMANAGER_CONTROL_REGISTER_PDI - Register Control Register SyncManager */
/*! @{ */

#define ECAT_SYNCMANAGER_CONTROL_REGISTER_PDI_BF0_MASK (0x3U)
#define ECAT_SYNCMANAGER_CONTROL_REGISTER_PDI_BF0_SHIFT (0U)
/*! BF0 - Operation Mode:
 *  0b00..Buffered (3 buffer mode)
 *  0b01..Reserved
 *  0b10..Mailbox (Single buffer mode)
 *  0b11..Reserved
 */
#define ECAT_SYNCMANAGER_CONTROL_REGISTER_PDI_BF0(x) (((uint8_t)(((uint8_t)(x)) << ECAT_SYNCMANAGER_CONTROL_REGISTER_PDI_BF0_SHIFT)) & ECAT_SYNCMANAGER_CONTROL_REGISTER_PDI_BF0_MASK)

#define ECAT_SYNCMANAGER_CONTROL_REGISTER_PDI_BF2_MASK (0xCU)
#define ECAT_SYNCMANAGER_CONTROL_REGISTER_PDI_BF2_SHIFT (2U)
/*! BF2 - Direction:
 *  0b00..Read: ECAT read access, PDI write access.
 *  0b01..Write: ECAT write access, PDI read access.
 *  0b10..Reserved
 *  0b11..Reserved
 */
#define ECAT_SYNCMANAGER_CONTROL_REGISTER_PDI_BF2(x) (((uint8_t)(((uint8_t)(x)) << ECAT_SYNCMANAGER_CONTROL_REGISTER_PDI_BF2_SHIFT)) & ECAT_SYNCMANAGER_CONTROL_REGISTER_PDI_BF2_MASK)

#define ECAT_SYNCMANAGER_CONTROL_REGISTER_PDI_BF4_MASK (0x10U)
#define ECAT_SYNCMANAGER_CONTROL_REGISTER_PDI_BF4_SHIFT (4U)
/*! BF4 - Interrupt in ECAT Event Request Register:
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define ECAT_SYNCMANAGER_CONTROL_REGISTER_PDI_BF4(x) (((uint8_t)(((uint8_t)(x)) << ECAT_SYNCMANAGER_CONTROL_REGISTER_PDI_BF4_SHIFT)) & ECAT_SYNCMANAGER_CONTROL_REGISTER_PDI_BF4_MASK)

#define ECAT_SYNCMANAGER_CONTROL_REGISTER_PDI_BF5_MASK (0x20U)
#define ECAT_SYNCMANAGER_CONTROL_REGISTER_PDI_BF5_SHIFT (5U)
/*! BF5 - Interrupt in AL Event Request Register:
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define ECAT_SYNCMANAGER_CONTROL_REGISTER_PDI_BF5(x) (((uint8_t)(((uint8_t)(x)) << ECAT_SYNCMANAGER_CONTROL_REGISTER_PDI_BF5_SHIFT)) & ECAT_SYNCMANAGER_CONTROL_REGISTER_PDI_BF5_MASK)

#define ECAT_SYNCMANAGER_CONTROL_REGISTER_PDI_BF6_MASK (0x40U)
#define ECAT_SYNCMANAGER_CONTROL_REGISTER_PDI_BF6_SHIFT (6U)
/*! BF6 - Watchdog Trigger Enable:
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define ECAT_SYNCMANAGER_CONTROL_REGISTER_PDI_BF6(x) (((uint8_t)(((uint8_t)(x)) << ECAT_SYNCMANAGER_CONTROL_REGISTER_PDI_BF6_SHIFT)) & ECAT_SYNCMANAGER_CONTROL_REGISTER_PDI_BF6_MASK)

#define ECAT_SYNCMANAGER_CONTROL_REGISTER_PDI_BF7_MASK (0x80U)
#define ECAT_SYNCMANAGER_CONTROL_REGISTER_PDI_BF7_SHIFT (7U)
/*! BF7 - Reserved, write 0 */
#define ECAT_SYNCMANAGER_CONTROL_REGISTER_PDI_BF7(x) (((uint8_t)(((uint8_t)(x)) << ECAT_SYNCMANAGER_CONTROL_REGISTER_PDI_BF7_SHIFT)) & ECAT_SYNCMANAGER_CONTROL_REGISTER_PDI_BF7_MASK)
/*! @} */

/* The count of ECAT_SYNCMANAGER_CONTROL_REGISTER_PDI */
#define ECAT_SYNCMANAGER_CONTROL_REGISTER_PDI_COUNT (16U)

/*! @name SYNCMANAGER_STATUS - Register Status Register SyncManager */
/*! @{ */

#define ECAT_SYNCMANAGER_STATUS_BF0_MASK         (0x1U)
#define ECAT_SYNCMANAGER_STATUS_BF0_SHIFT        (0U)
/*! BF0 - Interrupt Write:
 *  0b1..Interrupt after buffer was completely and successfully written
 *  0b0..Interrupt cleared after first byte of buffer was read
 */
#define ECAT_SYNCMANAGER_STATUS_BF0(x)           (((uint8_t)(((uint8_t)(x)) << ECAT_SYNCMANAGER_STATUS_BF0_SHIFT)) & ECAT_SYNCMANAGER_STATUS_BF0_MASK)

#define ECAT_SYNCMANAGER_STATUS_BF1_MASK         (0x2U)
#define ECAT_SYNCMANAGER_STATUS_BF1_SHIFT        (1U)
/*! BF1 - Interrupt Read:
 *  0b1..Interrupt after buffer was completely and successfully read
 *  0b0..Interrupt cleared after first byte of buffer was written
 */
#define ECAT_SYNCMANAGER_STATUS_BF1(x)           (((uint8_t)(((uint8_t)(x)) << ECAT_SYNCMANAGER_STATUS_BF1_SHIFT)) & ECAT_SYNCMANAGER_STATUS_BF1_MASK)

#define ECAT_SYNCMANAGER_STATUS_BF2_MASK         (0x4U)
#define ECAT_SYNCMANAGER_STATUS_BF2_SHIFT        (2U)
/*! BF2 - Reserved */
#define ECAT_SYNCMANAGER_STATUS_BF2(x)           (((uint8_t)(((uint8_t)(x)) << ECAT_SYNCMANAGER_STATUS_BF2_SHIFT)) & ECAT_SYNCMANAGER_STATUS_BF2_MASK)

#define ECAT_SYNCMANAGER_STATUS_BF3_MASK         (0x8U)
#define ECAT_SYNCMANAGER_STATUS_BF3_SHIFT        (3U)
/*! BF3 - Mailbox mode: mailbox status:
 *  0b0..Mailbox empty
 *  0b1..Mailbox full
 */
#define ECAT_SYNCMANAGER_STATUS_BF3(x)           (((uint8_t)(((uint8_t)(x)) << ECAT_SYNCMANAGER_STATUS_BF3_SHIFT)) & ECAT_SYNCMANAGER_STATUS_BF3_MASK)

