JayHeng/imxrt-tool-flash-algo/boards/nxp_evkmimxrt1180_rev.c/flash_algo_c0_silicon/Keil_JLink/rom_api/MIMXRT1189_cm7.h
#define ECAT_SYNCMANAGER_STATUS_BF4_MASK         (0x30U)
#define ECAT_SYNCMANAGER_STATUS_BF4_SHIFT        (4U)
/*! BF4 - Buffered mode: buffer status (last written buffer):
 *  0b00..1st buffer
 *  0b01..2nd buffer
 *  0b10..3rd buffer
 *  0b11..(no buffer written)
 */
#define ECAT_SYNCMANAGER_STATUS_BF4(x)           (((uint8_t)(((uint8_t)(x)) << ECAT_SYNCMANAGER_STATUS_BF4_SHIFT)) & ECAT_SYNCMANAGER_STATUS_BF4_MASK)

#define ECAT_SYNCMANAGER_STATUS_BF6_MASK         (0x40U)
#define ECAT_SYNCMANAGER_STATUS_BF6_SHIFT        (6U)
/*! BF6 - Read buffer in use (opened) */
#define ECAT_SYNCMANAGER_STATUS_BF6(x)           (((uint8_t)(((uint8_t)(x)) << ECAT_SYNCMANAGER_STATUS_BF6_SHIFT)) & ECAT_SYNCMANAGER_STATUS_BF6_MASK)

#define ECAT_SYNCMANAGER_STATUS_BF7_MASK         (0x80U)
#define ECAT_SYNCMANAGER_STATUS_BF7_SHIFT        (7U)
/*! BF7 - Write buffer in use (opened) */
#define ECAT_SYNCMANAGER_STATUS_BF7(x)           (((uint8_t)(((uint8_t)(x)) << ECAT_SYNCMANAGER_STATUS_BF7_SHIFT)) & ECAT_SYNCMANAGER_STATUS_BF7_MASK)
/*! @} */

/* The count of ECAT_SYNCMANAGER_STATUS */
#define ECAT_SYNCMANAGER_STATUS_COUNT            (16U)

/*! @name SYNCMANAGER_ACTIVATE - Register Activate SyncManager */
/*! @{ */

#define ECAT_SYNCMANAGER_ACTIVATE_BF0_MASK       (0x1U)
#define ECAT_SYNCMANAGER_ACTIVATE_BF0_SHIFT      (0U)
/*! BF0 - SyncManager Enable/Disable:
 *  0b0..Disable: Access to Memory without SyncManager control
 *  0b1..Enable: SyncManager is active and controls Memory area set in configuration
 */
#define ECAT_SYNCMANAGER_ACTIVATE_BF0(x)         (((uint8_t)(((uint8_t)(x)) << ECAT_SYNCMANAGER_ACTIVATE_BF0_SHIFT)) & ECAT_SYNCMANAGER_ACTIVATE_BF0_MASK)

#define ECAT_SYNCMANAGER_ACTIVATE_BF1_MASK       (0x2U)
#define ECAT_SYNCMANAGER_ACTIVATE_BF1_SHIFT      (1U)
/*! BF1 - Repeat Request: */
#define ECAT_SYNCMANAGER_ACTIVATE_BF1(x)         (((uint8_t)(((uint8_t)(x)) << ECAT_SYNCMANAGER_ACTIVATE_BF1_SHIFT)) & ECAT_SYNCMANAGER_ACTIVATE_BF1_MASK)

#define ECAT_SYNCMANAGER_ACTIVATE_BF2_MASK       (0x3CU)
#define ECAT_SYNCMANAGER_ACTIVATE_BF2_SHIFT      (2U)
/*! BF2 - Reserved, write 0 */
#define ECAT_SYNCMANAGER_ACTIVATE_BF2(x)         (((uint8_t)(((uint8_t)(x)) << ECAT_SYNCMANAGER_ACTIVATE_BF2_SHIFT)) & ECAT_SYNCMANAGER_ACTIVATE_BF2_MASK)

#define ECAT_SYNCMANAGER_ACTIVATE_BF6_MASK       (0x40U)
#define ECAT_SYNCMANAGER_ACTIVATE_BF6_SHIFT      (6U)
/*! BF6 - Latch Event ECAT:
 *  0b0..No
 *  0b1..Generate Latch event when EtherCAT master issues a buffer exchange
 */
#define ECAT_SYNCMANAGER_ACTIVATE_BF6(x)         (((uint8_t)(((uint8_t)(x)) << ECAT_SYNCMANAGER_ACTIVATE_BF6_SHIFT)) & ECAT_SYNCMANAGER_ACTIVATE_BF6_MASK)

#define ECAT_SYNCMANAGER_ACTIVATE_BF7_MASK       (0x80U)
#define ECAT_SYNCMANAGER_ACTIVATE_BF7_SHIFT      (7U)
/*! BF7 - Latch Event PDI:
 *  0b0..No
 *  0b1..Generate Latch events when PDI issues a buffer exchange or when PDI accesses buffer start address
 */
#define ECAT_SYNCMANAGER_ACTIVATE_BF7(x)         (((uint8_t)(((uint8_t)(x)) << ECAT_SYNCMANAGER_ACTIVATE_BF7_SHIFT)) & ECAT_SYNCMANAGER_ACTIVATE_BF7_MASK)
/*! @} */

/* The count of ECAT_SYNCMANAGER_ACTIVATE */
#define ECAT_SYNCMANAGER_ACTIVATE_COUNT          (16U)

/*! @name SYNCMANAGER_ACTIVATE_PDI - Register Activate SyncManager */
/*! @{ */

#define ECAT_SYNCMANAGER_ACTIVATE_PDI_BF0_MASK   (0x1U)
#define ECAT_SYNCMANAGER_ACTIVATE_PDI_BF0_SHIFT  (0U)
/*! BF0 - SyncManager Enable/Disable:
 *  0b0..Disable: Access to Memory without SyncManager control
 *  0b1..Enable: SyncManager is active and controls Memory area set in configuration
 */
#define ECAT_SYNCMANAGER_ACTIVATE_PDI_BF0(x)     (((uint8_t)(((uint8_t)(x)) << ECAT_SYNCMANAGER_ACTIVATE_PDI_BF0_SHIFT)) & ECAT_SYNCMANAGER_ACTIVATE_PDI_BF0_MASK)

#define ECAT_SYNCMANAGER_ACTIVATE_PDI_BF1_MASK   (0x2U)
#define ECAT_SYNCMANAGER_ACTIVATE_PDI_BF1_SHIFT  (1U)
/*! BF1 - Repeat Request: */
#define ECAT_SYNCMANAGER_ACTIVATE_PDI_BF1(x)     (((uint8_t)(((uint8_t)(x)) << ECAT_SYNCMANAGER_ACTIVATE_PDI_BF1_SHIFT)) & ECAT_SYNCMANAGER_ACTIVATE_PDI_BF1_MASK)

#define ECAT_SYNCMANAGER_ACTIVATE_PDI_BF2_MASK   (0x3CU)
#define ECAT_SYNCMANAGER_ACTIVATE_PDI_BF2_SHIFT  (2U)
/*! BF2 - Reserved, write 0 */
#define ECAT_SYNCMANAGER_ACTIVATE_PDI_BF2(x)     (((uint8_t)(((uint8_t)(x)) << ECAT_SYNCMANAGER_ACTIVATE_PDI_BF2_SHIFT)) & ECAT_SYNCMANAGER_ACTIVATE_PDI_BF2_MASK)

#define ECAT_SYNCMANAGER_ACTIVATE_PDI_BF6_MASK   (0x40U)
#define ECAT_SYNCMANAGER_ACTIVATE_PDI_BF6_SHIFT  (6U)
/*! BF6 - Latch Event ECAT:
 *  0b0..No
 *  0b1..Generate Latch event when EtherCAT master issues a buffer exchange
 */
#define ECAT_SYNCMANAGER_ACTIVATE_PDI_BF6(x)     (((uint8_t)(((uint8_t)(x)) << ECAT_SYNCMANAGER_ACTIVATE_PDI_BF6_SHIFT)) & ECAT_SYNCMANAGER_ACTIVATE_PDI_BF6_MASK)

#define ECAT_SYNCMANAGER_ACTIVATE_PDI_BF7_MASK   (0x80U)
#define ECAT_SYNCMANAGER_ACTIVATE_PDI_BF7_SHIFT  (7U)
/*! BF7 - Latch Event PDI:
 *  0b0..No
 *  0b1..Generate Latch events when PDI issues a buffer exchange or when PDI accesses buffer start address
 */
#define ECAT_SYNCMANAGER_ACTIVATE_PDI_BF7(x)     (((uint8_t)(((uint8_t)(x)) << ECAT_SYNCMANAGER_ACTIVATE_PDI_BF7_SHIFT)) & ECAT_SYNCMANAGER_ACTIVATE_PDI_BF7_MASK)
/*! @} */

/* The count of ECAT_SYNCMANAGER_ACTIVATE_PDI */
#define ECAT_SYNCMANAGER_ACTIVATE_PDI_COUNT      (16U)

/*! @name SYNCMANAGER_PDI_CONTROL - Register PDI Control SyncManager */
/*! @{ */

#define ECAT_SYNCMANAGER_PDI_CONTROL_BF0_MASK    (0x1U)
#define ECAT_SYNCMANAGER_PDI_CONTROL_BF0_SHIFT   (0U)
/*! BF0 - Deactivate SyncManager: */
#define ECAT_SYNCMANAGER_PDI_CONTROL_BF0(x)      (((uint8_t)(((uint8_t)(x)) << ECAT_SYNCMANAGER_PDI_CONTROL_BF0_SHIFT)) & ECAT_SYNCMANAGER_PDI_CONTROL_BF0_MASK)

#define ECAT_SYNCMANAGER_PDI_CONTROL_BF1_MASK    (0x2U)
#define ECAT_SYNCMANAGER_PDI_CONTROL_BF1_SHIFT   (1U)
/*! BF1 - Repeat Ack: */
#define ECAT_SYNCMANAGER_PDI_CONTROL_BF1(x)      (((uint8_t)(((uint8_t)(x)) << ECAT_SYNCMANAGER_PDI_CONTROL_BF1_SHIFT)) & ECAT_SYNCMANAGER_PDI_CONTROL_BF1_MASK)

#define ECAT_SYNCMANAGER_PDI_CONTROL_BF2_MASK    (0xFCU)
#define ECAT_SYNCMANAGER_PDI_CONTROL_BF2_SHIFT   (2U)
/*! BF2 - Reserved, write 0 */
#define ECAT_SYNCMANAGER_PDI_CONTROL_BF2(x)      (((uint8_t)(((uint8_t)(x)) << ECAT_SYNCMANAGER_PDI_CONTROL_BF2_SHIFT)) & ECAT_SYNCMANAGER_PDI_CONTROL_BF2_MASK)
/*! @} */

/* The count of ECAT_SYNCMANAGER_PDI_CONTROL */
#define ECAT_SYNCMANAGER_PDI_CONTROL_COUNT       (16U)

