JayHeng/imxrt-tool-flash-algo/boards/nxp_evkmimxrt1180_rev.c/flash_algo_c0_silicon/Keil_JLink/rom_api/MIMXRT1189_cm7.h
/*! @name SYNCMANAGER_PDI_CONTROL_PDI - Register PDI Control SyncManager */
/*! @{ */

#define ECAT_SYNCMANAGER_PDI_CONTROL_PDI_BF0_MASK (0x1U)
#define ECAT_SYNCMANAGER_PDI_CONTROL_PDI_BF0_SHIFT (0U)
/*! BF0 - Deactivate SyncManager: */
#define ECAT_SYNCMANAGER_PDI_CONTROL_PDI_BF0(x)  (((uint8_t)(((uint8_t)(x)) << ECAT_SYNCMANAGER_PDI_CONTROL_PDI_BF0_SHIFT)) & ECAT_SYNCMANAGER_PDI_CONTROL_PDI_BF0_MASK)

#define ECAT_SYNCMANAGER_PDI_CONTROL_PDI_BF1_MASK (0x2U)
#define ECAT_SYNCMANAGER_PDI_CONTROL_PDI_BF1_SHIFT (1U)
/*! BF1 - Repeat Ack: */
#define ECAT_SYNCMANAGER_PDI_CONTROL_PDI_BF1(x)  (((uint8_t)(((uint8_t)(x)) << ECAT_SYNCMANAGER_PDI_CONTROL_PDI_BF1_SHIFT)) & ECAT_SYNCMANAGER_PDI_CONTROL_PDI_BF1_MASK)

#define ECAT_SYNCMANAGER_PDI_CONTROL_PDI_BF2_MASK (0xFCU)
#define ECAT_SYNCMANAGER_PDI_CONTROL_PDI_BF2_SHIFT (2U)
/*! BF2 - Reserved, write 0 */
#define ECAT_SYNCMANAGER_PDI_CONTROL_PDI_BF2(x)  (((uint8_t)(((uint8_t)(x)) << ECAT_SYNCMANAGER_PDI_CONTROL_PDI_BF2_SHIFT)) & ECAT_SYNCMANAGER_PDI_CONTROL_PDI_BF2_MASK)
/*! @} */

/* The count of ECAT_SYNCMANAGER_PDI_CONTROL_PDI */
#define ECAT_SYNCMANAGER_PDI_CONTROL_PDI_COUNT   (16U)

/*! @name RECEIVE_TIMES - Distributed Clocks Receive Times */
/*! @{ */

#define ECAT_RECEIVE_TIMES_BF0_MASK              (0xFFU)
#define ECAT_RECEIVE_TIMES_BF0_SHIFT             (0U)
/*! BF0 - Write */
#define ECAT_RECEIVE_TIMES_BF0(x)                (((uint32_t)(((uint32_t)(x)) << ECAT_RECEIVE_TIMES_BF0_SHIFT)) & ECAT_RECEIVE_TIMES_BF0_MASK)

#define ECAT_RECEIVE_TIMES_BF8_MASK              (0xFFFFFF00U)
#define ECAT_RECEIVE_TIMES_BF8_SHIFT             (8U)
/*! BF8 - Local time at the beginning of the last receive frame containing a write access to register 0x0900. */
#define ECAT_RECEIVE_TIMES_BF8(x)                (((uint32_t)(((uint32_t)(x)) << ECAT_RECEIVE_TIMES_BF8_SHIFT)) & ECAT_RECEIVE_TIMES_BF8_MASK)
/*! @} */

/*! @name RECEIVE_TIMES_PDI - Distributed Clocks Receive Times */
/*! @{ */

#define ECAT_RECEIVE_TIMES_PDI_BF0_MASK          (0xFFU)
#define ECAT_RECEIVE_TIMES_PDI_BF0_SHIFT         (0U)
/*! BF0 - Write */
#define ECAT_RECEIVE_TIMES_PDI_BF0(x)            (((uint32_t)(((uint32_t)(x)) << ECAT_RECEIVE_TIMES_PDI_BF0_SHIFT)) & ECAT_RECEIVE_TIMES_PDI_BF0_MASK)

#define ECAT_RECEIVE_TIMES_PDI_BF8_MASK          (0xFFFFFF00U)
#define ECAT_RECEIVE_TIMES_PDI_BF8_SHIFT         (8U)
/*! BF8 - Local time at the beginning of the last receive frame containing a write access to register 0x0900. */
#define ECAT_RECEIVE_TIMES_PDI_BF8(x)            (((uint32_t)(((uint32_t)(x)) << ECAT_RECEIVE_TIMES_PDI_BF8_SHIFT)) & ECAT_RECEIVE_TIMES_PDI_BF8_MASK)
/*! @} */

/*! @name RECEIVE_TIME_PORT_1 - Distributed Clocks Receive Time Port 1 */
/*! @{ */

#define ECAT_RECEIVE_TIME_PORT_1_BF0_MASK        (0xFFFFFFFFU)
#define ECAT_RECEIVE_TIME_PORT_1_BF0_SHIFT       (0U)
/*! BF0 - Local time at the beginning of a frame (start first bit of preamble) received at port 1
 *    containing a BWR or FPWR to register 0x0900.
 */
#define ECAT_RECEIVE_TIME_PORT_1_BF0(x)          (((uint32_t)(((uint32_t)(x)) << ECAT_RECEIVE_TIME_PORT_1_BF0_SHIFT)) & ECAT_RECEIVE_TIME_PORT_1_BF0_MASK)
/*! @} */

/*! @name SYSTEM_TIME - Register System Time */
/*! @{ */

#define ECAT_SYSTEM_TIME_BF0ECAT_MASK            (0xFFFFFFFFFFFFFFFFU)
#define ECAT_SYSTEM_TIME_BF0ECAT_SHIFT           (0U)
/*! BF0ECAT - ECAT read access */
#define ECAT_SYSTEM_TIME_BF0ECAT(x)              (((uint64_t)(((uint64_t)(x)) << ECAT_SYSTEM_TIME_BF0ECAT_SHIFT)) & ECAT_SYSTEM_TIME_BF0ECAT_MASK)
/*! @} */

/*! @name SYSTEM_TIME_PDI - Register System Time */
/*! @{ */

#define ECAT_SYSTEM_TIME_PDI_BF0ECAT_MASK        (0xFFFFFFFFFFFFFFFFU)
#define ECAT_SYSTEM_TIME_PDI_BF0ECAT_SHIFT       (0U)
/*! BF0ECAT - PDI read access */
#define ECAT_SYSTEM_TIME_PDI_BF0ECAT(x)          (((uint64_t)(((uint64_t)(x)) << ECAT_SYSTEM_TIME_PDI_BF0ECAT_SHIFT)) & ECAT_SYSTEM_TIME_PDI_BF0ECAT_MASK)
/*! @} */

/*! @name RECEIVE_TIME_ECAT_PROCESSING_UNIT - Distributed Clocks Register Receive Time ECAT Processing Unit */
/*! @{ */

#define ECAT_RECEIVE_TIME_ECAT_PROCESSING_UNIT_BF0_MASK (0xFFFFFFFFFFFFFFFFU)
#define ECAT_RECEIVE_TIME_ECAT_PROCESSING_UNIT_BF0_SHIFT (0U)
/*! BF0 - Local time at the beginning of a frame (start first bit of preamble) received at the ECAT
 *    Processing Unit containing a write access to register 0x0900
 */
#define ECAT_RECEIVE_TIME_ECAT_PROCESSING_UNIT_BF0(x) (((uint64_t)(((uint64_t)(x)) << ECAT_RECEIVE_TIME_ECAT_PROCESSING_UNIT_BF0_SHIFT)) & ECAT_RECEIVE_TIME_ECAT_PROCESSING_UNIT_BF0_MASK)
/*! @} */

/*! @name SYSTEM_TIME_OFFSET - Register System Time Offset */
/*! @{ */

#define ECAT_SYSTEM_TIME_OFFSET_BF0_MASK         (0xFFFFFFFFFFFFFFFFU)
#define ECAT_SYSTEM_TIME_OFFSET_BF0_SHIFT        (0U)
/*! BF0 - Difference between local time and System Time. Offset is added to the local time. */
#define ECAT_SYSTEM_TIME_OFFSET_BF0(x)           (((uint64_t)(((uint64_t)(x)) << ECAT_SYSTEM_TIME_OFFSET_BF0_SHIFT)) & ECAT_SYSTEM_TIME_OFFSET_BF0_MASK)
/*! @} */

/*! @name SYSTEM_TIME_DELAY - Register System Time Delay */
/*! @{ */

#define ECAT_SYSTEM_TIME_DELAY_BF0_MASK          (0xFFFFFFFFU)
#define ECAT_SYSTEM_TIME_DELAY_BF0_SHIFT         (0U)
/*! BF0 - Delay between Reference Clock and the eCAT */
#define ECAT_SYSTEM_TIME_DELAY_BF0(x)            (((uint32_t)(((uint32_t)(x)) << ECAT_SYSTEM_TIME_DELAY_BF0_SHIFT)) & ECAT_SYSTEM_TIME_DELAY_BF0_MASK)
/*! @} */

/*! @name SYSTEM_TIME_DIFFERENCE - Register System Time Difference */
/*! @{ */

#define ECAT_SYSTEM_TIME_DIFFERENCE_BF0_MASK     (0x7FFFFFFFU)
#define ECAT_SYSTEM_TIME_DIFFERENCE_BF0_SHIFT    (0U)
/*! BF0 - Mean difference between local copy of system Time and received System Time values */
#define ECAT_SYSTEM_TIME_DIFFERENCE_BF0(x)       (((uint32_t)(((uint32_t)(x)) << ECAT_SYSTEM_TIME_DIFFERENCE_BF0_SHIFT)) & ECAT_SYSTEM_TIME_DIFFERENCE_BF0_MASK)

#define ECAT_SYSTEM_TIME_DIFFERENCE_BF31_MASK    (0x80000000U)
#define ECAT_SYSTEM_TIME_DIFFERENCE_BF31_SHIFT   (31U)
/*! BF31 - Bit field access for ECAT: r/-
 *  0b0..Local copy of System Time less than received System Time
 *  0b1..Local copy of System Time greater than or equal to received System Time
 */
#define ECAT_SYSTEM_TIME_DIFFERENCE_BF31(x)      (((uint32_t)(((uint32_t)(x)) << ECAT_SYSTEM_TIME_DIFFERENCE_BF31_SHIFT)) & ECAT_SYSTEM_TIME_DIFFERENCE_BF31_MASK)
/*! @} */

