JayHeng/imxrt-tool-flash-algo/boards/nxp_evkmimxrt1180_rev.c/flash_algo_c0_silicon/Keil_JLink/rom_api/MIMXRT1189_cm7.h
#define ENETC_PCI_TYPE0_PCI_CFC_PCIPM_CAP_PME_SUPPORT_MASK (0xF800U)
#define ENETC_PCI_TYPE0_PCI_CFC_PCIPM_CAP_PME_SUPPORT_SHIFT (11U)
#define ENETC_PCI_TYPE0_PCI_CFC_PCIPM_CAP_PME_SUPPORT(x) (((uint16_t)(((uint16_t)(x)) << ENETC_PCI_TYPE0_PCI_CFC_PCIPM_CAP_PME_SUPPORT_SHIFT)) & ENETC_PCI_TYPE0_PCI_CFC_PCIPM_CAP_PME_SUPPORT_MASK)
/*! @} */

/*! @name PCI_CFC_PCIPM_CTL_STAT - PCI PCI-PM control and status register */
/*! @{ */

#define ENETC_PCI_TYPE0_PCI_CFC_PCIPM_CTL_STAT_PWR_STATE_MASK (0x3U)
#define ENETC_PCI_TYPE0_PCI_CFC_PCIPM_CTL_STAT_PWR_STATE_SHIFT (0U)
#define ENETC_PCI_TYPE0_PCI_CFC_PCIPM_CTL_STAT_PWR_STATE(x) (((uint16_t)(((uint16_t)(x)) << ENETC_PCI_TYPE0_PCI_CFC_PCIPM_CTL_STAT_PWR_STATE_SHIFT)) & ENETC_PCI_TYPE0_PCI_CFC_PCIPM_CTL_STAT_PWR_STATE_MASK)

#define ENETC_PCI_TYPE0_PCI_CFC_PCIPM_CTL_STAT_NO_SOFT_RST_MASK (0x8U)
#define ENETC_PCI_TYPE0_PCI_CFC_PCIPM_CTL_STAT_NO_SOFT_RST_SHIFT (3U)
#define ENETC_PCI_TYPE0_PCI_CFC_PCIPM_CTL_STAT_NO_SOFT_RST(x) (((uint16_t)(((uint16_t)(x)) << ENETC_PCI_TYPE0_PCI_CFC_PCIPM_CTL_STAT_NO_SOFT_RST_SHIFT)) & ENETC_PCI_TYPE0_PCI_CFC_PCIPM_CTL_STAT_NO_SOFT_RST_MASK)

#define ENETC_PCI_TYPE0_PCI_CFC_PCIPM_CTL_STAT_PME_EN_MASK (0x100U)
#define ENETC_PCI_TYPE0_PCI_CFC_PCIPM_CTL_STAT_PME_EN_SHIFT (8U)
#define ENETC_PCI_TYPE0_PCI_CFC_PCIPM_CTL_STAT_PME_EN(x) (((uint16_t)(((uint16_t)(x)) << ENETC_PCI_TYPE0_PCI_CFC_PCIPM_CTL_STAT_PME_EN_SHIFT)) & ENETC_PCI_TYPE0_PCI_CFC_PCIPM_CTL_STAT_PME_EN_MASK)

#define ENETC_PCI_TYPE0_PCI_CFC_PCIPM_CTL_STAT_PME_STATUS_MASK (0x8000U)
#define ENETC_PCI_TYPE0_PCI_CFC_PCIPM_CTL_STAT_PME_STATUS_SHIFT (15U)
#define ENETC_PCI_TYPE0_PCI_CFC_PCIPM_CTL_STAT_PME_STATUS(x) (((uint16_t)(((uint16_t)(x)) << ENETC_PCI_TYPE0_PCI_CFC_PCIPM_CTL_STAT_PME_STATUS_SHIFT)) & ENETC_PCI_TYPE0_PCI_CFC_PCIPM_CTL_STAT_PME_STATUS_MASK)
/*! @} */

/*! @name PCI_CFC_EA_CAP_LIST - PCI EA capabilities list register */
/*! @{ */

#define ENETC_PCI_TYPE0_PCI_CFC_EA_CAP_LIST_CAP_ID_MASK (0xFFU)
#define ENETC_PCI_TYPE0_PCI_CFC_EA_CAP_LIST_CAP_ID_SHIFT (0U)
#define ENETC_PCI_TYPE0_PCI_CFC_EA_CAP_LIST_CAP_ID(x) (((uint16_t)(((uint16_t)(x)) << ENETC_PCI_TYPE0_PCI_CFC_EA_CAP_LIST_CAP_ID_SHIFT)) & ENETC_PCI_TYPE0_PCI_CFC_EA_CAP_LIST_CAP_ID_MASK)

#define ENETC_PCI_TYPE0_PCI_CFC_EA_CAP_LIST_NEXT_CAP_PTR_MASK (0xFF00U)
#define ENETC_PCI_TYPE0_PCI_CFC_EA_CAP_LIST_NEXT_CAP_PTR_SHIFT (8U)
#define ENETC_PCI_TYPE0_PCI_CFC_EA_CAP_LIST_NEXT_CAP_PTR(x) (((uint16_t)(((uint16_t)(x)) << ENETC_PCI_TYPE0_PCI_CFC_EA_CAP_LIST_NEXT_CAP_PTR_SHIFT)) & ENETC_PCI_TYPE0_PCI_CFC_EA_CAP_LIST_NEXT_CAP_PTR_MASK)
/*! @} */

/*! @name PCI_CFC_EA_CAP - PCI EA capabilities register */
/*! @{ */

#define ENETC_PCI_TYPE0_PCI_CFC_EA_CAP_NUM_ENTRIES_MASK (0x3FU)
#define ENETC_PCI_TYPE0_PCI_CFC_EA_CAP_NUM_ENTRIES_SHIFT (0U)
#define ENETC_PCI_TYPE0_PCI_CFC_EA_CAP_NUM_ENTRIES(x) (((uint16_t)(((uint16_t)(x)) << ENETC_PCI_TYPE0_PCI_CFC_EA_CAP_NUM_ENTRIES_SHIFT)) & ENETC_PCI_TYPE0_PCI_CFC_EA_CAP_NUM_ENTRIES_MASK)
/*! @} */

/*! @name PCI_CFC_EA_PE_FMT - PCI EA per-entry 0 format register..PCI EA per-entry 3 format register */
/*! @{ */

#define ENETC_PCI_TYPE0_PCI_CFC_EA_PE_FMT_ENTRY_SIZE_MASK (0x7U)
#define ENETC_PCI_TYPE0_PCI_CFC_EA_PE_FMT_ENTRY_SIZE_SHIFT (0U)
#define ENETC_PCI_TYPE0_PCI_CFC_EA_PE_FMT_ENTRY_SIZE(x) (((uint32_t)(((uint32_t)(x)) << ENETC_PCI_TYPE0_PCI_CFC_EA_PE_FMT_ENTRY_SIZE_SHIFT)) & ENETC_PCI_TYPE0_PCI_CFC_EA_PE_FMT_ENTRY_SIZE_MASK)

#define ENETC_PCI_TYPE0_PCI_CFC_EA_PE_FMT_BEI_MASK (0xF0U)
#define ENETC_PCI_TYPE0_PCI_CFC_EA_PE_FMT_BEI_SHIFT (4U)
#define ENETC_PCI_TYPE0_PCI_CFC_EA_PE_FMT_BEI(x) (((uint32_t)(((uint32_t)(x)) << ENETC_PCI_TYPE0_PCI_CFC_EA_PE_FMT_BEI_SHIFT)) & ENETC_PCI_TYPE0_PCI_CFC_EA_PE_FMT_BEI_MASK)

#define ENETC_PCI_TYPE0_PCI_CFC_EA_PE_FMT_PRIM_PROP_MASK (0xFF00U)
#define ENETC_PCI_TYPE0_PCI_CFC_EA_PE_FMT_PRIM_PROP_SHIFT (8U)
#define ENETC_PCI_TYPE0_PCI_CFC_EA_PE_FMT_PRIM_PROP(x) (((uint32_t)(((uint32_t)(x)) << ENETC_PCI_TYPE0_PCI_CFC_EA_PE_FMT_PRIM_PROP_SHIFT)) & ENETC_PCI_TYPE0_PCI_CFC_EA_PE_FMT_PRIM_PROP_MASK)

#define ENETC_PCI_TYPE0_PCI_CFC_EA_PE_FMT_SEC_PROP_MASK (0xFF0000U)
#define ENETC_PCI_TYPE0_PCI_CFC_EA_PE_FMT_SEC_PROP_SHIFT (16U)
#define ENETC_PCI_TYPE0_PCI_CFC_EA_PE_FMT_SEC_PROP(x) (((uint32_t)(((uint32_t)(x)) << ENETC_PCI_TYPE0_PCI_CFC_EA_PE_FMT_SEC_PROP_SHIFT)) & ENETC_PCI_TYPE0_PCI_CFC_EA_PE_FMT_SEC_PROP_MASK)

#define ENETC_PCI_TYPE0_PCI_CFC_EA_PE_FMT_WRITABLE_MASK (0x40000000U)
#define ENETC_PCI_TYPE0_PCI_CFC_EA_PE_FMT_WRITABLE_SHIFT (30U)
#define ENETC_PCI_TYPE0_PCI_CFC_EA_PE_FMT_WRITABLE(x) (((uint32_t)(((uint32_t)(x)) << ENETC_PCI_TYPE0_PCI_CFC_EA_PE_FMT_WRITABLE_SHIFT)) & ENETC_PCI_TYPE0_PCI_CFC_EA_PE_FMT_WRITABLE_MASK)

#define ENETC_PCI_TYPE0_PCI_CFC_EA_PE_FMT_ENABLE_MASK (0x80000000U)
#define ENETC_PCI_TYPE0_PCI_CFC_EA_PE_FMT_ENABLE_SHIFT (31U)
#define ENETC_PCI_TYPE0_PCI_CFC_EA_PE_FMT_ENABLE(x) (((uint32_t)(((uint32_t)(x)) << ENETC_PCI_TYPE0_PCI_CFC_EA_PE_FMT_ENABLE_SHIFT)) & ENETC_PCI_TYPE0_PCI_CFC_EA_PE_FMT_ENABLE_MASK)
/*! @} */

/* The count of ENETC_PCI_TYPE0_PCI_CFC_EA_PE_FMT */
#define ENETC_PCI_TYPE0_PCI_CFC_EA_PE_FMT_COUNT  (4U)

/*! @name PCI_CFC_EA_PE_BASE - PCI EA per-entry 0 base register..PCI EA per-entry 3 base register */
/*! @{ */

#define ENETC_PCI_TYPE0_PCI_CFC_EA_PE_BASE_S_MASK (0x2U)
#define ENETC_PCI_TYPE0_PCI_CFC_EA_PE_BASE_S_SHIFT (1U)
#define ENETC_PCI_TYPE0_PCI_CFC_EA_PE_BASE_S(x)  (((uint32_t)(((uint32_t)(x)) << ENETC_PCI_TYPE0_PCI_CFC_EA_PE_BASE_S_SHIFT)) & ENETC_PCI_TYPE0_PCI_CFC_EA_PE_BASE_S_MASK)

#define ENETC_PCI_TYPE0_PCI_CFC_EA_PE_BASE_BASE_MASK (0xFFFFFFFCU)
#define ENETC_PCI_TYPE0_PCI_CFC_EA_PE_BASE_BASE_SHIFT (2U)
#define ENETC_PCI_TYPE0_PCI_CFC_EA_PE_BASE_BASE(x) (((uint32_t)(((uint32_t)(x)) << ENETC_PCI_TYPE0_PCI_CFC_EA_PE_BASE_BASE_SHIFT)) & ENETC_PCI_TYPE0_PCI_CFC_EA_PE_BASE_BASE_MASK)
/*! @} */

/* The count of ENETC_PCI_TYPE0_PCI_CFC_EA_PE_BASE */
#define ENETC_PCI_TYPE0_PCI_CFC_EA_PE_BASE_COUNT (4U)

/*! @name PCI_CFC_EA_PE_MAXOFF - PCI EA per-entry 0 max offset register..PCI EA per-entry 3 max offset register */
/*! @{ */

#define ENETC_PCI_TYPE0_PCI_CFC_EA_PE_MAXOFF_S_MASK (0x2U)
#define ENETC_PCI_TYPE0_PCI_CFC_EA_PE_MAXOFF_S_SHIFT (1U)
#define ENETC_PCI_TYPE0_PCI_CFC_EA_PE_MAXOFF_S(x) (((uint32_t)(((uint32_t)(x)) << ENETC_PCI_TYPE0_PCI_CFC_EA_PE_MAXOFF_S_SHIFT)) & ENETC_PCI_TYPE0_PCI_CFC_EA_PE_MAXOFF_S_MASK)

