JayHeng/imxrt-tool-flash-algo/boards/nxp_evkmimxrt1180_rev.c/flash_algo_c0_silicon/Keil_JLink/rom_api/MIMXRT1189_cm7.h
#define ENETC_PF_TMR_TMR_ALARM_CTRL_ALARM1_PW_MASK (0x1FU)
#define ENETC_PF_TMR_TMR_ALARM_CTRL_ALARM1_PW_SHIFT (0U)
/*! ALARM1_PW - ALARM 1 pulse width selector */
#define ENETC_PF_TMR_TMR_ALARM_CTRL_ALARM1_PW(x) (((uint32_t)(((uint32_t)(x)) << ENETC_PF_TMR_TMR_ALARM_CTRL_ALARM1_PW_SHIFT)) & ENETC_PF_TMR_TMR_ALARM_CTRL_ALARM1_PW_MASK)

#define ENETC_PF_TMR_TMR_ALARM_CTRL_PG1_MASK     (0x80U)
#define ENETC_PF_TMR_TMR_ALARM_CTRL_PG1_SHIFT    (7U)
/*! PG1 - Alarm1 pulse generation time */
#define ENETC_PF_TMR_TMR_ALARM_CTRL_PG1(x)       (((uint32_t)(((uint32_t)(x)) << ENETC_PF_TMR_TMR_ALARM_CTRL_PG1_SHIFT)) & ENETC_PF_TMR_TMR_ALARM_CTRL_PG1_MASK)

#define ENETC_PF_TMR_TMR_ALARM_CTRL_ALARM2_PW_MASK (0x1F00U)
#define ENETC_PF_TMR_TMR_ALARM_CTRL_ALARM2_PW_SHIFT (8U)
/*! ALARM2_PW - ALARM 2 pulse width selector */
#define ENETC_PF_TMR_TMR_ALARM_CTRL_ALARM2_PW(x) (((uint32_t)(((uint32_t)(x)) << ENETC_PF_TMR_TMR_ALARM_CTRL_ALARM2_PW_SHIFT)) & ENETC_PF_TMR_TMR_ALARM_CTRL_ALARM2_PW_MASK)

#define ENETC_PF_TMR_TMR_ALARM_CTRL_PG2_MASK     (0x8000U)
#define ENETC_PF_TMR_TMR_ALARM_CTRL_PG2_SHIFT    (15U)
/*! PG2 - Alarm2 pulse generation time */
#define ENETC_PF_TMR_TMR_ALARM_CTRL_PG2(x)       (((uint32_t)(((uint32_t)(x)) << ENETC_PF_TMR_TMR_ALARM_CTRL_PG2_SHIFT)) & ENETC_PF_TMR_TMR_ALARM_CTRL_PG2_MASK)
/*! @} */

/*! @name TMR_FIPER - Timer 1 fixed interval period register..Timer 3 fixed interval period register */
/*! @{ */

#define ENETC_PF_TMR_TMR_FIPER_FIPER_MASK        (0xFFFFFFFFU)
#define ENETC_PF_TMR_TMR_FIPER_FIPER_SHIFT       (0U)
/*! FIPER - Fixed interval pulse period register. */
#define ENETC_PF_TMR_TMR_FIPER_FIPER(x)          (((uint32_t)(((uint32_t)(x)) << ENETC_PF_TMR_TMR_FIPER_FIPER_SHIFT)) & ENETC_PF_TMR_TMR_FIPER_FIPER_MASK)
/*! @} */

/* The count of ENETC_PF_TMR_TMR_FIPER */
#define ENETC_PF_TMR_TMR_FIPER_COUNT             (3U)

/*! @name TMR_FIPER_CTRL - Timer FIPER Control Register */
/*! @{ */

#define ENETC_PF_TMR_TMR_FIPER_CTRL_FIPER1_PW_MASK (0x1FU)
#define ENETC_PF_TMR_TMR_FIPER_CTRL_FIPER1_PW_SHIFT (0U)
/*! FIPER1_PW - FIPER 1 pulse width selection */
#define ENETC_PF_TMR_TMR_FIPER_CTRL_FIPER1_PW(x) (((uint32_t)(((uint32_t)(x)) << ENETC_PF_TMR_TMR_FIPER_CTRL_FIPER1_PW_SHIFT)) & ENETC_PF_TMR_TMR_FIPER_CTRL_FIPER1_PW_MASK)

#define ENETC_PF_TMR_TMR_FIPER_CTRL_PG1_MASK     (0x40U)
#define ENETC_PF_TMR_TMR_FIPER_CTRL_PG1_SHIFT    (6U)
/*! PG1 - FIPER1 pulse generation select */
#define ENETC_PF_TMR_TMR_FIPER_CTRL_PG1(x)       (((uint32_t)(((uint32_t)(x)) << ENETC_PF_TMR_TMR_FIPER_CTRL_PG1_SHIFT)) & ENETC_PF_TMR_TMR_FIPER_CTRL_PG1_MASK)

#define ENETC_PF_TMR_TMR_FIPER_CTRL_FIPER1_DIS_MASK (0x80U)
#define ENETC_PF_TMR_TMR_FIPER_CTRL_FIPER1_DIS_SHIFT (7U)
/*! FIPER1_DIS - FIPER1 disable */
#define ENETC_PF_TMR_TMR_FIPER_CTRL_FIPER1_DIS(x) (((uint32_t)(((uint32_t)(x)) << ENETC_PF_TMR_TMR_FIPER_CTRL_FIPER1_DIS_SHIFT)) & ENETC_PF_TMR_TMR_FIPER_CTRL_FIPER1_DIS_MASK)

#define ENETC_PF_TMR_TMR_FIPER_CTRL_FIPER2_PW_MASK (0x1F00U)
#define ENETC_PF_TMR_TMR_FIPER_CTRL_FIPER2_PW_SHIFT (8U)
/*! FIPER2_PW - FIPER 2 pulse width selection */
#define ENETC_PF_TMR_TMR_FIPER_CTRL_FIPER2_PW(x) (((uint32_t)(((uint32_t)(x)) << ENETC_PF_TMR_TMR_FIPER_CTRL_FIPER2_PW_SHIFT)) & ENETC_PF_TMR_TMR_FIPER_CTRL_FIPER2_PW_MASK)

#define ENETC_PF_TMR_TMR_FIPER_CTRL_PG2_MASK     (0x4000U)
#define ENETC_PF_TMR_TMR_FIPER_CTRL_PG2_SHIFT    (14U)
/*! PG2 - FIPER2 pulse generation time */
#define ENETC_PF_TMR_TMR_FIPER_CTRL_PG2(x)       (((uint32_t)(((uint32_t)(x)) << ENETC_PF_TMR_TMR_FIPER_CTRL_PG2_SHIFT)) & ENETC_PF_TMR_TMR_FIPER_CTRL_PG2_MASK)

#define ENETC_PF_TMR_TMR_FIPER_CTRL_FIPER2_DIS_MASK (0x8000U)
#define ENETC_PF_TMR_TMR_FIPER_CTRL_FIPER2_DIS_SHIFT (15U)
/*! FIPER2_DIS - FIPER2 disable */
#define ENETC_PF_TMR_TMR_FIPER_CTRL_FIPER2_DIS(x) (((uint32_t)(((uint32_t)(x)) << ENETC_PF_TMR_TMR_FIPER_CTRL_FIPER2_DIS_SHIFT)) & ENETC_PF_TMR_TMR_FIPER_CTRL_FIPER2_DIS_MASK)

#define ENETC_PF_TMR_TMR_FIPER_CTRL_FIPER3_PW_MASK (0x1F0000U)
#define ENETC_PF_TMR_TMR_FIPER_CTRL_FIPER3_PW_SHIFT (16U)
/*! FIPER3_PW - FIPER 3 pulse width selection */
#define ENETC_PF_TMR_TMR_FIPER_CTRL_FIPER3_PW(x) (((uint32_t)(((uint32_t)(x)) << ENETC_PF_TMR_TMR_FIPER_CTRL_FIPER3_PW_SHIFT)) & ENETC_PF_TMR_TMR_FIPER_CTRL_FIPER3_PW_MASK)

#define ENETC_PF_TMR_TMR_FIPER_CTRL_PG3_MASK     (0x400000U)
#define ENETC_PF_TMR_TMR_FIPER_CTRL_PG3_SHIFT    (22U)
/*! PG3 - FIPER3 pulse generation time */
#define ENETC_PF_TMR_TMR_FIPER_CTRL_PG3(x)       (((uint32_t)(((uint32_t)(x)) << ENETC_PF_TMR_TMR_FIPER_CTRL_PG3_SHIFT)) & ENETC_PF_TMR_TMR_FIPER_CTRL_PG3_MASK)

#define ENETC_PF_TMR_TMR_FIPER_CTRL_FIPER3_DIS_MASK (0x800000U)
#define ENETC_PF_TMR_TMR_FIPER_CTRL_FIPER3_DIS_SHIFT (23U)
/*! FIPER3_DIS - FIPER3 disable */
#define ENETC_PF_TMR_TMR_FIPER_CTRL_FIPER3_DIS(x) (((uint32_t)(((uint32_t)(x)) << ENETC_PF_TMR_TMR_FIPER_CTRL_FIPER3_DIS_SHIFT)) & ENETC_PF_TMR_TMR_FIPER_CTRL_FIPER3_DIS_MASK)
/*! @} */

/*! @name TMR_ETTS1_L - External trigger stamp register */
/*! @{ */

#define ENETC_PF_TMR_TMR_ETTS1_L_ETTS_L_MASK     (0xFFFFFFFFU)
#define ENETC_PF_TMR_TMR_ETTS1_L_ETTS_L_SHIFT    (0U)
#define ENETC_PF_TMR_TMR_ETTS1_L_ETTS_L(x)       (((uint32_t)(((uint32_t)(x)) << ENETC_PF_TMR_TMR_ETTS1_L_ETTS_L_SHIFT)) & ENETC_PF_TMR_TMR_ETTS1_L_ETTS_L_MASK)
/*! @} */

/*! @name TMR_ETTS1_H - External trigger stamp register */
/*! @{ */

#define ENETC_PF_TMR_TMR_ETTS1_H_ETTS_H_MASK     (0xFFFFFFFFU)
#define ENETC_PF_TMR_TMR_ETTS1_H_ETTS_H_SHIFT    (0U)
#define ENETC_PF_TMR_TMR_ETTS1_H_ETTS_H(x)       (((uint32_t)(((uint32_t)(x)) << ENETC_PF_TMR_TMR_ETTS1_H_ETTS_H_SHIFT)) & ENETC_PF_TMR_TMR_ETTS1_H_ETTS_H_MASK)
/*! @} */

/*! @name TMR_ETTS2_L - External trigger stamp register */
/*! @{ */

#define ENETC_PF_TMR_TMR_ETTS2_L_ETTS_L_MASK     (0xFFFFFFFFU)
#define ENETC_PF_TMR_TMR_ETTS2_L_ETTS_L_SHIFT    (0U)
#define ENETC_PF_TMR_TMR_ETTS2_L_ETTS_L(x)       (((uint32_t)(((uint32_t)(x)) << ENETC_PF_TMR_TMR_ETTS2_L_ETTS_L_SHIFT)) & ENETC_PF_TMR_TMR_ETTS2_L_ETTS_L_MASK)
/*! @} */

/*! @name TMR_ETTS2_H - External trigger stamp register */
/*! @{ */

#define ENETC_PF_TMR_TMR_ETTS2_H_ETTS_H_MASK     (0xFFFFFFFFU)
#define ENETC_PF_TMR_TMR_ETTS2_H_ETTS_H_SHIFT    (0U)
#define ENETC_PF_TMR_TMR_ETTS2_H_ETTS_H(x)       (((uint32_t)(((uint32_t)(x)) << ENETC_PF_TMR_TMR_ETTS2_H_ETTS_H_SHIFT)) & ENETC_PF_TMR_TMR_ETTS2_H_ETTS_H_MASK)
/*! @} */

/*! @name TMR_CUR_TIME_L - Timer current time low register */
/*! @{ */

#define ENETC_PF_TMR_TMR_CUR_TIME_L_TMR_CUR_TIME_L_MASK (0xFFFFFFFFU)
#define ENETC_PF_TMR_TMR_CUR_TIME_L_TMR_CUR_TIME_L_SHIFT (0U)
#define ENETC_PF_TMR_TMR_CUR_TIME_L_TMR_CUR_TIME_L(x) (((uint32_t)(((uint32_t)(x)) << ENETC_PF_TMR_TMR_CUR_TIME_L_TMR_CUR_TIME_L_SHIFT)) & ENETC_PF_TMR_TMR_CUR_TIME_L_TMR_CUR_TIME_L_MASK)
/*! @} */

/*! @name TMR_CUR_TIME_H - Timer current time high register */
/*! @{ */

#define ENETC_PF_TMR_TMR_CUR_TIME_H_TMR_CUR_TIME_H_MASK (0xFFFFFFFFU)
#define ENETC_PF_TMR_TMR_CUR_TIME_H_TMR_CUR_TIME_H_SHIFT (0U)
#define ENETC_PF_TMR_TMR_CUR_TIME_H_TMR_CUR_TIME_H(x) (((uint32_t)(((uint32_t)(x)) << ENETC_PF_TMR_TMR_CUR_TIME_H_TMR_CUR_TIME_H_SHIFT)) & ENETC_PF_TMR_TMR_CUR_TIME_H_TMR_CUR_TIME_H_MASK)
/*! @} */

