JayHeng/imxrt-tool-flash-algo/boards/nxp_evkmimxrt1180_rev.c/flash_algo_c0_silicon/Keil_JLink/rom_api/MIMXRT1189_cm7.h
/*! @name SICBDRBAR1 - Station interface command BDR base address register 1 */
/*! @{ */

#define ENETC_SI_SICBDRBAR1_ADDRH_MASK           (0xFFFFFFFFU)
#define ENETC_SI_SICBDRBAR1_ADDRH_SHIFT          (0U)
#define ENETC_SI_SICBDRBAR1_ADDRH(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SICBDRBAR1_ADDRH_SHIFT)) & ENETC_SI_SICBDRBAR1_ADDRH_MASK)
/*! @} */

/*! @name SICBDRPIR - Station interface command BDR producer index register */
/*! @{ */

#define ENETC_SI_SICBDRPIR_BDR_INDEX_MASK        (0x3FFU)
#define ENETC_SI_SICBDRPIR_BDR_INDEX_SHIFT       (0U)
#define ENETC_SI_SICBDRPIR_BDR_INDEX(x)          (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SICBDRPIR_BDR_INDEX_SHIFT)) & ENETC_SI_SICBDRPIR_BDR_INDEX_MASK)
/*! @} */

/*! @name SICBDRCIR - Station interface command BDR consumer index register */
/*! @{ */

#define ENETC_SI_SICBDRCIR_BDR_INDEX_MASK        (0x3FFU)
#define ENETC_SI_SICBDRCIR_BDR_INDEX_SHIFT       (0U)
#define ENETC_SI_SICBDRCIR_BDR_INDEX(x)          (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SICBDRCIR_BDR_INDEX_SHIFT)) & ENETC_SI_SICBDRCIR_BDR_INDEX_MASK)
/*! @} */

/*! @name SICBDRLENR - Station interface command BDR length register */
/*! @{ */

#define ENETC_SI_SICBDRLENR_LENGTH_MASK          (0x7F8U)
#define ENETC_SI_SICBDRLENR_LENGTH_SHIFT         (3U)
#define ENETC_SI_SICBDRLENR_LENGTH(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SICBDRLENR_LENGTH_SHIFT)) & ENETC_SI_SICBDRLENR_LENGTH_MASK)
/*! @} */

/*! @name SICBDRIER - Station interface command BDR interrupt enable register */
/*! @{ */

#define ENETC_SI_SICBDRIER_CBDCIE_MASK           (0x1U)
#define ENETC_SI_SICBDRIER_CBDCIE_SHIFT          (0U)
#define ENETC_SI_SICBDRIER_CBDCIE(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SICBDRIER_CBDCIE_SHIFT)) & ENETC_SI_SICBDRIER_CBDCIE_MASK)
/*! @} */

/*! @name SICBDRIDR - Station interface command BDR interrupt detect register */
/*! @{ */

#define ENETC_SI_SICBDRIDR_CBDC_MASK             (0x1U)
#define ENETC_SI_SICBDRIDR_CBDC_SHIFT            (0U)
#define ENETC_SI_SICBDRIDR_CBDC(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SICBDRIDR_CBDC_SHIFT)) & ENETC_SI_SICBDRIDR_CBDC_MASK)
/*! @} */

/*! @name SICAPR0 - Station interface capability register 0 */
/*! @{ */

#define ENETC_SI_SICAPR0_NUM_TX_BDR_MASK         (0xFFU)
#define ENETC_SI_SICAPR0_NUM_TX_BDR_SHIFT        (0U)
#define ENETC_SI_SICAPR0_NUM_TX_BDR(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SICAPR0_NUM_TX_BDR_SHIFT)) & ENETC_SI_SICAPR0_NUM_TX_BDR_MASK)

#define ENETC_SI_SICAPR0_NUM_RX_BDR_MASK         (0xFF0000U)
#define ENETC_SI_SICAPR0_NUM_RX_BDR_SHIFT        (16U)
#define ENETC_SI_SICAPR0_NUM_RX_BDR(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SICAPR0_NUM_RX_BDR_SHIFT)) & ENETC_SI_SICAPR0_NUM_RX_BDR_MASK)

#define ENETC_SI_SICAPR0_NUM_MAC_ADDR_MASK       (0xF0000000U)
#define ENETC_SI_SICAPR0_NUM_MAC_ADDR_SHIFT      (28U)
#define ENETC_SI_SICAPR0_NUM_MAC_ADDR(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SICAPR0_NUM_MAC_ADDR_SHIFT)) & ENETC_SI_SICAPR0_NUM_MAC_ADDR_MASK)
/*! @} */

/*! @name SICAPR1 - Station interface capability register 1 */
/*! @{ */

#define ENETC_SI_SICAPR1_NUM_RX_GRP_MASK         (0xFF0000U)
#define ENETC_SI_SICAPR1_NUM_RX_GRP_SHIFT        (16U)
#define ENETC_SI_SICAPR1_NUM_RX_GRP(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SICAPR1_NUM_RX_GRP_SHIFT)) & ENETC_SI_SICAPR1_NUM_RX_GRP_MASK)
/*! @} */

/*! @name SICAPR2 - Station interface capability register 2 */
/*! @{ */

#define ENETC_SI_SICAPR2_VTP_MASK                (0xFU)
#define ENETC_SI_SICAPR2_VTP_SHIFT               (0U)
#define ENETC_SI_SICAPR2_VTP(x)                  (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SICAPR2_VTP_SHIFT)) & ENETC_SI_SICAPR2_VTP_MASK)
/*! @} */

/*! @name PSIIER - Physical station interface interrupt enable register */
/*! @{ */

#define ENETC_SI_PSIIER_MR1IE_MASK               (0x2U)
#define ENETC_SI_PSIIER_MR1IE_SHIFT              (1U)
#define ENETC_SI_PSIIER_MR1IE(x)                 (((uint32_t)(((uint32_t)(x)) << ENETC_SI_PSIIER_MR1IE_SHIFT)) & ENETC_SI_PSIIER_MR1IE_MASK)

#define ENETC_SI_PSIIER_FLR1IE_MASK              (0x20000U)
#define ENETC_SI_PSIIER_FLR1IE_SHIFT             (17U)
#define ENETC_SI_PSIIER_FLR1IE(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_SI_PSIIER_FLR1IE_SHIFT)) & ENETC_SI_PSIIER_FLR1IE_MASK)
/*! @} */

/*! @name PSIIDR - Physical station interface interrupt detect register */
/*! @{ */

#define ENETC_SI_PSIIDR_TXR_MASK                 (0x1U)
#define ENETC_SI_PSIIDR_TXR_SHIFT                (0U)
#define ENETC_SI_PSIIDR_TXR(x)                   (((uint32_t)(((uint32_t)(x)) << ENETC_SI_PSIIDR_TXR_SHIFT)) & ENETC_SI_PSIIDR_TXR_MASK)

#define ENETC_SI_PSIIDR_MR1_MASK                 (0x2U)
#define ENETC_SI_PSIIDR_MR1_SHIFT                (1U)
#define ENETC_SI_PSIIDR_MR1(x)                   (((uint32_t)(((uint32_t)(x)) << ENETC_SI_PSIIDR_MR1_SHIFT)) & ENETC_SI_PSIIDR_MR1_MASK)

#define ENETC_SI_PSIIDR_RXR_MASK                 (0x10000U)
#define ENETC_SI_PSIIDR_RXR_SHIFT                (16U)
#define ENETC_SI_PSIIDR_RXR(x)                   (((uint32_t)(((uint32_t)(x)) << ENETC_SI_PSIIDR_RXR_SHIFT)) & ENETC_SI_PSIIDR_RXR_MASK)

#define ENETC_SI_PSIIDR_FLR1_MASK                (0x20000U)
#define ENETC_SI_PSIIDR_FLR1_SHIFT               (17U)
#define ENETC_SI_PSIIDR_FLR1(x)                  (((uint32_t)(((uint32_t)(x)) << ENETC_SI_PSIIDR_FLR1_SHIFT)) & ENETC_SI_PSIIDR_FLR1_MASK)
/*! @} */

/*! @name VSIIER - Virtual station interface interrupt enable register */
/*! @{ */

#define ENETC_SI_VSIIER_MSIE_MASK                (0x100U)
#define ENETC_SI_VSIIER_MSIE_SHIFT               (8U)
#define ENETC_SI_VSIIER_MSIE(x)                  (((uint32_t)(((uint32_t)(x)) << ENETC_SI_VSIIER_MSIE_SHIFT)) & ENETC_SI_VSIIER_MSIE_MASK)

#define ENETC_SI_VSIIER_MRIE_MASK                (0x200U)
#define ENETC_SI_VSIIER_MRIE_SHIFT               (9U)
#define ENETC_SI_VSIIER_MRIE(x)                  (((uint32_t)(((uint32_t)(x)) << ENETC_SI_VSIIER_MRIE_SHIFT)) & ENETC_SI_VSIIER_MRIE_MASK)
/*! @} */

/*! @name VSIIDR - Virtual station interface interrupt detect register */
/*! @{ */

#define ENETC_SI_VSIIDR_TXR_MASK                 (0x1U)
#define ENETC_SI_VSIIDR_TXR_SHIFT                (0U)
#define ENETC_SI_VSIIDR_TXR(x)                   (((uint32_t)(((uint32_t)(x)) << ENETC_SI_VSIIDR_TXR_SHIFT)) & ENETC_SI_VSIIDR_TXR_MASK)

#define ENETC_SI_VSIIDR_MS_MASK                  (0x100U)
#define ENETC_SI_VSIIDR_MS_SHIFT                 (8U)
#define ENETC_SI_VSIIDR_MS(x)                    (((uint32_t)(((uint32_t)(x)) << ENETC_SI_VSIIDR_MS_SHIFT)) & ENETC_SI_VSIIDR_MS_MASK)

#define ENETC_SI_VSIIDR_MR_MASK                  (0x200U)
#define ENETC_SI_VSIIDR_MR_SHIFT                 (9U)
#define ENETC_SI_VSIIDR_MR(x)                    (((uint32_t)(((uint32_t)(x)) << ENETC_SI_VSIIDR_MR_SHIFT)) & ENETC_SI_VSIIDR_MR_MASK)

