JayHeng/imxrt-tool-flash-algo/boards/nxp_evkmimxrt1180_rev.c/flash_algo_c0_silicon/Keil_JLink/rom_api/MIMXRT1189_cm7.h
/*! @name SIUNSBECTR - Station interface uncorrectable non-fatal system bus error count register */
/*! @{ */

#define ENETC_SI_SIUNSBECTR_COUNT_MASK           (0xFFU)
#define ENETC_SI_SIUNSBECTR_COUNT_SHIFT          (0U)
/*! COUNT - Count */
#define ENETC_SI_SIUNSBECTR_COUNT(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIUNSBECTR_COUNT_SHIFT)) & ENETC_SI_SIUNSBECTR_COUNT_MASK)
/*! @} */

/*! @name SIUFSBECR - Station interface uncorrectable fatal system bus error configuration register */
/*! @{ */

#define ENETC_SI_SIUFSBECR_RD_MASK               (0x80000000U)
#define ENETC_SI_SIUFSBECR_RD_SHIFT              (31U)
/*! RD - Report disable */
#define ENETC_SI_SIUFSBECR_RD(x)                 (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIUFSBECR_RD_SHIFT)) & ENETC_SI_SIUFSBECR_RD_MASK)
/*! @} */

/*! @name SIUFSBESR - Station interface uncorrectable fatal system bus error status register */
/*! @{ */

#define ENETC_SI_SIUFSBESR_SB_ID_MASK            (0xFU)
#define ENETC_SI_SIUFSBESR_SB_ID_SHIFT           (0U)
/*! SB_ID - System Bus ID */
#define ENETC_SI_SIUFSBESR_SB_ID(x)              (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIUFSBESR_SB_ID_SHIFT)) & ENETC_SI_SIUFSBESR_SB_ID_MASK)

#define ENETC_SI_SIUFSBESR_M_MASK                (0x40000000U)
#define ENETC_SI_SIUFSBESR_M_SHIFT               (30U)
/*! M - Multiple */
#define ENETC_SI_SIUFSBESR_M(x)                  (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIUFSBESR_M_SHIFT)) & ENETC_SI_SIUFSBESR_M_MASK)

#define ENETC_SI_SIUFSBESR_SBE_MASK              (0x80000000U)
#define ENETC_SI_SIUFSBESR_SBE_SHIFT             (31U)
/*! SBE - System bus error */
#define ENETC_SI_SIUFSBESR_SBE(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIUFSBESR_SBE_SHIFT)) & ENETC_SI_SIUFSBESR_SBE_MASK)
/*! @} */

/*! @name SIUNMECR - Station interface uncorrectable non-fatal memory error configuration register */
/*! @{ */

#define ENETC_SI_SIUNMECR_THRESHOLD_MASK         (0xFFU)
#define ENETC_SI_SIUNMECR_THRESHOLD_SHIFT        (0U)
/*! THRESHOLD - Threshold */
#define ENETC_SI_SIUNMECR_THRESHOLD(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIUNMECR_THRESHOLD_SHIFT)) & ENETC_SI_SIUNMECR_THRESHOLD_MASK)

#define ENETC_SI_SIUNMECR_RD_MASK                (0x80000000U)
#define ENETC_SI_SIUNMECR_RD_SHIFT               (31U)
/*! RD - Report disable */
#define ENETC_SI_SIUNMECR_RD(x)                  (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIUNMECR_RD_SHIFT)) & ENETC_SI_SIUNMECR_RD_MASK)
/*! @} */

/*! @name SIUNMESR0 - Station interface uncorrectable non-fatal memory error status register 0 */
/*! @{ */

#define ENETC_SI_SIUNMESR0_SYNDROME_MASK         (0x7FFU)
#define ENETC_SI_SIUNMESR0_SYNDROME_SHIFT        (0U)
/*! SYNDROME - Syndrome */
#define ENETC_SI_SIUNMESR0_SYNDROME(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIUNMESR0_SYNDROME_SHIFT)) & ENETC_SI_SIUNMESR0_SYNDROME_MASK)

#define ENETC_SI_SIUNMESR0_MEM_ID_MASK           (0x1F0000U)
#define ENETC_SI_SIUNMESR0_MEM_ID_SHIFT          (16U)
/*! MEM_ID - Memory ID */
#define ENETC_SI_SIUNMESR0_MEM_ID(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIUNMESR0_MEM_ID_SHIFT)) & ENETC_SI_SIUNMESR0_MEM_ID_MASK)

#define ENETC_SI_SIUNMESR0_MBEE_MASK             (0x80000000U)
#define ENETC_SI_SIUNMESR0_MBEE_SHIFT            (31U)
/*! MBEE - Multi-bit ECC error */
#define ENETC_SI_SIUNMESR0_MBEE(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIUNMESR0_MBEE_SHIFT)) & ENETC_SI_SIUNMESR0_MBEE_MASK)
/*! @} */

/*! @name SIUNMESR1 - Station interface uncorrectable non-fatal memory error status register 1 */
/*! @{ */

#define ENETC_SI_SIUNMESR1_ADDR_MASK             (0xFFFFFFFFU)
#define ENETC_SI_SIUNMESR1_ADDR_SHIFT            (0U)
/*! ADDR - Address */
#define ENETC_SI_SIUNMESR1_ADDR(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIUNMESR1_ADDR_SHIFT)) & ENETC_SI_SIUNMESR1_ADDR_MASK)
/*! @} */

/*! @name SIUNMECTR - Station interface uncorrectable non-fatal memory error count register */
/*! @{ */

#define ENETC_SI_SIUNMECTR_COUNT_MASK            (0xFFU)
#define ENETC_SI_SIUNMECTR_COUNT_SHIFT           (0U)
/*! COUNT - Count */
#define ENETC_SI_SIUNMECTR_COUNT(x)              (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIUNMECTR_COUNT_SHIFT)) & ENETC_SI_SIUNMECTR_COUNT_MASK)
/*! @} */

/*! @name SIUFMECR - Station interface uncorrectable fatal memory error configuration register */
/*! @{ */

#define ENETC_SI_SIUFMECR_RD_MASK                (0x80000000U)
#define ENETC_SI_SIUFMECR_RD_SHIFT               (31U)
/*! RD - Report disable */
#define ENETC_SI_SIUFMECR_RD(x)                  (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIUFMECR_RD_SHIFT)) & ENETC_SI_SIUFMECR_RD_MASK)
/*! @} */

/*! @name SIUFMESR0 - Station interface uncorrectable fatal memory error status register 0 */
/*! @{ */

#define ENETC_SI_SIUFMESR0_SYNDROME_MASK         (0x7FFU)
#define ENETC_SI_SIUFMESR0_SYNDROME_SHIFT        (0U)
/*! SYNDROME - Syndrome */
#define ENETC_SI_SIUFMESR0_SYNDROME(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIUFMESR0_SYNDROME_SHIFT)) & ENETC_SI_SIUFMESR0_SYNDROME_MASK)

#define ENETC_SI_SIUFMESR0_MEM_ID_MASK           (0x1F0000U)
#define ENETC_SI_SIUFMESR0_MEM_ID_SHIFT          (16U)
/*! MEM_ID - Memory ID */
#define ENETC_SI_SIUFMESR0_MEM_ID(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIUFMESR0_MEM_ID_SHIFT)) & ENETC_SI_SIUFMESR0_MEM_ID_MASK)

#define ENETC_SI_SIUFMESR0_M_MASK                (0x40000000U)
#define ENETC_SI_SIUFMESR0_M_SHIFT               (30U)
/*! M - Multiple */
#define ENETC_SI_SIUFMESR0_M(x)                  (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIUFMESR0_M_SHIFT)) & ENETC_SI_SIUFMESR0_M_MASK)

#define ENETC_SI_SIUFMESR0_MBEE_MASK             (0x80000000U)
#define ENETC_SI_SIUFMESR0_MBEE_SHIFT            (31U)
/*! MBEE - Multi-bit ECC error */
#define ENETC_SI_SIUFMESR0_MBEE(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIUFMESR0_MBEE_SHIFT)) & ENETC_SI_SIUFMESR0_MBEE_MASK)
/*! @} */

/*! @name SIUFMESR1 - Station interface uncorrectable fatal memory error status register 1 */
/*! @{ */

#define ENETC_SI_SIUFMESR1_ADDR_MASK             (0xFFFFFFFFU)
#define ENETC_SI_SIUFMESR1_ADDR_SHIFT            (0U)
/*! ADDR - Address */
#define ENETC_SI_SIUFMESR1_ADDR(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIUFMESR1_ADDR_SHIFT)) & ENETC_SI_SIUFMESR1_ADDR_MASK)
/*! @} */

/*! @name SIMAFTCAPR - Station interface MAC address filter table capability register */
/*! @{ */

