JayHeng/imxrt-tool-flash-algo/boards/nxp_evkmimxrt1180_rev.c/flash_algo_c0_silicon/Keil_JLink/rom_api/MIMXRT1189_cm7.h
/*! @name AHBBUFREGIONSTART3 - Receive Buffer Start Address of Region 3 */
/*! @{ */

#define FLEXSPI_AHBBUFREGIONSTART3_START_ADDRESS_MASK (0xFFFFF000U)
#define FLEXSPI_AHBBUFREGIONSTART3_START_ADDRESS_SHIFT (12U)
/*! START_ADDRESS - Start Address of Prefetch Sub-Buffer Region */
#define FLEXSPI_AHBBUFREGIONSTART3_START_ADDRESS(x) (((uint32_t)(((uint32_t)(x)) << FLEXSPI_AHBBUFREGIONSTART3_START_ADDRESS_SHIFT)) & FLEXSPI_AHBBUFREGIONSTART3_START_ADDRESS_MASK)
/*! @} */

/*! @name AHBBUFREGIONEND3 - Receive Buffer Region 3 End Address */
/*! @{ */

#define FLEXSPI_AHBBUFREGIONEND3_END_ADDRESS_MASK (0xFFFFF000U)
#define FLEXSPI_AHBBUFREGIONEND3_END_ADDRESS_SHIFT (12U)
/*! END_ADDRESS - End Address of Prefetch Sub-Buffer Region */
#define FLEXSPI_AHBBUFREGIONEND3_END_ADDRESS(x)  (((uint32_t)(((uint32_t)(x)) << FLEXSPI_AHBBUFREGIONEND3_END_ADDRESS_SHIFT)) & FLEXSPI_AHBBUFREGIONEND3_END_ADDRESS_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group FLEXSPI_Register_Masks */


/* FLEXSPI - Peripheral instance base addresses */
/** Peripheral FLEXSPI1 base address */
#define FLEXSPI1_BASE                            (0x425E0000u)
/** Peripheral FLEXSPI1 base pointer */
#define FLEXSPI1                                 ((FLEXSPI_Type *)FLEXSPI1_BASE)
/** Peripheral FLEXSPI2 base address */
#define FLEXSPI2_BASE                            (0x445E0000u)
/** Peripheral FLEXSPI2 base pointer */
#define FLEXSPI2                                 ((FLEXSPI_Type *)FLEXSPI2_BASE)
/** Array initializer of FLEXSPI peripheral base addresses */
#define FLEXSPI_BASE_ADDRS                       { 0u, FLEXSPI1_BASE, FLEXSPI2_BASE }
/** Array initializer of FLEXSPI peripheral base pointers */
#define FLEXSPI_BASE_PTRS                        { (FLEXSPI_Type *)0u, FLEXSPI1, FLEXSPI2 }
/** Interrupt vectors for the FLEXSPI peripheral type */
#define FLEXSPI_IRQS                             { NotAvail_IRQn, FLEXSPI1_IRQn, FLEXSPI2_IRQn }
/* FlexSPI1 AMBA address. */
#define FlexSPI1_AMBA_BASE                       (0x28000000U)
/* FlexSPI1 ASFM address. */
#define FlexSPI1_ASFM_BASE                       (0x28000000U)
/* Base Address of AHB address space mapped to IP RX FIFO. */
#define FlexSPI1_ARDF_BASE                       (0x47420000U)
/* Base Address of AHB address space mapped to IP TX FIFO. */
#define FlexSPI1_ATDF_BASE                       (0x47430000U)
/* FlexSPI1 alias base address. */
#define FlexSPI1_ALIAS_BASE                      (0x12000000U)
/* FlexSPI2 AMBA address. */
#define FlexSPI2_AMBA_BASE                       (0x4000000U)
/* FlexSPI ASFM address. */
#define FlexSPI2_ASFM_BASE                       (0x4000000U)
/* Base Address of AHB address space mapped to IP RX FIFO. */
#define FlexSPI2_ARDF_BASE                       (0x4DE00000U)
/* Base Address of AHB address space mapped to IP TX FIFO. */
#define FlexSPI2_ATDF_BASE                       (0x4DE10000U)
/* FlexSPI2 alias base address. */
#define FlexSPI2_ALIAS_BASE                      (0x22000000U)


/*!
 * @}
 */ /* end of group FLEXSPI_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- FLEXSPI_SLV Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup FLEXSPI_SLV_Peripheral_Access_Layer FLEXSPI_SLV Peripheral Access Layer
 * @{
 */

/** FLEXSPI_SLV - Register Layout Typedef */
typedef struct {
  __IO uint32_t MODULE_CONTROL;                    /**< Module Control, offset: 0x0 */
  __IO uint32_t READ_COMMAND_CONTROL;              /**< Read Command Control, offset: 0x4 */
  __IO uint32_t READ_REGISTER_COMMAND0;            /**< Read Register Command Setting, offset: 0x8 */
  __IO uint32_t READ_COMMAND[2];                   /**< Read Command 1 setting..Read Command 2 setting, array offset: 0xC, array step: 0x4 */
  __IO uint32_t WRITE_COMMAND_CONTROL;             /**< Write Command Control, offset: 0x14 */
  __IO uint32_t WRITE_REGISTER_COMMAND0;           /**< Write Register Command 0 Setting, offset: 0x18 */
  __IO uint32_t WRITE_COMMAND[2];                  /**< Write Command 1 Setting..Write Command 2 Setting, array offset: 0x1C, array step: 0x4 */
  __IO uint32_t RW_COMMAND_BASE;                   /**< Read Write Command Address Base, offset: 0x24 */
  __IO uint32_t CMD_RANGE[2];                      /**< Command Suit 1 Range..Command Suit 2 Range, array offset: 0x28, array step: 0x4 */
  __I  uint32_t MODULE_STATUS;                     /**< Module Status, offset: 0x30 */
  __IO uint32_t MODULE_INT;                        /**< SPI FLR interrupt, offset: 0x34 */
  __IO uint32_t MODULE_INTEN;                      /**< SPI FLR Interrupt Enable, offset: 0x38 */
  __IO uint32_t SPI_MAIL_CTRL;                     /**< SPI Mailbox control, offset: 0x3C */
  __I  uint32_t SPIMAIL[9];                        /**< SPI Mail Interrupt, array offset: 0x40, array step: 0x4 */
} FLEXSPI_SLV_Type;

/* ----------------------------------------------------------------------------
   -- FLEXSPI_SLV Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup FLEXSPI_SLV_Register_Masks FLEXSPI_SLV Register Masks
 * @{
 */

/*! @name MODULE_CONTROL - Module Control */
/*! @{ */

#define FLEXSPI_SLV_MODULE_CONTROL_SWRESET_MASK  (0x1U)
#define FLEXSPI_SLV_MODULE_CONTROL_SWRESET_SHIFT (0U)
/*! SWRESET - Software Reset
 *  0b1..Initiate
 *  0b0..Finished
 */
#define FLEXSPI_SLV_MODULE_CONTROL_SWRESET(x)    (((uint32_t)(((uint32_t)(x)) << FLEXSPI_SLV_MODULE_CONTROL_SWRESET_SHIFT)) & FLEXSPI_SLV_MODULE_CONTROL_SWRESET_MASK)

#define FLEXSPI_SLV_MODULE_CONTROL_IOMODE_MASK   (0x6U)
#define FLEXSPI_SLV_MODULE_CONTROL_IOMODE_SHIFT  (1U)
/*! IOMODE - SPI IO Mode Control
 *  0b00..SDR*4
 *  0b01..SDR*8
 *  0b10..DDR*4
 *  0b11..DDR*8
 */
#define FLEXSPI_SLV_MODULE_CONTROL_IOMODE(x)     (((uint32_t)(((uint32_t)(x)) << FLEXSPI_SLV_MODULE_CONTROL_IOMODE_SHIFT)) & FLEXSPI_SLV_MODULE_CONTROL_IOMODE_MASK)

#define FLEXSPI_SLV_MODULE_CONTROL_DQSSTOP_MASK  (0x8U)
#define FLEXSPI_SLV_MODULE_CONTROL_DQSSTOP_SHIFT (3U)
/*! DQSSTOP - DQS Stop Feature
 *  0b1..Enable
 *  0b0..Disable
 */
#define FLEXSPI_SLV_MODULE_CONTROL_DQSSTOP(x)    (((uint32_t)(((uint32_t)(x)) << FLEXSPI_SLV_MODULE_CONTROL_DQSSTOP_SHIFT)) & FLEXSPI_SLV_MODULE_CONTROL_DQSSTOP_MASK)

#define FLEXSPI_SLV_MODULE_CONTROL_CSMASK_MASK   (0x10U)
#define FLEXSPI_SLV_MODULE_CONTROL_CSMASK_SHIFT  (4U)
/*! CSMASK - Chip Select Mask
 *  0b1..Masked
 *  0b0..Not masked
 */
#define FLEXSPI_SLV_MODULE_CONTROL_CSMASK(x)     (((uint32_t)(((uint32_t)(x)) << FLEXSPI_SLV_MODULE_CONTROL_CSMASK_SHIFT)) & FLEXSPI_SLV_MODULE_CONTROL_CSMASK_MASK)

#define FLEXSPI_SLV_MODULE_CONTROL_BLKREAD_MASK  (0x20U)
#define FLEXSPI_SLV_MODULE_CONTROL_BLKREAD_SHIFT (5U)
/*! BLKREAD - Block Read
 *  0b1..Blocked
 *  0b0..Allowed
 */
#define FLEXSPI_SLV_MODULE_CONTROL_BLKREAD(x)    (((uint32_t)(((uint32_t)(x)) << FLEXSPI_SLV_MODULE_CONTROL_BLKREAD_SHIFT)) & FLEXSPI_SLV_MODULE_CONTROL_BLKREAD_MASK)

#define FLEXSPI_SLV_MODULE_CONTROL_BLKWRITE_MASK (0x40U)
#define FLEXSPI_SLV_MODULE_CONTROL_BLKWRITE_SHIFT (6U)
/*! BLKWRITE - Block Write
 *  0b1..Blocked
 *  0b0..Allowed
 */
#define FLEXSPI_SLV_MODULE_CONTROL_BLKWRITE(x)   (((uint32_t)(((uint32_t)(x)) << FLEXSPI_SLV_MODULE_CONTROL_BLKWRITE_SHIFT)) & FLEXSPI_SLV_MODULE_CONTROL_BLKWRITE_MASK)

#define FLEXSPI_SLV_MODULE_CONTROL_BLKNXTWR_MASK (0x80U)
#define FLEXSPI_SLV_MODULE_CONTROL_BLKNXTWR_SHIFT (7U)
/*! BLKNXTWR - Block Next Write Command
 *  0b1..Blocked
 *  0b0..Allowed
 */
#define FLEXSPI_SLV_MODULE_CONTROL_BLKNXTWR(x)   (((uint32_t)(((uint32_t)(x)) << FLEXSPI_SLV_MODULE_CONTROL_BLKNXTWR_SHIFT)) & FLEXSPI_SLV_MODULE_CONTROL_BLKNXTWR_MASK)

#define FLEXSPI_SLV_MODULE_CONTROL_BLKNXTRD_MASK (0x100U)
#define FLEXSPI_SLV_MODULE_CONTROL_BLKNXTRD_SHIFT (8U)
/*! BLKNXTRD - Block Next Read
 *  0b1..Blocked
 *  0b0..Allowed
 */
#define FLEXSPI_SLV_MODULE_CONTROL_BLKNXTRD(x)   (((uint32_t)(((uint32_t)(x)) << FLEXSPI_SLV_MODULE_CONTROL_BLKNXTRD_SHIFT)) & FLEXSPI_SLV_MODULE_CONTROL_BLKNXTRD_MASK)

#define FLEXSPI_SLV_MODULE_CONTROL_ALLOWONEWR_MASK (0x200U)
#define FLEXSPI_SLV_MODULE_CONTROL_ALLOWONEWR_SHIFT (9U)
/*! ALLOWONEWR - Allow One More Write
 *  0b1..Allowed
 *  0b0..Not allowed
 */
#define FLEXSPI_SLV_MODULE_CONTROL_ALLOWONEWR(x) (((uint32_t)(((uint32_t)(x)) << FLEXSPI_SLV_MODULE_CONTROL_ALLOWONEWR_SHIFT)) & FLEXSPI_SLV_MODULE_CONTROL_ALLOWONEWR_MASK)

