JayHeng/imxrt-tool-flash-algo/boards/nxp_evkmimxrt1180_rev.c/flash_algo_c0_silicon/Keil_JLink/rom_api/MIMXRT1189_cm7.h
#define FLEXSPI_SLV_MODULE_CONTROL_ALLOWONERD_MASK (0x400U)
#define FLEXSPI_SLV_MODULE_CONTROL_ALLOWONERD_SHIFT (10U)
/*! ALLOWONERD - Allow One More Read
 *  0b1..Allowed
 *  0b0..Not allowed
 */
#define FLEXSPI_SLV_MODULE_CONTROL_ALLOWONERD(x) (((uint32_t)(((uint32_t)(x)) << FLEXSPI_SLV_MODULE_CONTROL_ALLOWONERD_SHIFT)) & FLEXSPI_SLV_MODULE_CONTROL_ALLOWONERD_MASK)

#define FLEXSPI_SLV_MODULE_CONTROL_CMDRANGEBASEUPDATE_MASK (0x800U)
#define FLEXSPI_SLV_MODULE_CONTROL_CMDRANGEBASEUPDATE_SHIFT (11U)
/*! CMDRANGEBASEUPDATE - AXI Command Range Base Update
 *  0b1..Updated
 *  0b0..Not updated
 */
#define FLEXSPI_SLV_MODULE_CONTROL_CMDRANGEBASEUPDATE(x) (((uint32_t)(((uint32_t)(x)) << FLEXSPI_SLV_MODULE_CONTROL_CMDRANGEBASEUPDATE_SHIFT)) & FLEXSPI_SLV_MODULE_CONTROL_CMDRANGEBASEUPDATE_MASK)
/*! @} */

/*! @name READ_COMMAND_CONTROL - Read Command Control */
/*! @{ */

#define FLEXSPI_SLV_READ_COMMAND_CONTROL_RDFETCHSIZE_MASK (0x3U)
#define FLEXSPI_SLV_READ_COMMAND_CONTROL_RDFETCHSIZE_SHIFT (0U)
/*! RDFETCHSIZE - Read Fetch Size
 *  0b00..256 bytes
 *  0b01..512 bytes
 *  0b10..1 KB
 *  0b11..2 KB
 */
#define FLEXSPI_SLV_READ_COMMAND_CONTROL_RDFETCHSIZE(x) (((uint32_t)(((uint32_t)(x)) << FLEXSPI_SLV_READ_COMMAND_CONTROL_RDFETCHSIZE_SHIFT)) & FLEXSPI_SLV_READ_COMMAND_CONTROL_RDFETCHSIZE_MASK)

#define FLEXSPI_SLV_READ_COMMAND_CONTROL_RDWM_MASK (0xFCU)
#define FLEXSPI_SLV_READ_COMMAND_CONTROL_RDWM_SHIFT (2U)
/*! RDWM - Read Watermark Level */
#define FLEXSPI_SLV_READ_COMMAND_CONTROL_RDWM(x) (((uint32_t)(((uint32_t)(x)) << FLEXSPI_SLV_READ_COMMAND_CONTROL_RDWM_SHIFT)) & FLEXSPI_SLV_READ_COMMAND_CONTROL_RDWM_MASK)

#define FLEXSPI_SLV_READ_COMMAND_CONTROL_RDOT_MASK (0x100U)
#define FLEXSPI_SLV_READ_COMMAND_CONTROL_RDOT_SHIFT (8U)
/*! RDOT - Read Outstanding
 *  0b1..Send requests outstandingly
 *  0b0..Send requests after previous leaders finish
 */
#define FLEXSPI_SLV_READ_COMMAND_CONTROL_RDOT(x) (((uint32_t)(((uint32_t)(x)) << FLEXSPI_SLV_READ_COMMAND_CONTROL_RDOT_SHIFT)) & FLEXSPI_SLV_READ_COMMAND_CONTROL_RDOT_MASK)

#define FLEXSPI_SLV_READ_COMMAND_CONTROL_WMEN_MASK (0x200U)
#define FLEXSPI_SLV_READ_COMMAND_CONTROL_WMEN_SHIFT (9U)
/*! WMEN - Read Water Mark Enable
 *  0b1..Enable
 *  0b0..Disable
 */
#define FLEXSPI_SLV_READ_COMMAND_CONTROL_WMEN(x) (((uint32_t)(((uint32_t)(x)) << FLEXSPI_SLV_READ_COMMAND_CONTROL_WMEN_SHIFT)) & FLEXSPI_SLV_READ_COMMAND_CONTROL_WMEN_MASK)
/*! @} */

/*! @name READ_REGISTER_COMMAND0 - Read Register Command Setting */
/*! @{ */

#define FLEXSPI_SLV_READ_REGISTER_COMMAND0_DUMMYCYCLES_MASK (0xFFFFU)
#define FLEXSPI_SLV_READ_REGISTER_COMMAND0_DUMMYCYCLES_SHIFT (0U)
/*! DUMMYCYCLES - Read Register Dummy Cycles */
#define FLEXSPI_SLV_READ_REGISTER_COMMAND0_DUMMYCYCLES(x) (((uint32_t)(((uint32_t)(x)) << FLEXSPI_SLV_READ_REGISTER_COMMAND0_DUMMYCYCLES_SHIFT)) & FLEXSPI_SLV_READ_REGISTER_COMMAND0_DUMMYCYCLES_MASK)

#define FLEXSPI_SLV_READ_REGISTER_COMMAND0_COMMANDSET_MASK (0xFFFF0000U)
#define FLEXSPI_SLV_READ_REGISTER_COMMAND0_COMMANDSET_SHIFT (16U)
/*! COMMANDSET - Read Register Command Setting */
#define FLEXSPI_SLV_READ_REGISTER_COMMAND0_COMMANDSET(x) (((uint32_t)(((uint32_t)(x)) << FLEXSPI_SLV_READ_REGISTER_COMMAND0_COMMANDSET_SHIFT)) & FLEXSPI_SLV_READ_REGISTER_COMMAND0_COMMANDSET_MASK)
/*! @} */

/*! @name READ_COMMAND - Read Command 1 setting..Read Command 2 setting */
/*! @{ */

#define FLEXSPI_SLV_READ_COMMAND_DUMMYCYCLES_MASK (0xFFFFU)
#define FLEXSPI_SLV_READ_COMMAND_DUMMYCYCLES_SHIFT (0U)
/*! DUMMYCYCLES - Read Command 2 Dummy Cycles */
#define FLEXSPI_SLV_READ_COMMAND_DUMMYCYCLES(x)  (((uint32_t)(((uint32_t)(x)) << FLEXSPI_SLV_READ_COMMAND_DUMMYCYCLES_SHIFT)) & FLEXSPI_SLV_READ_COMMAND_DUMMYCYCLES_MASK)

#define FLEXSPI_SLV_READ_COMMAND_COMMANDSET_MASK (0xFFFF0000U)
#define FLEXSPI_SLV_READ_COMMAND_COMMANDSET_SHIFT (16U)
/*! COMMANDSET - Read Command 2 Setting */
#define FLEXSPI_SLV_READ_COMMAND_COMMANDSET(x)   (((uint32_t)(((uint32_t)(x)) << FLEXSPI_SLV_READ_COMMAND_COMMANDSET_SHIFT)) & FLEXSPI_SLV_READ_COMMAND_COMMANDSET_MASK)
/*! @} */

/* The count of FLEXSPI_SLV_READ_COMMAND */
#define FLEXSPI_SLV_READ_COMMAND_COUNT           (2U)

/*! @name WRITE_COMMAND_CONTROL - Write Command Control */
/*! @{ */

#define FLEXSPI_SLV_WRITE_COMMAND_CONTROL_WRWM_MASK (0x3U)
#define FLEXSPI_SLV_WRITE_COMMAND_CONTROL_WRWM_SHIFT (0U)
/*! WRWM - Write Watermark
 *  0b00..32 bytes
 *  0b01..64 bytes
 *  0b10..128 bytes
 *  0b11..256 bytes
 */
#define FLEXSPI_SLV_WRITE_COMMAND_CONTROL_WRWM(x) (((uint32_t)(((uint32_t)(x)) << FLEXSPI_SLV_WRITE_COMMAND_CONTROL_WRWM_SHIFT)) & FLEXSPI_SLV_WRITE_COMMAND_CONTROL_WRWM_MASK)
/*! @} */

/*! @name WRITE_REGISTER_COMMAND0 - Write Register Command 0 Setting */
/*! @{ */

#define FLEXSPI_SLV_WRITE_REGISTER_COMMAND0_COMMANDSET_MASK (0xFFFF0000U)
#define FLEXSPI_SLV_WRITE_REGISTER_COMMAND0_COMMANDSET_SHIFT (16U)
/*! COMMANDSET - Write Register Command Setting */
#define FLEXSPI_SLV_WRITE_REGISTER_COMMAND0_COMMANDSET(x) (((uint32_t)(((uint32_t)(x)) << FLEXSPI_SLV_WRITE_REGISTER_COMMAND0_COMMANDSET_SHIFT)) & FLEXSPI_SLV_WRITE_REGISTER_COMMAND0_COMMANDSET_MASK)
/*! @} */

/*! @name WRITE_COMMAND - Write Command 1 Setting..Write Command 2 Setting */
/*! @{ */

#define FLEXSPI_SLV_WRITE_COMMAND_COMMANDSET_MASK (0xFFFF0000U)
#define FLEXSPI_SLV_WRITE_COMMAND_COMMANDSET_SHIFT (16U)
/*! COMMANDSET - Write Command 2 Setting */
#define FLEXSPI_SLV_WRITE_COMMAND_COMMANDSET(x)  (((uint32_t)(((uint32_t)(x)) << FLEXSPI_SLV_WRITE_COMMAND_COMMANDSET_SHIFT)) & FLEXSPI_SLV_WRITE_COMMAND_COMMANDSET_MASK)
/*! @} */

/* The count of FLEXSPI_SLV_WRITE_COMMAND */
#define FLEXSPI_SLV_WRITE_COMMAND_COUNT          (2U)

/*! @name RW_COMMAND_BASE - Read Write Command Address Base */
/*! @{ */

#define FLEXSPI_SLV_RW_COMMAND_BASE_ADDRBASE1_MASK (0xFFFFU)
#define FLEXSPI_SLV_RW_COMMAND_BASE_ADDRBASE1_SHIFT (0U)
/*! ADDRBASE1 - Address Base 1 */
#define FLEXSPI_SLV_RW_COMMAND_BASE_ADDRBASE1(x) (((uint32_t)(((uint32_t)(x)) << FLEXSPI_SLV_RW_COMMAND_BASE_ADDRBASE1_SHIFT)) & FLEXSPI_SLV_RW_COMMAND_BASE_ADDRBASE1_MASK)

#define FLEXSPI_SLV_RW_COMMAND_BASE_ADDRBASE2_MASK (0xFFFF0000U)
#define FLEXSPI_SLV_RW_COMMAND_BASE_ADDRBASE2_SHIFT (16U)
/*! ADDRBASE2 - Address Base 2 */
#define FLEXSPI_SLV_RW_COMMAND_BASE_ADDRBASE2(x) (((uint32_t)(((uint32_t)(x)) << FLEXSPI_SLV_RW_COMMAND_BASE_ADDRBASE2_SHIFT)) & FLEXSPI_SLV_RW_COMMAND_BASE_ADDRBASE2_MASK)
/*! @} */

/*! @name CMD_RANGE - Command Suit 1 Range..Command Suit 2 Range */
/*! @{ */

