JayHeng/imxrt-tool-flash-algo/boards/nxp_evkmimxrt1180_rev.c/flash_algo_c0_silicon/Keil_JLink/rom_api/MIMXRT1189_cm7.h
/*! @name MWMSG_DDR_CONTROL2 - Controller Write Message in DDR mode Control 2 */
/*! @{ */

#define I3C_MWMSG_DDR_CONTROL2_LEN_MASK          (0x3FFU)
#define I3C_MWMSG_DDR_CONTROL2_LEN_SHIFT         (0U)
/*! LEN - Length of Message */
#define I3C_MWMSG_DDR_CONTROL2_LEN(x)            (((uint32_t)(((uint32_t)(x)) << I3C_MWMSG_DDR_CONTROL2_LEN_SHIFT)) & I3C_MWMSG_DDR_CONTROL2_LEN_MASK)

#define I3C_MWMSG_DDR_CONTROL2_END_MASK          (0x4000U)
#define I3C_MWMSG_DDR_CONTROL2_END_SHIFT         (14U)
/*! END - End of message
 *  0b1..End. DDR message ends on HDR Exit.
 *  0b0..Not the end. DDR message ends waiting for a new DDR message (will issue a HDR Restart for the new message).
 */
#define I3C_MWMSG_DDR_CONTROL2_END(x)            (((uint32_t)(((uint32_t)(x)) << I3C_MWMSG_DDR_CONTROL2_END_SHIFT)) & I3C_MWMSG_DDR_CONTROL2_END_MASK)
/*! @} */

/*! @name MWMSG_DDR_DATA - Controller Write Message Data in DDR mode */
/*! @{ */

#define I3C_MWMSG_DDR_DATA_DATA16B_MASK          (0xFFFFU)
#define I3C_MWMSG_DDR_DATA_DATA16B_SHIFT         (0U)
/*! DATA16B - Data */
#define I3C_MWMSG_DDR_DATA_DATA16B(x)            (((uint32_t)(((uint32_t)(x)) << I3C_MWMSG_DDR_DATA_DATA16B_SHIFT)) & I3C_MWMSG_DDR_DATA_DATA16B_MASK)
/*! @} */

/*! @name MRMSG_DDR - Controller Read Message in DDR mode */
/*! @{ */

#define I3C_MRMSG_DDR_DATA_MASK                  (0xFFFFU)
#define I3C_MRMSG_DDR_DATA_SHIFT                 (0U)
/*! DATA - Data */
#define I3C_MRMSG_DDR_DATA(x)                    (((uint32_t)(((uint32_t)(x)) << I3C_MRMSG_DDR_DATA_SHIFT)) & I3C_MRMSG_DDR_DATA_MASK)
/*! @} */

/*! @name MDYNADDR - Controller Dynamic Address */
/*! @{ */

#define I3C_MDYNADDR_DAVALID_MASK                (0x1U)
#define I3C_MDYNADDR_DAVALID_SHIFT               (0U)
/*! DAVALID - Dynamic address valid
 *  0b1..Valid DA assigned
 *  0b0..No valid DA assigned
 */
#define I3C_MDYNADDR_DAVALID(x)                  (((uint32_t)(((uint32_t)(x)) << I3C_MDYNADDR_DAVALID_SHIFT)) & I3C_MDYNADDR_DAVALID_MASK)

#define I3C_MDYNADDR_DADDR_MASK                  (0xFEU)
#define I3C_MDYNADDR_DADDR_SHIFT                 (1U)
/*! DADDR - Dynamic address */
#define I3C_MDYNADDR_DADDR(x)                    (((uint32_t)(((uint32_t)(x)) << I3C_MDYNADDR_DADDR_SHIFT)) & I3C_MDYNADDR_DADDR_MASK)
/*! @} */

/*! @name SRSTACTTIME - Timing Rules for TargetReset Recovery */
/*! @{ */

#define I3C_SRSTACTTIME_PERRSTTIM_MASK           (0xFFU)
#define I3C_SRSTACTTIME_PERRSTTIM_SHIFT          (0U)
/*! PERRSTTIM - Time to Recover from the I3C peripheral */
#define I3C_SRSTACTTIME_PERRSTTIM(x)             (((uint32_t)(((uint32_t)(x)) << I3C_SRSTACTTIME_PERRSTTIM_SHIFT)) & I3C_SRSTACTTIME_PERRSTTIM_MASK)

#define I3C_SRSTACTTIME_SYSRSTTIM_MASK           (0xFF00U)
#define I3C_SRSTACTTIME_SYSRSTTIM_SHIFT          (8U)
/*! SYSRSTTIM - Time to Recover from Chip Reset */
#define I3C_SRSTACTTIME_SYSRSTTIM(x)             (((uint32_t)(((uint32_t)(x)) << I3C_SRSTACTTIME_SYSRSTTIM_SHIFT)) & I3C_SRSTACTTIME_SYSRSTTIM_MASK)

#define I3C_SRSTACTTIME_CUSRSTTIM_MASK           (0xFF0000U)
#define I3C_SRSTACTTIME_CUSRSTTIM_SHIFT          (16U)
/*! CUSRSTTIM - Custom Time to Recover */
#define I3C_SRSTACTTIME_CUSRSTTIM(x)             (((uint32_t)(((uint32_t)(x)) << I3C_SRSTACTTIME_CUSRSTTIM_SHIFT)) & I3C_SRSTACTTIME_CUSRSTTIM_MASK)
/*! @} */

/*! @name SCCCMASK - CCC Mask for Unhandled CCCs */
/*! @{ */

#define I3C_SCCCMASK_BASE_MASK                   (0x1U)
#define I3C_SCCCMASK_BASE_SHIFT                  (0U)
/*! BASE - Base
 *  0b0..Suppressed
 *  0b1..Passed to application
 */
#define I3C_SCCCMASK_BASE(x)                     (((uint32_t)(((uint32_t)(x)) << I3C_SCCCMASK_BASE_SHIFT)) & I3C_SCCCMASK_BASE_MASK)

#define I3C_SCCCMASK_BASEBX_MASK                 (0x2U)
#define I3C_SCCCMASK_BASEBX_SHIFT                (1U)
/*! BASEBX - BASEBX
 *  0b0..Suppressed
 *  0b1..Passed to application
 */
#define I3C_SCCCMASK_BASEBX(x)                   (((uint32_t)(((uint32_t)(x)) << I3C_SCCCMASK_BASEBX_SHIFT)) & I3C_SCCCMASK_BASEBX_MASK)

#define I3C_SCCCMASK_BASEDX_MASK                 (0x4U)
#define I3C_SCCCMASK_BASEDX_SHIFT                (2U)
/*! BASEDX - BASEDX
 *  0b0..Suppressed
 *  0b1..Passed to application
 */
#define I3C_SCCCMASK_BASEDX(x)                   (((uint32_t)(((uint32_t)(x)) << I3C_SCCCMASK_BASEDX_SHIFT)) & I3C_SCCCMASK_BASEDX_MASK)

#define I3C_SCCCMASK_MEXTB_MASK                  (0x8U)
#define I3C_SCCCMASK_MEXTB_SHIFT                 (3U)
/*! MEXTB - MEXTB
 *  0b0..Suppressed
 *  0b1..Passed to application
 */
#define I3C_SCCCMASK_MEXTB(x)                    (((uint32_t)(((uint32_t)(x)) << I3C_SCCCMASK_MEXTB_SHIFT)) & I3C_SCCCMASK_MEXTB_MASK)

#define I3C_SCCCMASK_MEXTD_MASK                  (0x10U)
#define I3C_SCCCMASK_MEXTD_SHIFT                 (4U)
/*! MEXTD - MEXTD
 *  0b0..Suppressed
 *  0b1..Passed to application
 */
#define I3C_SCCCMASK_MEXTD(x)                    (((uint32_t)(((uint32_t)(x)) << I3C_SCCCMASK_MEXTD_SHIFT)) & I3C_SCCCMASK_MEXTD_MASK)

#define I3C_SCCCMASK_VENDB_MASK                  (0x20U)
#define I3C_SCCCMASK_VENDB_SHIFT                 (5U)
/*! VENDB - VENDB
 *  0b0..Suppressed
 *  0b1..Passed to application
 */
#define I3C_SCCCMASK_VENDB(x)                    (((uint32_t)(((uint32_t)(x)) << I3C_SCCCMASK_VENDB_SHIFT)) & I3C_SCCCMASK_VENDB_MASK)

#define I3C_SCCCMASK_VENDD_MASK                  (0x40U)
#define I3C_SCCCMASK_VENDD_SHIFT                 (6U)
/*! VENDD - VENDD
 *  0b0..Suppressed
 *  0b1..Passed to application
 */
#define I3C_SCCCMASK_VENDD(x)                    (((uint32_t)(((uint32_t)(x)) << I3C_SCCCMASK_VENDD_SHIFT)) & I3C_SCCCMASK_VENDD_MASK)
/*! @} */

/*! @name SERRWARNMASK - Target Errors and Warnings Mask */
/*! @{ */

#define I3C_SERRWARNMASK_ORUN_MASK               (0x1U)
#define I3C_SERRWARNMASK_ORUN_SHIFT              (0U)
/*! ORUN - ORUN mask
 *  0b1..Allow
 *  0b0..Deny
 */
#define I3C_SERRWARNMASK_ORUN(x)                 (((uint32_t)(((uint32_t)(x)) << I3C_SERRWARNMASK_ORUN_SHIFT)) & I3C_SERRWARNMASK_ORUN_MASK)

#define I3C_SERRWARNMASK_URUN_MASK               (0x2U)
#define I3C_SERRWARNMASK_URUN_SHIFT              (1U)
/*! URUN - URUN mask
 *  0b1..Allow
 *  0b0..Deny
 */
#define I3C_SERRWARNMASK_URUN(x)                 (((uint32_t)(((uint32_t)(x)) << I3C_SERRWARNMASK_URUN_SHIFT)) & I3C_SERRWARNMASK_URUN_MASK)

#define I3C_SERRWARNMASK_URUNNACK_MASK           (0x4U)
#define I3C_SERRWARNMASK_URUNNACK_SHIFT          (2U)
/*! URUNNACK - URUNNACK mask
 *  0b1..Allow
 *  0b0..Deny
 */
#define I3C_SERRWARNMASK_URUNNACK(x)             (((uint32_t)(((uint32_t)(x)) << I3C_SERRWARNMASK_URUNNACK_SHIFT)) & I3C_SERRWARNMASK_URUNNACK_MASK)

#define I3C_SERRWARNMASK_TERM_MASK               (0x8U)
#define I3C_SERRWARNMASK_TERM_SHIFT              (3U)
/*! TERM - TERM mask
 *  0b1..Allow
 *  0b0..Deny
 */
#define I3C_SERRWARNMASK_TERM(x)                 (((uint32_t)(((uint32_t)(x)) << I3C_SERRWARNMASK_TERM_SHIFT)) & I3C_SERRWARNMASK_TERM_MASK)

#define I3C_SERRWARNMASK_INVSTART_MASK           (0x10U)
#define I3C_SERRWARNMASK_INVSTART_SHIFT          (4U)
/*! INVSTART - INVSTART mask
 *  0b1..Allow
 *  0b0..Deny
 */
#define I3C_SERRWARNMASK_INVSTART(x)             (((uint32_t)(((uint32_t)(x)) << I3C_SERRWARNMASK_INVSTART_SHIFT)) & I3C_SERRWARNMASK_INVSTART_MASK)

#define I3C_SERRWARNMASK_SPAR_MASK               (0x100U)
#define I3C_SERRWARNMASK_SPAR_SHIFT              (8U)
/*! SPAR - SPAR mask
 *  0b1..Allow
 *  0b0..Deny
 */
#define I3C_SERRWARNMASK_SPAR(x)                 (((uint32_t)(((uint32_t)(x)) << I3C_SERRWARNMASK_SPAR_SHIFT)) & I3C_SERRWARNMASK_SPAR_MASK)

#define I3C_SERRWARNMASK_HPAR_MASK               (0x200U)
#define I3C_SERRWARNMASK_HPAR_SHIFT              (9U)
/*! HPAR - HPAR mask
 *  0b1..Allow
 *  0b0..Deny
 */
#define I3C_SERRWARNMASK_HPAR(x)                 (((uint32_t)(((uint32_t)(x)) << I3C_SERRWARNMASK_HPAR_SHIFT)) & I3C_SERRWARNMASK_HPAR_MASK)

#define I3C_SERRWARNMASK_HCRC_MASK               (0x400U)
#define I3C_SERRWARNMASK_HCRC_SHIFT              (10U)
/*! HCRC - HCRC mask
 *  0b1..Allow
 *  0b0..Deny
 */
#define I3C_SERRWARNMASK_HCRC(x)                 (((uint32_t)(((uint32_t)(x)) << I3C_SERRWARNMASK_HCRC_SHIFT)) & I3C_SERRWARNMASK_HCRC_MASK)

#define I3C_SERRWARNMASK_S0S1_MASK               (0x800U)
#define I3C_SERRWARNMASK_S0S1_SHIFT              (11U)
/*! S0S1 - S0S1 mask
 *  0b1..Allow
 *  0b0..Deny
 */
#define I3C_SERRWARNMASK_S0S1(x)                 (((uint32_t)(((uint32_t)(x)) << I3C_SERRWARNMASK_S0S1_SHIFT)) & I3C_SERRWARNMASK_S0S1_MASK)
/*! @} */

/*! @name SMAPCTRL0 - Map Feature Control 0 */
/*! @{ */

#define I3C_SMAPCTRL0_ENA_MASK                   (0x1U)
#define I3C_SMAPCTRL0_ENA_SHIFT                  (0U)
/*! ENA - Enable Primary Dynamic Address
 *  0b0..Disable
 *  0b1..Enable
 */
#define I3C_SMAPCTRL0_ENA(x)                     (((uint32_t)(((uint32_t)(x)) << I3C_SMAPCTRL0_ENA_SHIFT)) & I3C_SMAPCTRL0_ENA_MASK)

