JayHeng/imxrt-tool-flash-algo/boards/nxp_evkmimxrt1180_rev.c/flash_algo_c0_silicon/Keil_JLink/rom_api/MIMXRT1189_cm7.h
#define IERC_PCI_PCI_CFH_DID_VID_DEVICE_ID_MASK  (0xFFFF0000U)
#define IERC_PCI_PCI_CFH_DID_VID_DEVICE_ID_SHIFT (16U)
#define IERC_PCI_PCI_CFH_DID_VID_DEVICE_ID(x)    (((uint32_t)(((uint32_t)(x)) << IERC_PCI_PCI_CFH_DID_VID_DEVICE_ID_SHIFT)) & IERC_PCI_PCI_CFH_DID_VID_DEVICE_ID_MASK)
/*! @} */

/*! @name PCI_CFH_CMD - PCI command register */
/*! @{ */

#define IERC_PCI_PCI_CFH_CMD_INTR_DISABLE_MASK   (0x400U)
#define IERC_PCI_PCI_CFH_CMD_INTR_DISABLE_SHIFT  (10U)
#define IERC_PCI_PCI_CFH_CMD_INTR_DISABLE(x)     (((uint16_t)(((uint16_t)(x)) << IERC_PCI_PCI_CFH_CMD_INTR_DISABLE_SHIFT)) & IERC_PCI_PCI_CFH_CMD_INTR_DISABLE_MASK)
/*! @} */

/*! @name PCI_CFH_STAT - PCI status register */
/*! @{ */

#define IERC_PCI_PCI_CFH_STAT_INTR_STATUS_MASK   (0x8U)
#define IERC_PCI_PCI_CFH_STAT_INTR_STATUS_SHIFT  (3U)
#define IERC_PCI_PCI_CFH_STAT_INTR_STATUS(x)     (((uint16_t)(((uint16_t)(x)) << IERC_PCI_PCI_CFH_STAT_INTR_STATUS_SHIFT)) & IERC_PCI_PCI_CFH_STAT_INTR_STATUS_MASK)

#define IERC_PCI_PCI_CFH_STAT_CAP_LIST_MASK      (0x10U)
#define IERC_PCI_PCI_CFH_STAT_CAP_LIST_SHIFT     (4U)
#define IERC_PCI_PCI_CFH_STAT_CAP_LIST(x)        (((uint16_t)(((uint16_t)(x)) << IERC_PCI_PCI_CFH_STAT_CAP_LIST_SHIFT)) & IERC_PCI_PCI_CFH_STAT_CAP_LIST_MASK)
/*! @} */

/*! @name PCI_CFH_REVID_CLASSCODE - PCI revision ID and classcode register */
/*! @{ */

#define IERC_PCI_PCI_CFH_REVID_CLASSCODE_REV_ID_MASK (0xFFU)
#define IERC_PCI_PCI_CFH_REVID_CLASSCODE_REV_ID_SHIFT (0U)
#define IERC_PCI_PCI_CFH_REVID_CLASSCODE_REV_ID(x) (((uint32_t)(((uint32_t)(x)) << IERC_PCI_PCI_CFH_REVID_CLASSCODE_REV_ID_SHIFT)) & IERC_PCI_PCI_CFH_REVID_CLASSCODE_REV_ID_MASK)

#define IERC_PCI_PCI_CFH_REVID_CLASSCODE_CLASS_CODE_MASK (0xFFFFFF00U)
#define IERC_PCI_PCI_CFH_REVID_CLASSCODE_CLASS_CODE_SHIFT (8U)
#define IERC_PCI_PCI_CFH_REVID_CLASSCODE_CLASS_CODE(x) (((uint32_t)(((uint32_t)(x)) << IERC_PCI_PCI_CFH_REVID_CLASSCODE_CLASS_CODE_SHIFT)) & IERC_PCI_PCI_CFH_REVID_CLASSCODE_CLASS_CODE_MASK)
/*! @} */

/*! @name PCI_CFH_CL_SIZE - PCI cache line size register */
/*! @{ */

#define IERC_PCI_PCI_CFH_CL_SIZE_CACHE_LINE_SIZE_MASK (0xFFU)
#define IERC_PCI_PCI_CFH_CL_SIZE_CACHE_LINE_SIZE_SHIFT (0U)
#define IERC_PCI_PCI_CFH_CL_SIZE_CACHE_LINE_SIZE(x) (((uint8_t)(((uint8_t)(x)) << IERC_PCI_PCI_CFH_CL_SIZE_CACHE_LINE_SIZE_SHIFT)) & IERC_PCI_PCI_CFH_CL_SIZE_CACHE_LINE_SIZE_MASK)
/*! @} */

/*! @name PCI_CFH_HDR_TYPE - PCI header type register */
/*! @{ */

#define IERC_PCI_PCI_CFH_HDR_TYPE_HDR_TYPE_MASK  (0x7FU)
#define IERC_PCI_PCI_CFH_HDR_TYPE_HDR_TYPE_SHIFT (0U)
#define IERC_PCI_PCI_CFH_HDR_TYPE_HDR_TYPE(x)    (((uint8_t)(((uint8_t)(x)) << IERC_PCI_PCI_CFH_HDR_TYPE_HDR_TYPE_SHIFT)) & IERC_PCI_PCI_CFH_HDR_TYPE_HDR_TYPE_MASK)

#define IERC_PCI_PCI_CFH_HDR_TYPE_MULT_FUNC_DEV_MASK (0x80U)
#define IERC_PCI_PCI_CFH_HDR_TYPE_MULT_FUNC_DEV_SHIFT (7U)
#define IERC_PCI_PCI_CFH_HDR_TYPE_MULT_FUNC_DEV(x) (((uint8_t)(((uint8_t)(x)) << IERC_PCI_PCI_CFH_HDR_TYPE_MULT_FUNC_DEV_SHIFT)) & IERC_PCI_PCI_CFH_HDR_TYPE_MULT_FUNC_DEV_MASK)
/*! @} */

/*! @name PCI_CFH_SUBSYS_VID - PCI subsystem vendor ID register */
/*! @{ */

#define IERC_PCI_PCI_CFH_SUBSYS_VID_SUBSYSTEM_VENDOR_ID_MASK (0xFFFFU)
#define IERC_PCI_PCI_CFH_SUBSYS_VID_SUBSYSTEM_VENDOR_ID_SHIFT (0U)
#define IERC_PCI_PCI_CFH_SUBSYS_VID_SUBSYSTEM_VENDOR_ID(x) (((uint16_t)(((uint16_t)(x)) << IERC_PCI_PCI_CFH_SUBSYS_VID_SUBSYSTEM_VENDOR_ID_SHIFT)) & IERC_PCI_PCI_CFH_SUBSYS_VID_SUBSYSTEM_VENDOR_ID_MASK)
/*! @} */

/*! @name PCI_CFH_SUBSYS_ID - PCI subsystem ID register */
/*! @{ */

#define IERC_PCI_PCI_CFH_SUBSYS_ID_SUBSYSTEM_ID_MASK (0xFFFFU)
#define IERC_PCI_PCI_CFH_SUBSYS_ID_SUBSYSTEM_ID_SHIFT (0U)
#define IERC_PCI_PCI_CFH_SUBSYS_ID_SUBSYSTEM_ID(x) (((uint16_t)(((uint16_t)(x)) << IERC_PCI_PCI_CFH_SUBSYS_ID_SUBSYSTEM_ID_SHIFT)) & IERC_PCI_PCI_CFH_SUBSYS_ID_SUBSYSTEM_ID_MASK)
/*! @} */

/*! @name PCI_CFH_CAP_PTR - PCI capabilities pointer register */
/*! @{ */

#define IERC_PCI_PCI_CFH_CAP_PTR_CAP_PTR_MASK    (0xFFU)
#define IERC_PCI_PCI_CFH_CAP_PTR_CAP_PTR_SHIFT   (0U)
#define IERC_PCI_PCI_CFH_CAP_PTR_CAP_PTR(x)      (((uint8_t)(((uint8_t)(x)) << IERC_PCI_PCI_CFH_CAP_PTR_CAP_PTR_SHIFT)) & IERC_PCI_PCI_CFH_CAP_PTR_CAP_PTR_MASK)
/*! @} */

/*! @name PCI_CFH_INT_LINE - PCI interrupt line register */
/*! @{ */

#define IERC_PCI_PCI_CFH_INT_LINE_INT_LINE_MASK  (0xFFU)
#define IERC_PCI_PCI_CFH_INT_LINE_INT_LINE_SHIFT (0U)
#define IERC_PCI_PCI_CFH_INT_LINE_INT_LINE(x)    (((uint8_t)(((uint8_t)(x)) << IERC_PCI_PCI_CFH_INT_LINE_INT_LINE_SHIFT)) & IERC_PCI_PCI_CFH_INT_LINE_INT_LINE_MASK)
/*! @} */

/*! @name PCI_CFH_INT_PIN - PCI interrupt pin register */
/*! @{ */

#define IERC_PCI_PCI_CFH_INT_PIN_INT_PIN_MASK    (0xFFU)
#define IERC_PCI_PCI_CFH_INT_PIN_INT_PIN_SHIFT   (0U)
#define IERC_PCI_PCI_CFH_INT_PIN_INT_PIN(x)      (((uint8_t)(((uint8_t)(x)) << IERC_PCI_PCI_CFH_INT_PIN_INT_PIN_SHIFT)) & IERC_PCI_PCI_CFH_INT_PIN_INT_PIN_MASK)
/*! @} */

/*! @name PCI_CFC_PCIE_CAP_LIST - PCI PCIe capabilities list register */
/*! @{ */

#define IERC_PCI_PCI_CFC_PCIE_CAP_LIST_CAP_ID_MASK (0xFFU)
#define IERC_PCI_PCI_CFC_PCIE_CAP_LIST_CAP_ID_SHIFT (0U)
#define IERC_PCI_PCI_CFC_PCIE_CAP_LIST_CAP_ID(x) (((uint16_t)(((uint16_t)(x)) << IERC_PCI_PCI_CFC_PCIE_CAP_LIST_CAP_ID_SHIFT)) & IERC_PCI_PCI_CFC_PCIE_CAP_LIST_CAP_ID_MASK)

#define IERC_PCI_PCI_CFC_PCIE_CAP_LIST_NEXT_CAP_ID_MASK (0xFF00U)
#define IERC_PCI_PCI_CFC_PCIE_CAP_LIST_NEXT_CAP_ID_SHIFT (8U)
#define IERC_PCI_PCI_CFC_PCIE_CAP_LIST_NEXT_CAP_ID(x) (((uint16_t)(((uint16_t)(x)) << IERC_PCI_PCI_CFC_PCIE_CAP_LIST_NEXT_CAP_ID_SHIFT)) & IERC_PCI_PCI_CFC_PCIE_CAP_LIST_NEXT_CAP_ID_MASK)
/*! @} */

/*! @name PCI_CFC_PCIE_CAP - PCI PCIe capabilities register */
/*! @{ */

#define IERC_PCI_PCI_CFC_PCIE_CAP_CAP_VER_MASK   (0xFU)
#define IERC_PCI_PCI_CFC_PCIE_CAP_CAP_VER_SHIFT  (0U)
#define IERC_PCI_PCI_CFC_PCIE_CAP_CAP_VER(x)     (((uint16_t)(((uint16_t)(x)) << IERC_PCI_PCI_CFC_PCIE_CAP_CAP_VER_SHIFT)) & IERC_PCI_PCI_CFC_PCIE_CAP_CAP_VER_MASK)

#define IERC_PCI_PCI_CFC_PCIE_CAP_DEV_PORT_TYPE_MASK (0xF0U)
#define IERC_PCI_PCI_CFC_PCIE_CAP_DEV_PORT_TYPE_SHIFT (4U)
#define IERC_PCI_PCI_CFC_PCIE_CAP_DEV_PORT_TYPE(x) (((uint16_t)(((uint16_t)(x)) << IERC_PCI_PCI_CFC_PCIE_CAP_DEV_PORT_TYPE_SHIFT)) & IERC_PCI_PCI_CFC_PCIE_CAP_DEV_PORT_TYPE_MASK)

#define IERC_PCI_PCI_CFC_PCIE_CAP_INT_MSG_NUM_MASK (0x3E00U)
#define IERC_PCI_PCI_CFC_PCIE_CAP_INT_MSG_NUM_SHIFT (9U)
#define IERC_PCI_PCI_CFC_PCIE_CAP_INT_MSG_NUM(x) (((uint16_t)(((uint16_t)(x)) << IERC_PCI_PCI_CFC_PCIE_CAP_INT_MSG_NUM_SHIFT)) & IERC_PCI_PCI_CFC_PCIE_CAP_INT_MSG_NUM_MASK)
/*! @} */

/*! @name PCI_CFC_PCIE_DEV_CAP - PCI PCIe device capabilities register */
/*! @{ */

#define IERC_PCI_PCI_CFC_PCIE_DEV_CAP_FLR_CAP_MASK (0x10000000U)
#define IERC_PCI_PCI_CFC_PCIE_DEV_CAP_FLR_CAP_SHIFT (28U)
#define IERC_PCI_PCI_CFC_PCIE_DEV_CAP_FLR_CAP(x) (((uint32_t)(((uint32_t)(x)) << IERC_PCI_PCI_CFC_PCIE_DEV_CAP_FLR_CAP_SHIFT)) & IERC_PCI_PCI_CFC_PCIE_DEV_CAP_FLR_CAP_MASK)
/*! @} */

