JayHeng/imxrt-tool-flash-algo/boards/nxp_evkmimxrt1180_rev.c/flash_algo_c0_silicon/Keil_JLink/rom_api/MIMXRT1189_cm7.h
#define M7_MCM_ISCR_WABS_MASK                    (0x20U)
#define M7_MCM_ISCR_WABS_SHIFT                   (5U)
/*! WABS - Write Abort on Slave
 *  0b0..No abort
 *  0b1..Abort
 */
#define M7_MCM_ISCR_WABS(x)                      (((uint32_t)(((uint32_t)(x)) << M7_MCM_ISCR_WABS_SHIFT)) & M7_MCM_ISCR_WABS_MASK)

#define M7_MCM_ISCR_WABSO_MASK                   (0x40U)
#define M7_MCM_ISCR_WABSO_SHIFT                  (6U)
/*! WABSO - Write Abort on Slave Overrun
 *  0b0..No write abort overrun
 *  0b1..Write abort overrun occurred
 */
#define M7_MCM_ISCR_WABSO(x)                     (((uint32_t)(((uint32_t)(x)) << M7_MCM_ISCR_WABSO_SHIFT)) & M7_MCM_ISCR_WABSO_MASK)

#define M7_MCM_ISCR_FIOC_MASK                    (0x100U)
#define M7_MCM_ISCR_FIOC_SHIFT                   (8U)
/*! FIOC - FPU Invalid Operation interrupt Status
 *  0b0..No interrupt
 *  0b1..Interrupt occurred
 */
#define M7_MCM_ISCR_FIOC(x)                      (((uint32_t)(((uint32_t)(x)) << M7_MCM_ISCR_FIOC_SHIFT)) & M7_MCM_ISCR_FIOC_MASK)

#define M7_MCM_ISCR_FDZC_MASK                    (0x200U)
#define M7_MCM_ISCR_FDZC_SHIFT                   (9U)
/*! FDZC - FPU Divide-by-Zero Interrupt Status
 *  0b0..No interrupt
 *  0b1..Interrupt occurred
 */
#define M7_MCM_ISCR_FDZC(x)                      (((uint32_t)(((uint32_t)(x)) << M7_MCM_ISCR_FDZC_SHIFT)) & M7_MCM_ISCR_FDZC_MASK)

#define M7_MCM_ISCR_FOFC_MASK                    (0x400U)
#define M7_MCM_ISCR_FOFC_SHIFT                   (10U)
/*! FOFC - FPU Overflow Interrupt Status
 *  0b0..No interrupt
 *  0b1..Interrupt occurred
 */
#define M7_MCM_ISCR_FOFC(x)                      (((uint32_t)(((uint32_t)(x)) << M7_MCM_ISCR_FOFC_SHIFT)) & M7_MCM_ISCR_FOFC_MASK)

#define M7_MCM_ISCR_FUFC_MASK                    (0x800U)
#define M7_MCM_ISCR_FUFC_SHIFT                   (11U)
/*! FUFC - FPU Underflow Interrupt Status
 *  0b0..No interrupt
 *  0b1..Interrupt occurred
 */
#define M7_MCM_ISCR_FUFC(x)                      (((uint32_t)(((uint32_t)(x)) << M7_MCM_ISCR_FUFC_SHIFT)) & M7_MCM_ISCR_FUFC_MASK)

#define M7_MCM_ISCR_FIXC_MASK                    (0x1000U)
#define M7_MCM_ISCR_FIXC_SHIFT                   (12U)
/*! FIXC - FPU Inexact Interrupt Status
 *  0b0..No interrupt
 *  0b1..Interrupt occurred
 */
#define M7_MCM_ISCR_FIXC(x)                      (((uint32_t)(((uint32_t)(x)) << M7_MCM_ISCR_FIXC_SHIFT)) & M7_MCM_ISCR_FIXC_MASK)

#define M7_MCM_ISCR_FIDC_MASK                    (0x8000U)
#define M7_MCM_ISCR_FIDC_SHIFT                   (15U)
/*! FIDC - FPU Input Denormal Interrupt Status
 *  0b0..No interrupt
 *  0b1..Interrupt occurred
 */
#define M7_MCM_ISCR_FIDC(x)                      (((uint32_t)(((uint32_t)(x)) << M7_MCM_ISCR_FIDC_SHIFT)) & M7_MCM_ISCR_FIDC_MASK)

#define M7_MCM_ISCR_WABE_MASK                    (0x200000U)
#define M7_MCM_ISCR_WABE_SHIFT                   (21U)
/*! WABE - TCM Write Abort Interrupt Enable
 *  0b0..Disable interrupt
 *  0b1..Enable interrupt
 */
#define M7_MCM_ISCR_WABE(x)                      (((uint32_t)(((uint32_t)(x)) << M7_MCM_ISCR_WABE_SHIFT)) & M7_MCM_ISCR_WABE_MASK)

#define M7_MCM_ISCR_FIOCE_MASK                   (0x1000000U)
#define M7_MCM_ISCR_FIOCE_SHIFT                  (24U)
/*! FIOCE - FPU Invalid Operation Interrupt Enable
 *  0b0..Disable interrupt
 *  0b1..Enable interrupt
 */
#define M7_MCM_ISCR_FIOCE(x)                     (((uint32_t)(((uint32_t)(x)) << M7_MCM_ISCR_FIOCE_SHIFT)) & M7_MCM_ISCR_FIOCE_MASK)

#define M7_MCM_ISCR_FDZCE_MASK                   (0x2000000U)
#define M7_MCM_ISCR_FDZCE_SHIFT                  (25U)
/*! FDZCE - FPU Divide-by-Zero Interrupt Enable
 *  0b0..Disable interrupt
 *  0b1..Enable interrupt
 */
#define M7_MCM_ISCR_FDZCE(x)                     (((uint32_t)(((uint32_t)(x)) << M7_MCM_ISCR_FDZCE_SHIFT)) & M7_MCM_ISCR_FDZCE_MASK)

#define M7_MCM_ISCR_FOFCE_MASK                   (0x4000000U)
#define M7_MCM_ISCR_FOFCE_SHIFT                  (26U)
/*! FOFCE - FPU Overflow Interrupt Enable
 *  0b0..Disable interrupt
 *  0b1..Enable interrupt
 */
#define M7_MCM_ISCR_FOFCE(x)                     (((uint32_t)(((uint32_t)(x)) << M7_MCM_ISCR_FOFCE_SHIFT)) & M7_MCM_ISCR_FOFCE_MASK)

#define M7_MCM_ISCR_FUFCE_MASK                   (0x8000000U)
#define M7_MCM_ISCR_FUFCE_SHIFT                  (27U)
/*! FUFCE - FPU Underflow Interrupt Enable
 *  0b0..Disable interrupt
 *  0b1..Enable interrupt
 */
#define M7_MCM_ISCR_FUFCE(x)                     (((uint32_t)(((uint32_t)(x)) << M7_MCM_ISCR_FUFCE_SHIFT)) & M7_MCM_ISCR_FUFCE_MASK)

#define M7_MCM_ISCR_FIXCE_MASK                   (0x10000000U)
#define M7_MCM_ISCR_FIXCE_SHIFT                  (28U)
/*! FIXCE - FPU Inexact Interrupt Enable
 *  0b0..Disable interrupt
 *  0b1..Enable interrupt
 */
#define M7_MCM_ISCR_FIXCE(x)                     (((uint32_t)(((uint32_t)(x)) << M7_MCM_ISCR_FIXCE_SHIFT)) & M7_MCM_ISCR_FIXCE_MASK)

#define M7_MCM_ISCR_FIDCE_MASK                   (0x80000000U)
#define M7_MCM_ISCR_FIDCE_SHIFT                  (31U)
/*! FIDCE - FPU Input Denormal Interrupt Enable
 *  0b0..Disable interrupt
 *  0b1..Enable interrupt
 */
#define M7_MCM_ISCR_FIDCE(x)                     (((uint32_t)(((uint32_t)(x)) << M7_MCM_ISCR_FIDCE_SHIFT)) & M7_MCM_ISCR_FIDCE_MASK)
/*! @} */

/*! @name CFGSTCALIB - SysTick Calibration Register */
/*! @{ */

#define M7_MCM_CFGSTCALIB_TENMS_MASK             (0xFFFFFFU)
#define M7_MCM_CFGSTCALIB_TENMS_SHIFT            (0U)
/*! TENMS - Ten milliseconds */
#define M7_MCM_CFGSTCALIB_TENMS(x)               (((uint32_t)(((uint32_t)(x)) << M7_MCM_CFGSTCALIB_TENMS_SHIFT)) & M7_MCM_CFGSTCALIB_TENMS_MASK)

#define M7_MCM_CFGSTCALIB_SKEW_MASK              (0x1000000U)
#define M7_MCM_CFGSTCALIB_SKEW_SHIFT             (24U)
/*! SKEW - Clock Skew
 *  0b0..No clock skew
 *  0b1..Having clock skew
 */
#define M7_MCM_CFGSTCALIB_SKEW(x)                (((uint32_t)(((uint32_t)(x)) << M7_MCM_CFGSTCALIB_SKEW_SHIFT)) & M7_MCM_CFGSTCALIB_SKEW_MASK)

#define M7_MCM_CFGSTCALIB_NOREF_MASK             (0x2000000U)
#define M7_MCM_CFGSTCALIB_NOREF_SHIFT            (25U)
/*! NOREF - No Reference Clock */
#define M7_MCM_CFGSTCALIB_NOREF(x)               (((uint32_t)(((uint32_t)(x)) << M7_MCM_CFGSTCALIB_NOREF_SHIFT)) & M7_MCM_CFGSTCALIB_NOREF_MASK)
/*! @} */

/*! @name PID - Process ID */
/*! @{ */

