JayHeng/imxrt-tool-flash-algo/boards/nxp_evkmimxrt1180_rev.c/flash_algo_c0_silicon/Keil_JLink/rom_api/MIMXRT1189_cm7.h
#define M7_MCM_PID_PID_MASK                      (0xFFU)
#define M7_MCM_PID_PID_SHIFT                     (0U)
/*! PID - Process ID */
#define M7_MCM_PID_PID(x)                        (((uint32_t)(((uint32_t)(x)) << M7_MCM_PID_PID_SHIFT)) & M7_MCM_PID_PID_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group M7_MCM_Register_Masks */


/* M7_MCM - Peripheral instance base addresses */
/** Peripheral M7_MCM base address */
#define M7_MCM_BASE                              (0xE0080000u)
/** Peripheral M7_MCM base pointer */
#define M7_MCM                                   ((M7_MCM_Type *)M7_MCM_BASE)
/** Array initializer of M7_MCM peripheral base addresses */
#define M7_MCM_BASE_ADDRS                        { M7_MCM_BASE }
/** Array initializer of M7_MCM peripheral base pointers */
#define M7_MCM_BASE_PTRS                         { M7_MCM }

/*!
 * @}
 */ /* end of group M7_MCM_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- MECC Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup MECC_Peripheral_Access_Layer MECC Peripheral Access Layer
 * @{
 */

/** MECC - Register Layout Typedef */
typedef struct {
  __IO uint32_t ERR_STATUS;                        /**< Error Interrupt Status, offset: 0x0 */
  __IO uint32_t ERR_STAT_EN;                       /**< Error Interrupt Status Enable, offset: 0x4 */
  __IO uint32_t ERR_SIG_EN;                        /**< Error Interrupt Enable, offset: 0x8 */
  __IO uint32_t ERR_DATA_INJ_LOW0;                 /**< Error Injection on Lower 32 bits of OCRAM Bank 0-3 Write Data, offset: 0xC */
  __IO uint32_t ERR_DATA_INJ_HIGH0;                /**< Error Injection on Upper 32 bits of OCRAM Bank 0-3 Write Data, offset: 0x10 */
  __IO uint32_t ERR_ECC_INJ0;                      /**< ECC Error Injection on OCRAM Bank 0-3 Write Data, offset: 0x14 */
  __IO uint32_t ERR_DATA_INJ_LOW1;                 /**< Error Injection on Lower 32 bits of OCRAM Bank 0-3 Write Data, offset: 0x18 */
  __IO uint32_t ERR_DATA_INJ_HIGH1;                /**< Error Injection on Upper 32 bits of OCRAM Bank 0-3 Write Data, offset: 0x1C */
  __IO uint32_t ERR_ECC_INJ1;                      /**< ECC Error Injection on OCRAM Bank 0-3 Write Data, offset: 0x20 */
  __IO uint32_t ERR_DATA_INJ_LOW2;                 /**< Error Injection on Lower 32 bits of OCRAM Bank 0-3 Write Data, offset: 0x24 */
  __IO uint32_t ERR_DATA_INJ_HIGH2;                /**< Error Injection on Upper 32 bits of OCRAM Bank 0-3 Write Data, offset: 0x28 */
  __IO uint32_t ERR_ECC_INJ2;                      /**< ECC Error Injection on OCRAM Bank 0-3 Write Data, offset: 0x2C */
  __IO uint32_t ERR_DATA_INJ_LOW3;                 /**< Error Injection on Lower 32 bits of OCRAM Bank 0-3 Write Data, offset: 0x30 */
  __IO uint32_t ERR_DATA_INJ_HIGH3;                /**< Error Injection on Upper 32 bits of OCRAM Bank 0-3 Write Data, offset: 0x34 */
  __IO uint32_t ERR_ECC_INJ3;                      /**< ECC Error Injection on OCRAM Bank 0-3 Write Data, offset: 0x38 */
  __I  uint32_t SINGLE_ERR_ADDR_ECC0;              /**< Single-Bit Error Address and ECC code on OCRAM Bank 0-3, offset: 0x3C */
  __I  uint32_t SINGLE_ERR_DATA_LOW0;              /**< Single-Bit Error on Lower 32 Bits of Read Data on OCRAM Bank 0-3, offset: 0x40 */
  __I  uint32_t SINGLE_ERR_DATA_HIGH0;             /**< Single-Bit Error on Upper 32 Bits of Read Data on OCRAM Bank 0-3, offset: 0x44 */
  __I  uint32_t SINGLE_ERR_POS_LOW0;               /**< Lower Single-Bit Error Position on OCRAM Bank 0-3, offset: 0x48 */
  __I  uint32_t SINGLE_ERR_POS_HIGH0;              /**< Upper Single-Bit Error Position on OCRAM Bank 0-3, offset: 0x4C */
  __I  uint32_t SINGLE_ERR_ADDR_ECC1;              /**< Single-Bit Error Address and ECC code on OCRAM Bank 0-3, offset: 0x50 */
  __I  uint32_t SINGLE_ERR_DATA_LOW1;              /**< Single-Bit Error on Lower 32 Bits of Read Data on OCRAM Bank 0-3, offset: 0x54 */
  __I  uint32_t SINGLE_ERR_DATA_HIGH1;             /**< Single-Bit Error on Upper 32 Bits of Read Data on OCRAM Bank 0-3, offset: 0x58 */
  __I  uint32_t SINGLE_ERR_POS_LOW1;               /**< Lower Single-Bit Error Position on OCRAM Bank 0-3, offset: 0x5C */
  __I  uint32_t SINGLE_ERR_POS_HIGH1;              /**< Upper Single-Bit Error Position on OCRAM Bank 0-3, offset: 0x60 */
  __I  uint32_t SINGLE_ERR_ADDR_ECC2;              /**< Single-Bit Error Address and ECC code on OCRAM Bank 0-3, offset: 0x64 */
  __I  uint32_t SINGLE_ERR_DATA_LOW2;              /**< Single-Bit Error on Lower 32 Bits of Read Data on OCRAM Bank 0-3, offset: 0x68 */
  __I  uint32_t SINGLE_ERR_DATA_HIGH2;             /**< Single-Bit Error on Upper 32 Bits of Read Data on OCRAM Bank 0-3, offset: 0x6C */
  __I  uint32_t SINGLE_ERR_POS_LOW2;               /**< Lower Single-Bit Error Position on OCRAM Bank 0-3, offset: 0x70 */
  __I  uint32_t SINGLE_ERR_POS_HIGH2;              /**< Upper Single-Bit Error Position on OCRAM Bank 0-3, offset: 0x74 */
  __I  uint32_t SINGLE_ERR_ADDR_ECC3;              /**< Single-Bit Error Address and ECC code on OCRAM Bank 0-3, offset: 0x78 */
  __I  uint32_t SINGLE_ERR_DATA_LOW3;              /**< Single-Bit Error on Lower 32 Bits of Read Data on OCRAM Bank 0-3, offset: 0x7C */
  __I  uint32_t SINGLE_ERR_DATA_HIGH3;             /**< Single-Bit Error on Upper 32 Bits of Read Data on OCRAM Bank 0-3, offset: 0x80 */
  __I  uint32_t SINGLE_ERR_POS_LOW3;               /**< Lower Single-Bit Error Position on OCRAM Bank 0-3, offset: 0x84 */
  __I  uint32_t SINGLE_ERR_POS_HIGH3;              /**< Upper Single-Bit Error Position on OCRAM Bank 0-3, offset: 0x88 */
  __I  uint32_t MULTI_ERR_ADDR_ECC0;               /**< Multibit Error Address and ECC code on OCRAM Bank 0-3, offset: 0x8C */
  __I  uint32_t MULTI_ERR_DATA_LOW0;               /**< Multibit Error on lower 32 Bits of Read Data on OCRAM Bank 0-3, offset: 0x90 */
  __I  uint32_t MULTI_ERR_DATA_HIGH0;              /**< Multibit Error on Upper 32 Bits of Read Data on OCRAM Bank 0-3, offset: 0x94 */
  __I  uint32_t MULTI_ERR_ADDR_ECC1;               /**< Multibit Error Address and ECC code on OCRAM Bank 0-3, offset: 0x98 */
  __I  uint32_t MULTI_ERR_DATA_LOW1;               /**< Multibit Error on lower 32 Bits of Read Data on OCRAM Bank 0-3, offset: 0x9C */
  __I  uint32_t MULTI_ERR_DATA_HIGH1;              /**< Multibit Error on Upper 32 Bits of Read Data on OCRAM Bank 0-3, offset: 0xA0 */
  __I  uint32_t MULTI_ERR_ADDR_ECC2;               /**< Multibit Error Address and ECC code on OCRAM Bank 0-3, offset: 0xA4 */
  __I  uint32_t MULTI_ERR_DATA_LOW2;               /**< Multibit Error on lower 32 Bits of Read Data on OCRAM Bank 0-3, offset: 0xA8 */
  __I  uint32_t MULTI_ERR_DATA_HIGH2;              /**< Multibit Error on Upper 32 Bits of Read Data on OCRAM Bank 0-3, offset: 0xAC */
  __I  uint32_t MULTI_ERR_ADDR_ECC3;               /**< Multibit Error Address and ECC code on OCRAM Bank 0-3, offset: 0xB0 */
  __I  uint32_t MULTI_ERR_DATA_LOW3;               /**< Multibit Error on lower 32 Bits of Read Data on OCRAM Bank 0-3, offset: 0xB4 */
  __I  uint32_t MULTI_ERR_DATA_HIGH3;              /**< Multibit Error on Upper 32 Bits of Read Data on OCRAM Bank 0-3, offset: 0xB8 */
       uint8_t RESERVED_0[68];
  __IO uint32_t PIPE_ECC_EN;                       /**< OCRAM Pipeline And ECC Enable, offset: 0x100 */
  __I  uint32_t PENDING_STAT;                      /**< Pending Status, offset: 0x104 */
} MECC_Type;

/* ----------------------------------------------------------------------------
   -- MECC Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup MECC_Register_Masks MECC Register Masks
 * @{
 */

