JayHeng/imxrt-tool-flash-algo/boards/nxp_evkmimxrt1180_rev.c/flash_algo_c0_silicon/Keil_JLink/rom_api/MIMXRT1189_cm7.h
/*! @name PICPDSR - Port ingress congestion priority discard status register */
/*! @{ */

#define NETC_ENETC_PICPDSR_DR0_P0DS_MASK         (0x1U)
#define NETC_ENETC_PICPDSR_DR0_P0DS_SHIFT        (0U)
#define NETC_ENETC_PICPDSR_DR0_P0DS(x)           (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PICPDSR_DR0_P0DS_SHIFT)) & NETC_ENETC_PICPDSR_DR0_P0DS_MASK)

#define NETC_ENETC_PICPDSR_DR0_P1DS_MASK         (0x10U)
#define NETC_ENETC_PICPDSR_DR0_P1DS_SHIFT        (4U)
#define NETC_ENETC_PICPDSR_DR0_P1DS(x)           (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PICPDSR_DR0_P1DS_SHIFT)) & NETC_ENETC_PICPDSR_DR0_P1DS_MASK)

#define NETC_ENETC_PICPDSR_DR1_P0DS_MASK         (0x100U)
#define NETC_ENETC_PICPDSR_DR1_P0DS_SHIFT        (8U)
#define NETC_ENETC_PICPDSR_DR1_P0DS(x)           (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PICPDSR_DR1_P0DS_SHIFT)) & NETC_ENETC_PICPDSR_DR1_P0DS_MASK)

#define NETC_ENETC_PICPDSR_DR1_P1DS_MASK         (0x1000U)
#define NETC_ENETC_PICPDSR_DR1_P1DS_SHIFT        (12U)
#define NETC_ENETC_PICPDSR_DR1_P1DS(x)           (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PICPDSR_DR1_P1DS_SHIFT)) & NETC_ENETC_PICPDSR_DR1_P1DS_MASK)

#define NETC_ENETC_PICPDSR_DR2_P0DS_MASK         (0x10000U)
#define NETC_ENETC_PICPDSR_DR2_P0DS_SHIFT        (16U)
#define NETC_ENETC_PICPDSR_DR2_P0DS(x)           (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PICPDSR_DR2_P0DS_SHIFT)) & NETC_ENETC_PICPDSR_DR2_P0DS_MASK)

#define NETC_ENETC_PICPDSR_DR2_P1DS_MASK         (0x100000U)
#define NETC_ENETC_PICPDSR_DR2_P1DS_SHIFT        (20U)
#define NETC_ENETC_PICPDSR_DR2_P1DS(x)           (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PICPDSR_DR2_P1DS_SHIFT)) & NETC_ENETC_PICPDSR_DR2_P1DS_MASK)

#define NETC_ENETC_PICPDSR_DR3_P0DS_MASK         (0x1000000U)
#define NETC_ENETC_PICPDSR_DR3_P0DS_SHIFT        (24U)
#define NETC_ENETC_PICPDSR_DR3_P0DS(x)           (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PICPDSR_DR3_P0DS_SHIFT)) & NETC_ENETC_PICPDSR_DR3_P0DS_MASK)

#define NETC_ENETC_PICPDSR_DR3_P1DS_MASK         (0x10000000U)
#define NETC_ENETC_PICPDSR_DR3_P1DS_SHIFT        (28U)
#define NETC_ENETC_PICPDSR_DR3_P1DS(x)           (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PICPDSR_DR3_P1DS_SHIFT)) & NETC_ENETC_PICPDSR_DR3_P1DS_MASK)
/*! @} */

/*! @name PSIPMMR - Port station interface promiscuous MAC mode register */
/*! @{ */

#define NETC_ENETC_PSIPMMR_SI0_MAC_UP_MASK       (0x1U)
#define NETC_ENETC_PSIPMMR_SI0_MAC_UP_SHIFT      (0U)
/*! SI0_MAC_UP
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define NETC_ENETC_PSIPMMR_SI0_MAC_UP(x)         (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PSIPMMR_SI0_MAC_UP_SHIFT)) & NETC_ENETC_PSIPMMR_SI0_MAC_UP_MASK)

#define NETC_ENETC_PSIPMMR_SI1_MAC_UP_MASK       (0x2U)
#define NETC_ENETC_PSIPMMR_SI1_MAC_UP_SHIFT      (1U)
/*! SI1_MAC_UP
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define NETC_ENETC_PSIPMMR_SI1_MAC_UP(x)         (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PSIPMMR_SI1_MAC_UP_SHIFT)) & NETC_ENETC_PSIPMMR_SI1_MAC_UP_MASK)

#define NETC_ENETC_PSIPMMR_SI0_MAC_MP_MASK       (0x10000U)
#define NETC_ENETC_PSIPMMR_SI0_MAC_MP_SHIFT      (16U)
/*! SI0_MAC_MP
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define NETC_ENETC_PSIPMMR_SI0_MAC_MP(x)         (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PSIPMMR_SI0_MAC_MP_SHIFT)) & NETC_ENETC_PSIPMMR_SI0_MAC_MP_MASK)

#define NETC_ENETC_PSIPMMR_SI1_MAC_MP_MASK       (0x20000U)
#define NETC_ENETC_PSIPMMR_SI1_MAC_MP_SHIFT      (17U)
/*! SI1_MAC_MP
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define NETC_ENETC_PSIPMMR_SI1_MAC_MP(x)         (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PSIPMMR_SI1_MAC_MP_SHIFT)) & NETC_ENETC_PSIPMMR_SI1_MAC_MP_MASK)
/*! @} */

/*! @name PSIPVMR - Port station interface promiscuous VLAN mode register */
/*! @{ */

#define NETC_ENETC_PSIPVMR_SI0_VLAN_P_MASK       (0x1U)
#define NETC_ENETC_PSIPVMR_SI0_VLAN_P_SHIFT      (0U)
/*! SI0_VLAN_P
 *  0b0..SI 0 does not qualify for the reception of all VLAN tags
 *  0b1..SI 0 does qualify for the reception of all VLAN tags
 */
#define NETC_ENETC_PSIPVMR_SI0_VLAN_P(x)         (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PSIPVMR_SI0_VLAN_P_SHIFT)) & NETC_ENETC_PSIPVMR_SI0_VLAN_P_MASK)

#define NETC_ENETC_PSIPVMR_SI1_VLAN_P_MASK       (0x2U)
#define NETC_ENETC_PSIPVMR_SI1_VLAN_P_SHIFT      (1U)
/*! SI1_VLAN_P
 *  0b0..SI 1 does not qualify for the reception of all VLAN tags
 *  0b1..SI 1 does qualify for the reception of all VLAN tags
 */
#define NETC_ENETC_PSIPVMR_SI1_VLAN_P(x)         (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PSIPVMR_SI1_VLAN_P_SHIFT)) & NETC_ENETC_PSIPVMR_SI1_VLAN_P_MASK)

#define NETC_ENETC_PSIPVMR_SI0_VLAN_UTA_MASK     (0x10000U)
#define NETC_ENETC_PSIPVMR_SI0_VLAN_UTA_SHIFT    (16U)
/*! SI0_VLAN_UTA
 *  0b0..SI 0 does not qualify for reception of untagged frames
 *  0b1..SI 0 does qualify for reception of untagged frames
 */
#define NETC_ENETC_PSIPVMR_SI0_VLAN_UTA(x)       (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PSIPVMR_SI0_VLAN_UTA_SHIFT)) & NETC_ENETC_PSIPVMR_SI0_VLAN_UTA_MASK)

#define NETC_ENETC_PSIPVMR_SI1_VLAN_UTA_MASK     (0x20000U)
#define NETC_ENETC_PSIPVMR_SI1_VLAN_UTA_SHIFT    (17U)
/*! SI1_VLAN_UTA
 *  0b0..SI 1 does not qualify for reception of untagged frames
 *  0b1..SI 1 does qualify for reception of untagged frames
 */
#define NETC_ENETC_PSIPVMR_SI1_VLAN_UTA(x)       (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PSIPVMR_SI1_VLAN_UTA_SHIFT)) & NETC_ENETC_PSIPVMR_SI1_VLAN_UTA_MASK)
/*! @} */

/*! @name PBFDSIR - Port broadcast frames dropped due to MAC filtering register */
/*! @{ */

#define NETC_ENETC_PBFDSIR_FRAME_DROP_MASK       (0xFFFFFFFFU)
#define NETC_ENETC_PBFDSIR_FRAME_DROP_SHIFT      (0U)
#define NETC_ENETC_PBFDSIR_FRAME_DROP(x)         (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PBFDSIR_FRAME_DROP_SHIFT)) & NETC_ENETC_PBFDSIR_FRAME_DROP_MASK)
/*! @} */

/*! @name PFDMSAPR - Port frame drop MAC source address pruning register */
/*! @{ */

#define NETC_ENETC_PFDMSAPR_FRAME_DROP_MASK      (0xFFFFFFFFU)
#define NETC_ENETC_PFDMSAPR_FRAME_DROP_SHIFT     (0U)
#define NETC_ENETC_PFDMSAPR_FRAME_DROP(x)        (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PFDMSAPR_FRAME_DROP_SHIFT)) & NETC_ENETC_PFDMSAPR_FRAME_DROP_MASK)
/*! @} */

/*! @name PSIMAFCAPR - Port station interface MAC address filtering capability register */
/*! @{ */

