JayHeng/imxrt-tool-flash-algo/boards/nxp_evkmimxrt1180_rev.c/flash_algo_c0_silicon/Keil_JLink/rom_api/MIMXRT1189_cm7.h
#define NETC_ETH_LINK_PM1_IF_MODE_HD_MASK        (0x40U)
#define NETC_ETH_LINK_PM1_IF_MODE_HD_SHIFT       (6U)
/*! HD - Half-duplex
 *  0b0..full duplex
 *  0b1..half duplex
 */
#define NETC_ETH_LINK_PM1_IF_MODE_HD(x)          (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM1_IF_MODE_HD_SHIFT)) & NETC_ETH_LINK_PM1_IF_MODE_HD_MASK)

#define NETC_ETH_LINK_PM1_IF_MODE_CLK_STOP_MASK  (0x1000U)
#define NETC_ETH_LINK_PM1_IF_MODE_CLK_STOP_SHIFT (12U)
/*! CLK_STOP - Clock Stop
 *  0b0..Not stoppable
 *  0b1..Stoppable
 */
#define NETC_ETH_LINK_PM1_IF_MODE_CLK_STOP(x)    (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM1_IF_MODE_CLK_STOP_SHIFT)) & NETC_ETH_LINK_PM1_IF_MODE_CLK_STOP_MASK)

#define NETC_ETH_LINK_PM1_IF_MODE_SSP_MASK       (0x6000U)
#define NETC_ETH_LINK_PM1_IF_MODE_SSP_SHIFT      (13U)
/*! SSP - Set Speed
 *  0b00..100 Mbps
 *  0b01..10 Mbps
 *  0b10..1 Gbps
 *  0b11..reserved
 */
#define NETC_ETH_LINK_PM1_IF_MODE_SSP(x)         (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM1_IF_MODE_SSP_SHIFT)) & NETC_ETH_LINK_PM1_IF_MODE_SSP_MASK)
/*! @} */

/*! @name MAC_MERGE_MMCSR - Port MAC Merge Control and Status Register */
/*! @{ */

#define NETC_ETH_LINK_MAC_MERGE_MMCSR_LPS_MASK   (0x1U)
#define NETC_ETH_LINK_MAC_MERGE_MMCSR_LPS_SHIFT  (0U)
/*! LPS - Local preemption supported */
#define NETC_ETH_LINK_MAC_MERGE_MMCSR_LPS(x)     (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_MAC_MERGE_MMCSR_LPS_SHIFT)) & NETC_ETH_LINK_MAC_MERGE_MMCSR_LPS_MASK)

#define NETC_ETH_LINK_MAC_MERGE_MMCSR_LPE_MASK   (0x2U)
#define NETC_ETH_LINK_MAC_MERGE_MMCSR_LPE_SHIFT  (1U)
/*! LPE - Local preemption enabled */
#define NETC_ETH_LINK_MAC_MERGE_MMCSR_LPE(x)     (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_MAC_MERGE_MMCSR_LPE_SHIFT)) & NETC_ETH_LINK_MAC_MERGE_MMCSR_LPE_MASK)

#define NETC_ETH_LINK_MAC_MERGE_MMCSR_LPA_MASK   (0x4U)
#define NETC_ETH_LINK_MAC_MERGE_MMCSR_LPA_SHIFT  (2U)
/*! LPA - Local preemption active */
#define NETC_ETH_LINK_MAC_MERGE_MMCSR_LPA(x)     (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_MAC_MERGE_MMCSR_LPA_SHIFT)) & NETC_ETH_LINK_MAC_MERGE_MMCSR_LPA_MASK)

#define NETC_ETH_LINK_MAC_MERGE_MMCSR_LAFS_MASK  (0x18U)
#define NETC_ETH_LINK_MAC_MERGE_MMCSR_LAFS_SHIFT (3U)
/*! LAFS - Local additional fragment size */
#define NETC_ETH_LINK_MAC_MERGE_MMCSR_LAFS(x)    (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_MAC_MERGE_MMCSR_LAFS_SHIFT)) & NETC_ETH_LINK_MAC_MERGE_MMCSR_LAFS_MASK)

#define NETC_ETH_LINK_MAC_MERGE_MMCSR_RPS_MASK   (0x20U)
#define NETC_ETH_LINK_MAC_MERGE_MMCSR_RPS_SHIFT  (5U)
/*! RPS - Remote preemption supported */
#define NETC_ETH_LINK_MAC_MERGE_MMCSR_RPS(x)     (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_MAC_MERGE_MMCSR_RPS_SHIFT)) & NETC_ETH_LINK_MAC_MERGE_MMCSR_RPS_MASK)

#define NETC_ETH_LINK_MAC_MERGE_MMCSR_RPE_MASK   (0x40U)
#define NETC_ETH_LINK_MAC_MERGE_MMCSR_RPE_SHIFT  (6U)
/*! RPE - Remote preemption enabled */
#define NETC_ETH_LINK_MAC_MERGE_MMCSR_RPE(x)     (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_MAC_MERGE_MMCSR_RPE_SHIFT)) & NETC_ETH_LINK_MAC_MERGE_MMCSR_RPE_MASK)

#define NETC_ETH_LINK_MAC_MERGE_MMCSR_RPA_MASK   (0x80U)
#define NETC_ETH_LINK_MAC_MERGE_MMCSR_RPA_SHIFT  (7U)
/*! RPA - Remote preemption active */
#define NETC_ETH_LINK_MAC_MERGE_MMCSR_RPA(x)     (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_MAC_MERGE_MMCSR_RPA_SHIFT)) & NETC_ETH_LINK_MAC_MERGE_MMCSR_RPA_MASK)

#define NETC_ETH_LINK_MAC_MERGE_MMCSR_RAFS_MASK  (0x300U)
#define NETC_ETH_LINK_MAC_MERGE_MMCSR_RAFS_SHIFT (8U)
/*! RAFS - Remote additional fragment size */
#define NETC_ETH_LINK_MAC_MERGE_MMCSR_RAFS(x)    (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_MAC_MERGE_MMCSR_RAFS_SHIFT)) & NETC_ETH_LINK_MAC_MERGE_MMCSR_RAFS_MASK)

#define NETC_ETH_LINK_MAC_MERGE_MMCSR_ME_MASK    (0x18000U)
#define NETC_ETH_LINK_MAC_MERGE_MMCSR_ME_SHIFT   (15U)
/*! ME - Merge enabled */
#define NETC_ETH_LINK_MAC_MERGE_MMCSR_ME(x)      (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_MAC_MERGE_MMCSR_ME_SHIFT)) & NETC_ETH_LINK_MAC_MERGE_MMCSR_ME_MASK)

#define NETC_ETH_LINK_MAC_MERGE_MMCSR_VDIS_MASK  (0x20000U)
#define NETC_ETH_LINK_MAC_MERGE_MMCSR_VDIS_SHIFT (17U)
/*! VDIS - Verify disabled */
#define NETC_ETH_LINK_MAC_MERGE_MMCSR_VDIS(x)    (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_MAC_MERGE_MMCSR_VDIS_SHIFT)) & NETC_ETH_LINK_MAC_MERGE_MMCSR_VDIS_MASK)

#define NETC_ETH_LINK_MAC_MERGE_MMCSR_VSTS_MASK  (0x1C0000U)
#define NETC_ETH_LINK_MAC_MERGE_MMCSR_VSTS_SHIFT (18U)
/*! VSTS - Verify status */
#define NETC_ETH_LINK_MAC_MERGE_MMCSR_VSTS(x)    (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_MAC_MERGE_MMCSR_VSTS_SHIFT)) & NETC_ETH_LINK_MAC_MERGE_MMCSR_VSTS_MASK)

#define NETC_ETH_LINK_MAC_MERGE_MMCSR_TXSTS_MASK (0x600000U)
#define NETC_ETH_LINK_MAC_MERGE_MMCSR_TXSTS_SHIFT (21U)
/*! TXSTS - Merge status */
#define NETC_ETH_LINK_MAC_MERGE_MMCSR_TXSTS(x)   (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_MAC_MERGE_MMCSR_TXSTS_SHIFT)) & NETC_ETH_LINK_MAC_MERGE_MMCSR_TXSTS_MASK)

#define NETC_ETH_LINK_MAC_MERGE_MMCSR_VT_MASK    (0x3F800000U)
#define NETC_ETH_LINK_MAC_MERGE_MMCSR_VT_SHIFT   (23U)
/*! VT - Verify Time */
#define NETC_ETH_LINK_MAC_MERGE_MMCSR_VT(x)      (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_MAC_MERGE_MMCSR_VT_SHIFT)) & NETC_ETH_LINK_MAC_MERGE_MMCSR_VT_MASK)

#define NETC_ETH_LINK_MAC_MERGE_MMCSR_LINK_FAIL_MASK (0x80000000U)
#define NETC_ETH_LINK_MAC_MERGE_MMCSR_LINK_FAIL_SHIFT (31U)
/*! LINK_FAIL - Link Fail */
#define NETC_ETH_LINK_MAC_MERGE_MMCSR_LINK_FAIL(x) (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_MAC_MERGE_MMCSR_LINK_FAIL_SHIFT)) & NETC_ETH_LINK_MAC_MERGE_MMCSR_LINK_FAIL_MASK)
/*! @} */

/*! @name MAC_MERGE_MMFAECR - Port MAC Merge Frame Assembly Error Count Register */
/*! @{ */

#define NETC_ETH_LINK_MAC_MERGE_MMFAECR_MMFAEC_MASK (0xFFFFFFFFU)
#define NETC_ETH_LINK_MAC_MERGE_MMFAECR_MMFAEC_SHIFT (0U)
#define NETC_ETH_LINK_MAC_MERGE_MMFAECR_MMFAEC(x) (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_MAC_MERGE_MMFAECR_MMFAEC_SHIFT)) & NETC_ETH_LINK_MAC_MERGE_MMFAECR_MMFAEC_MASK)
/*! @} */

/*! @name MAC_MERGE_MMFSECR - Port MAC Merge Frame SMD Error Count Register */
/*! @{ */

#define NETC_ETH_LINK_MAC_MERGE_MMFSECR_MMFSEC_MASK (0xFFFFFFFFU)
#define NETC_ETH_LINK_MAC_MERGE_MMFSECR_MMFSEC_SHIFT (0U)
#define NETC_ETH_LINK_MAC_MERGE_MMFSECR_MMFSEC(x) (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_MAC_MERGE_MMFSECR_MMFSEC_SHIFT)) & NETC_ETH_LINK_MAC_MERGE_MMFSECR_MMFSEC_MASK)
/*! @} */

/*! @name MAC_MERGE_MMFAOCR - Port MAC Merge Frame Assembly OK Count Register */
/*! @{ */

#define NETC_ETH_LINK_MAC_MERGE_MMFAOCR_MMFAOC_MASK (0xFFFFFFFFU)
#define NETC_ETH_LINK_MAC_MERGE_MMFAOCR_MMFAOC_SHIFT (0U)
#define NETC_ETH_LINK_MAC_MERGE_MMFAOCR_MMFAOC(x) (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_MAC_MERGE_MMFAOCR_MMFAOC_SHIFT)) & NETC_ETH_LINK_MAC_MERGE_MMFAOCR_MMFAOC_MASK)
/*! @} */

