JayHeng/imxrt-tool-flash-algo/boards/nxp_evkmimxrt1180_rev.c/flash_algo_c0_silicon/Keil_JLink/rom_api/MIMXRT1189_cm7.h
/*! @name PEMDIOICR - Port external MDIO interface control register */
/*! @{ */

#define NETC_ETH_LINK_PEMDIOICR_DEV_ADDR_MASK    (0x1FU)
#define NETC_ETH_LINK_PEMDIOICR_DEV_ADDR_SHIFT   (0U)
/*! DEV_ADDR - 5-bit MDIO device address (Clause 45) / register address (Clause 22) */
#define NETC_ETH_LINK_PEMDIOICR_DEV_ADDR(x)      (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PEMDIOICR_DEV_ADDR_SHIFT)) & NETC_ETH_LINK_PEMDIOICR_DEV_ADDR_MASK)

#define NETC_ETH_LINK_PEMDIOICR_PORT_ADDR_MASK   (0x3E0U)
#define NETC_ETH_LINK_PEMDIOICR_PORT_ADDR_SHIFT  (5U)
/*! PORT_ADDR - 5-bit MDIO port address (Clause 45) / PHY address (Clause 22) */
#define NETC_ETH_LINK_PEMDIOICR_PORT_ADDR(x)     (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PEMDIOICR_PORT_ADDR_SHIFT)) & NETC_ETH_LINK_PEMDIOICR_PORT_ADDR_MASK)

#define NETC_ETH_LINK_PEMDIOICR_POST_INC_MASK    (0x4000U)
#define NETC_ETH_LINK_PEMDIOICR_POST_INC_SHIFT   (14U)
/*! POST_INC - MDIO read with address post-increment initiation. Self-clearing once transaction is complete. */
#define NETC_ETH_LINK_PEMDIOICR_POST_INC(x)      (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PEMDIOICR_POST_INC_SHIFT)) & NETC_ETH_LINK_PEMDIOICR_POST_INC_MASK)

#define NETC_ETH_LINK_PEMDIOICR_READ_MASK        (0x8000U)
#define NETC_ETH_LINK_PEMDIOICR_READ_SHIFT       (15U)
/*! READ - MDIO read initiation. */
#define NETC_ETH_LINK_PEMDIOICR_READ(x)          (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PEMDIOICR_READ_SHIFT)) & NETC_ETH_LINK_PEMDIOICR_READ_MASK)

#define NETC_ETH_LINK_PEMDIOICR_BSY_MASK         (0x80000000U)
#define NETC_ETH_LINK_PEMDIOICR_BSY_SHIFT        (31U)
/*! BSY - MDIO busy */
#define NETC_ETH_LINK_PEMDIOICR_BSY(x)           (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PEMDIOICR_BSY_SHIFT)) & NETC_ETH_LINK_PEMDIOICR_BSY_MASK)
/*! @} */

/*! @name PEMDIOIDR - Port external MDIO interface data register */
/*! @{ */

#define NETC_ETH_LINK_PEMDIOIDR_MDIO_DATA_MASK   (0xFFFFU)
#define NETC_ETH_LINK_PEMDIOIDR_MDIO_DATA_SHIFT  (0U)
/*! MDIO_DATA - 16-bit MDIO data. */
#define NETC_ETH_LINK_PEMDIOIDR_MDIO_DATA(x)     (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PEMDIOIDR_MDIO_DATA_SHIFT)) & NETC_ETH_LINK_PEMDIOIDR_MDIO_DATA_MASK)
/*! @} */

/*! @name PEMDIORAR - Port external MDIO register address register */
/*! @{ */

#define NETC_ETH_LINK_PEMDIORAR_REGADDR_MASK     (0xFFFFU)
#define NETC_ETH_LINK_PEMDIORAR_REGADDR_SHIFT    (0U)
/*! REGADDR - MDIO PHY register address. */
#define NETC_ETH_LINK_PEMDIORAR_REGADDR(x)       (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PEMDIORAR_REGADDR_SHIFT)) & NETC_ETH_LINK_PEMDIORAR_REGADDR_MASK)
/*! @} */

/*! @name PEMDIOSR - Port external MDIO status register */
/*! @{ */

#define NETC_ETH_LINK_PEMDIOSR_BSY_MASK          (0x1U)
#define NETC_ETH_LINK_PEMDIOSR_BSY_SHIFT         (0U)
/*! BSY - Global MDIO busy */
#define NETC_ETH_LINK_PEMDIOSR_BSY(x)            (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PEMDIOSR_BSY_SHIFT)) & NETC_ETH_LINK_PEMDIOSR_BSY_MASK)

#define NETC_ETH_LINK_PEMDIOSR_WHT_LIST_MASK     (0x1F00U)
#define NETC_ETH_LINK_PEMDIOSR_WHT_LIST_SHIFT    (8U)
/*! WHT_LIST - PHY white list */
#define NETC_ETH_LINK_PEMDIOSR_WHT_LIST(x)       (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PEMDIOSR_WHT_LIST_SHIFT)) & NETC_ETH_LINK_PEMDIOSR_WHT_LIST_MASK)

#define NETC_ETH_LINK_PEMDIOSR_WHT_LIST_ENA_MASK (0x8000U)
#define NETC_ETH_LINK_PEMDIOSR_WHT_LIST_ENA_SHIFT (15U)
/*! WHT_LIST_ENA - PHY white list enable */
#define NETC_ETH_LINK_PEMDIOSR_WHT_LIST_ENA(x)   (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PEMDIOSR_WHT_LIST_ENA_SHIFT)) & NETC_ETH_LINK_PEMDIOSR_WHT_LIST_ENA_MASK)

#define NETC_ETH_LINK_PEMDIOSR_PORT_ID_MASK      (0x70000U)
#define NETC_ETH_LINK_PEMDIOSR_PORT_ID_SHIFT     (16U)
/*! PORT_ID - Port ID */
#define NETC_ETH_LINK_PEMDIOSR_PORT_ID(x)        (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PEMDIOSR_PORT_ID_SHIFT)) & NETC_ETH_LINK_PEMDIOSR_PORT_ID_MASK)

#define NETC_ETH_LINK_PEMDIOSR_REQ_TYPE_MASK     (0x80000U)
#define NETC_ETH_LINK_PEMDIOSR_REQ_TYPE_SHIFT    (19U)
/*! REQ_TYPE - Port ID */
#define NETC_ETH_LINK_PEMDIOSR_REQ_TYPE(x)       (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PEMDIOSR_REQ_TYPE_SHIFT)) & NETC_ETH_LINK_PEMDIOSR_REQ_TYPE_MASK)
/*! @} */

/*! @name PPSCR - PHY status configuration register */
/*! @{ */

#define NETC_ETH_LINK_PPSCR_BSY_MASK             (0x1U)
#define NETC_ETH_LINK_PPSCR_BSY_SHIFT            (0U)
/*! BSY - MDIO busy */
#define NETC_ETH_LINK_PPSCR_BSY(x)               (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PPSCR_BSY_SHIFT)) & NETC_ETH_LINK_PPSCR_BSY_MASK)

#define NETC_ETH_LINK_PPSCR_MDIO_RD_ER_MASK      (0x2U)
#define NETC_ETH_LINK_PPSCR_MDIO_RD_ER_SHIFT     (1U)
/*! MDIO_RD_ER - MDIO read error */
#define NETC_ETH_LINK_PPSCR_MDIO_RD_ER(x)        (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PPSCR_MDIO_RD_ER_SHIFT)) & NETC_ETH_LINK_PPSCR_MDIO_RD_ER_MASK)

#define NETC_ETH_LINK_PPSCR_STATUS_INTERVAL_MASK (0xFFFF0000U)
#define NETC_ETH_LINK_PPSCR_STATUS_INTERVAL_SHIFT (16U)
/*! STATUS_INTERVAL - PHY status read interval */
#define NETC_ETH_LINK_PPSCR_STATUS_INTERVAL(x)   (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PPSCR_STATUS_INTERVAL_SHIFT)) & NETC_ETH_LINK_PPSCR_STATUS_INTERVAL_MASK)
/*! @} */

/*! @name PPSCTRLR - Port PHY status control register */
/*! @{ */

#define NETC_ETH_LINK_PPSCTRLR_DEV_ADDR_MASK     (0x1FU)
#define NETC_ETH_LINK_PPSCTRLR_DEV_ADDR_SHIFT    (0U)
/*! DEV_ADDR - 5-bit MDIO device address (Clause 45) / register address (Clause 22) */
#define NETC_ETH_LINK_PPSCTRLR_DEV_ADDR(x)       (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PPSCTRLR_DEV_ADDR_SHIFT)) & NETC_ETH_LINK_PPSCTRLR_DEV_ADDR_MASK)

#define NETC_ETH_LINK_PPSCTRLR_PORT_ADDR_MASK    (0x3E0U)
#define NETC_ETH_LINK_PPSCTRLR_PORT_ADDR_SHIFT   (5U)
/*! PORT_ADDR - 5-bit MDIO port address (Clause 45) / PHY address (Clause 22) */
#define NETC_ETH_LINK_PPSCTRLR_PORT_ADDR(x)      (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PPSCTRLR_PORT_ADDR_SHIFT)) & NETC_ETH_LINK_PPSCTRLR_PORT_ADDR_MASK)
/*! @} */

/*! @name PPSDR - Port PHY status data register */
/*! @{ */

