JayHeng/imxrt-tool-flash-algo/boards/nxp_evkmimxrt1180_rev.c/flash_algo_c0_silicon/Keil_JLink/rom_api/MIMXRT1189_cm7.h
/*! @name PCAPR - Port capability register */
/*! @{ */

#define NETC_PORT_PCAPR_LINK_TYPE_MASK           (0x10U)
#define NETC_PORT_PCAPR_LINK_TYPE_SHIFT          (4U)
#define NETC_PORT_PCAPR_LINK_TYPE(x)             (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PCAPR_LINK_TYPE_SHIFT)) & NETC_PORT_PCAPR_LINK_TYPE_MASK)

#define NETC_PORT_PCAPR_NUM_TC_MASK              (0xF000U)
#define NETC_PORT_PCAPR_NUM_TC_SHIFT             (12U)
#define NETC_PORT_PCAPR_NUM_TC(x)                (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PCAPR_NUM_TC_SHIFT)) & NETC_PORT_PCAPR_NUM_TC_MASK)

#define NETC_PORT_PCAPR_NUM_Q_MASK               (0xF0000U)
#define NETC_PORT_PCAPR_NUM_Q_SHIFT              (16U)
#define NETC_PORT_PCAPR_NUM_Q(x)                 (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PCAPR_NUM_Q_SHIFT)) & NETC_PORT_PCAPR_NUM_Q_MASK)

#define NETC_PORT_PCAPR_NUM_CG_MASK              (0xF000000U)
#define NETC_PORT_PCAPR_NUM_CG_SHIFT             (24U)
#define NETC_PORT_PCAPR_NUM_CG(x)                (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PCAPR_NUM_CG_SHIFT)) & NETC_PORT_PCAPR_NUM_CG_MASK)

#define NETC_PORT_PCAPR_TGS_MASK                 (0x10000000U)
#define NETC_PORT_PCAPR_TGS_SHIFT                (28U)
/*! TGS - Time Gate Scheduling */
#define NETC_PORT_PCAPR_TGS(x)                   (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PCAPR_TGS_SHIFT)) & NETC_PORT_PCAPR_TGS_MASK)

#define NETC_PORT_PCAPR_CBS_MASK                 (0x20000000U)
#define NETC_PORT_PCAPR_CBS_SHIFT                (29U)
/*! CBS - Credit Based Shaping */
#define NETC_PORT_PCAPR_CBS(x)                   (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PCAPR_CBS_SHIFT)) & NETC_PORT_PCAPR_CBS_MASK)
/*! @} */

/*! @name PMCAPR - Port MAC capability register */
/*! @{ */

#define NETC_PORT_PMCAPR_MAC_VAR_MASK            (0x7U)
#define NETC_PORT_PMCAPR_MAC_VAR_SHIFT           (0U)
/*! MAC_VAR - MAC Variant */
#define NETC_PORT_PMCAPR_MAC_VAR(x)              (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PMCAPR_MAC_VAR_SHIFT)) & NETC_PORT_PMCAPR_MAC_VAR_MASK)

#define NETC_PORT_PMCAPR_EFPAD_MASK              (0x30U)
#define NETC_PORT_PMCAPR_EFPAD_SHIFT             (4U)
#define NETC_PORT_PMCAPR_EFPAD(x)                (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PMCAPR_EFPAD_SHIFT)) & NETC_PORT_PMCAPR_EFPAD_MASK)

#define NETC_PORT_PMCAPR_PIPG_MASK               (0x40U)
#define NETC_PORT_PMCAPR_PIPG_SHIFT              (6U)
#define NETC_PORT_PMCAPR_PIPG(x)                 (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PMCAPR_PIPG_SHIFT)) & NETC_PORT_PMCAPR_PIPG_MASK)

#define NETC_PORT_PMCAPR_HD_MASK                 (0x100U)
#define NETC_PORT_PMCAPR_HD_SHIFT                (8U)
#define NETC_PORT_PMCAPR_HD(x)                   (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PMCAPR_HD_SHIFT)) & NETC_PORT_PMCAPR_HD_MASK)

#define NETC_PORT_PMCAPR_FP_MASK                 (0x600U)
#define NETC_PORT_PMCAPR_FP_SHIFT                (9U)
/*! FP - Indicates if frame preemption is supported */
#define NETC_PORT_PMCAPR_FP(x)                   (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PMCAPR_FP_SHIFT)) & NETC_PORT_PMCAPR_FP_MASK)

#define NETC_PORT_PMCAPR_MIN_MPDU_MASK           (0x1000U)
#define NETC_PORT_PMCAPR_MIN_MPDU_SHIFT          (12U)
/*! MIN_MPDU - Minimum MAC Protocol Data Unit (PDU) size check */
#define NETC_PORT_PMCAPR_MIN_MPDU(x)             (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PMCAPR_MIN_MPDU_SHIFT)) & NETC_PORT_PMCAPR_MIN_MPDU_MASK)

#define NETC_PORT_PMCAPR_MII_PROT_MASK           (0xF000000U)
#define NETC_PORT_PMCAPR_MII_PROT_SHIFT          (24U)
/*! MII_PROT - Indicates the MII protocol supported */
#define NETC_PORT_PMCAPR_MII_PROT(x)             (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PMCAPR_MII_PROT_SHIFT)) & NETC_PORT_PMCAPR_MII_PROT_MASK)
/*! @} */

/*! @name PIOCAPR - Port I/O capability register */
/*! @{ */

#define NETC_PORT_PIOCAPR_PCS_PROT_MASK          (0xFFFFU)
#define NETC_PORT_PIOCAPR_PCS_PROT_SHIFT         (0U)
/*! PCS_PROT - PCS protocols supported */
#define NETC_PORT_PIOCAPR_PCS_PROT(x)            (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PIOCAPR_PCS_PROT_SHIFT)) & NETC_PORT_PIOCAPR_PCS_PROT_MASK)

#define NETC_PORT_PIOCAPR_IO_VAR_MASK            (0xF000000U)
#define NETC_PORT_PIOCAPR_IO_VAR_SHIFT           (24U)
/*! IO_VAR - IO Variants supported */
#define NETC_PORT_PIOCAPR_IO_VAR(x)              (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PIOCAPR_IO_VAR_SHIFT)) & NETC_PORT_PIOCAPR_IO_VAR_MASK)

#define NETC_PORT_PIOCAPR_EMDIO_MASK             (0x10000000U)
#define NETC_PORT_PIOCAPR_EMDIO_SHIFT            (28U)
#define NETC_PORT_PIOCAPR_EMDIO(x)               (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PIOCAPR_EMDIO_SHIFT)) & NETC_PORT_PIOCAPR_EMDIO_MASK)

#define NETC_PORT_PIOCAPR_REVMII_RATE_MASK       (0x40000000U)
#define NETC_PORT_PIOCAPR_REVMII_RATE_SHIFT      (30U)
/*! REVMII_RATE - RevMII MII rate */
#define NETC_PORT_PIOCAPR_REVMII_RATE(x)         (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PIOCAPR_REVMII_RATE_SHIFT)) & NETC_PORT_PIOCAPR_REVMII_RATE_MASK)

#define NETC_PORT_PIOCAPR_REVMII_MASK            (0x80000000U)
#define NETC_PORT_PIOCAPR_REVMII_SHIFT           (31U)
/*! REVMII - Reverse Mode Device Configuration */
#define NETC_PORT_PIOCAPR_REVMII(x)              (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PIOCAPR_REVMII_SHIFT)) & NETC_PORT_PIOCAPR_REVMII_MASK)
/*! @} */

/*! @name PCR - Port configuration register */
/*! @{ */

#define NETC_PORT_PCR_HDR_FMT_MASK               (0x1U)
#define NETC_PORT_PCR_HDR_FMT_SHIFT              (0U)
#define NETC_PORT_PCR_HDR_FMT(x)                 (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PCR_HDR_FMT_SHIFT)) & NETC_PORT_PCR_HDR_FMT_MASK)

#define NETC_PORT_PCR_L2DOSE_MASK                (0x10U)
#define NETC_PORT_PCR_L2DOSE_SHIFT               (4U)
#define NETC_PORT_PCR_L2DOSE(x)                  (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PCR_L2DOSE_SHIFT)) & NETC_PORT_PCR_L2DOSE_MASK)

#define NETC_PORT_PCR_TIMER_CS_MASK              (0x100U)
#define NETC_PORT_PCR_TIMER_CS_SHIFT             (8U)
#define NETC_PORT_PCR_TIMER_CS(x)                (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PCR_TIMER_CS_SHIFT)) & NETC_PORT_PCR_TIMER_CS_MASK)

