JayHeng/imxrt-tool-flash-algo/boards/nxp_evkmimxrt1180_rev.c/flash_algo_c0_silicon/Keil_JLink/rom_api/MIMXRT1189_cm7.h
#define NETC_PORT_PPCR_L4PFS_MASK                (0x3E000000U)
#define NETC_PORT_PPCR_L4PFS_SHIFT               (25U)
/*! L4PFS - L4 payload fields size in bytes */
#define NETC_PORT_PPCR_L4PFS(x)                  (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PPCR_L4PFS_SHIFT)) & NETC_PORT_PPCR_L4PFS_MASK)
/*! @} */

/*! @name PIPFCR - Port ingress port filter configuration register */
/*! @{ */

#define NETC_PORT_PIPFCR_EN_MASK                 (0x1U)
#define NETC_PORT_PIPFCR_EN_SHIFT                (0U)
#define NETC_PORT_PIPFCR_EN(x)                   (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PIPFCR_EN_SHIFT)) & NETC_PORT_PIPFCR_EN_MASK)
/*! @} */

/*! @name PSGCR - Port stream gate configuration register */
/*! @{ */

#define NETC_PORT_PSGCR_PDELAY_MASK              (0xFFFFFFU)
#define NETC_PORT_PSGCR_PDELAY_SHIFT             (0U)
#define NETC_PORT_PSGCR_PDELAY(x)                (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PSGCR_PDELAY_SHIFT)) & NETC_PORT_PSGCR_PDELAY_MASK)

#define NETC_PORT_PSGCR_OGC_MASK                 (0x80000000U)
#define NETC_PORT_PSGCR_OGC_SHIFT                (31U)
/*! OGC - Stream Gate Open Gate Check mode */
#define NETC_PORT_PSGCR_OGC(x)                   (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PSGCR_OGC_SHIFT)) & NETC_PORT_PSGCR_OGC_MASK)
/*! @} */

/*! @name POR - Port operational register */
/*! @{ */

#define NETC_PORT_POR_TXDIS_MASK                 (0x1U)
#define NETC_PORT_POR_TXDIS_SHIFT                (0U)
/*! TXDIS - Tx Disable.
 *  0b0..Tx path is enabled
 *  0b1..Tx path is disabled.
 */
#define NETC_PORT_POR_TXDIS(x)                   (((uint32_t)(((uint32_t)(x)) << NETC_PORT_POR_TXDIS_SHIFT)) & NETC_PORT_POR_TXDIS_MASK)

#define NETC_PORT_POR_RXDIS_MASK                 (0x2U)
#define NETC_PORT_POR_RXDIS_SHIFT                (1U)
/*! RXDIS - Rx Disable.
 *  0b0..Rx path is enabled.
 *  0b1..Rx path is disabled.
 */
#define NETC_PORT_POR_RXDIS(x)                   (((uint32_t)(((uint32_t)(x)) << NETC_PORT_POR_RXDIS_SHIFT)) & NETC_PORT_POR_RXDIS_MASK)
/*! @} */

/*! @name PSR - Port status register */
/*! @{ */

#define NETC_PORT_PSR_TX_BUSY_MASK               (0x1U)
#define NETC_PORT_PSR_TX_BUSY_SHIFT              (0U)
/*! TX_BUSY - Transmit busy.
 *  0b0..Idle
 *  0b1..Busy
 */
#define NETC_PORT_PSR_TX_BUSY(x)                 (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PSR_TX_BUSY_SHIFT)) & NETC_PORT_PSR_TX_BUSY_MASK)

#define NETC_PORT_PSR_RX_BUSY_MASK               (0x2U)
#define NETC_PORT_PSR_RX_BUSY_SHIFT              (1U)
/*! RX_BUSY - Receive busy.
 *  0b0..Idle
 *  0b1..Busy
 */
#define NETC_PORT_PSR_RX_BUSY(x)                 (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PSR_RX_BUSY_SHIFT)) & NETC_PORT_PSR_RX_BUSY_MASK)
/*! @} */

/*! @name PRXSDUOR - Port receive SDU overhead register */
/*! @{ */

#define NETC_PORT_PRXSDUOR_PPDU_BCO_MASK         (0x1FU)
#define NETC_PORT_PRXSDUOR_PPDU_BCO_SHIFT        (0U)
/*! PPDU_BCO - PPDU Byte count overhead */
#define NETC_PORT_PRXSDUOR_PPDU_BCO(x)           (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PRXSDUOR_PPDU_BCO_SHIFT)) & NETC_PORT_PRXSDUOR_PPDU_BCO_MASK)

#define NETC_PORT_PRXSDUOR_MACSEC_BCO_MASK       (0x1F00U)
#define NETC_PORT_PRXSDUOR_MACSEC_BCO_SHIFT      (8U)
/*! MACSEC_BCO - MACSec byte count overhead */
#define NETC_PORT_PRXSDUOR_MACSEC_BCO(x)         (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PRXSDUOR_MACSEC_BCO_SHIFT)) & NETC_PORT_PRXSDUOR_MACSEC_BCO_MASK)
/*! @} */

/*! @name PTXSDUOR - Port transmit SDU overhead register */
/*! @{ */

#define NETC_PORT_PTXSDUOR_PPDU_BCO_MASK         (0x1FU)
#define NETC_PORT_PTXSDUOR_PPDU_BCO_SHIFT        (0U)
/*! PPDU_BCO - PPDU Byte count overhead */
#define NETC_PORT_PTXSDUOR_PPDU_BCO(x)           (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PTXSDUOR_PPDU_BCO_SHIFT)) & NETC_PORT_PTXSDUOR_PPDU_BCO_MASK)

#define NETC_PORT_PTXSDUOR_MACSEC_BCO_MASK       (0x1F00U)
#define NETC_PORT_PTXSDUOR_MACSEC_BCO_SHIFT      (8U)
/*! MACSEC_BCO - MACSec byte count overhead */
#define NETC_PORT_PTXSDUOR_MACSEC_BCO(x)         (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PTXSDUOR_MACSEC_BCO_SHIFT)) & NETC_PORT_PTXSDUOR_MACSEC_BCO_MASK)
/*! @} */

/*! @name PTGSCR - Port time gate scheduling control register */
/*! @{ */

#define NETC_PORT_PTGSCR_TGE_MASK                (0x80000000U)
#define NETC_PORT_PTGSCR_TGE_SHIFT               (31U)
/*! TGE - Time Gating Enable
 *  0b0..Time gating disabled.
 *  0b1..Time gating enabled.
 */
#define NETC_PORT_PTGSCR_TGE(x)                  (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PTGSCR_TGE_SHIFT)) & NETC_PORT_PTGSCR_TGE_MASK)
/*! @} */

/*! @name PTGAGLSR - Port time gate scheduling admin gate list status register */
/*! @{ */

#define NETC_PORT_PTGAGLSR_TG_MASK               (0x1U)
#define NETC_PORT_PTGAGLSR_TG_SHIFT              (0U)
#define NETC_PORT_PTGAGLSR_TG(x)                 (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PTGAGLSR_TG_SHIFT)) & NETC_PORT_PTGAGLSR_TG_MASK)

#define NETC_PORT_PTGAGLSR_CFG_PEND_MASK         (0x2U)
#define NETC_PORT_PTGAGLSR_CFG_PEND_SHIFT        (1U)
#define NETC_PORT_PTGAGLSR_CFG_PEND(x)           (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PTGAGLSR_CFG_PEND_SHIFT)) & NETC_PORT_PTGAGLSR_CFG_PEND_MASK)
/*! @} */

/*! @name PTGAGLLR - Port time gate scheduling admin gate list length register */
/*! @{ */

#define NETC_PORT_PTGAGLLR_ADMIN_GATE_LIST_LENGTH_MASK (0xFFFFU)
#define NETC_PORT_PTGAGLLR_ADMIN_GATE_LIST_LENGTH_SHIFT (0U)
#define NETC_PORT_PTGAGLLR_ADMIN_GATE_LIST_LENGTH(x) (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PTGAGLLR_ADMIN_GATE_LIST_LENGTH_SHIFT)) & NETC_PORT_PTGAGLLR_ADMIN_GATE_LIST_LENGTH_MASK)
/*! @} */

/*! @name PTGOGLLR - Port time gating operational gate list length register */
/*! @{ */

#define NETC_PORT_PTGOGLLR_OPER_GATE_LIST_LENGTH_MASK (0xFFFFU)
#define NETC_PORT_PTGOGLLR_OPER_GATE_LIST_LENGTH_SHIFT (0U)
#define NETC_PORT_PTGOGLLR_OPER_GATE_LIST_LENGTH(x) (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PTGOGLLR_OPER_GATE_LIST_LENGTH_SHIFT)) & NETC_PORT_PTGOGLLR_OPER_GATE_LIST_LENGTH_MASK)
/*! @} */

/*! @name PTGSATOR - Port time gate scheduling advance time offset register */
/*! @{ */

#define NETC_PORT_PTGSATOR_ADV_TIME_OFFSET_MASK  (0xFFFFU)
#define NETC_PORT_PTGSATOR_ADV_TIME_OFFSET_SHIFT (0U)
#define NETC_PORT_PTGSATOR_ADV_TIME_OFFSET(x)    (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PTGSATOR_ADV_TIME_OFFSET_SHIFT)) & NETC_PORT_PTGSATOR_ADV_TIME_OFFSET_MASK)
/*! @} */

/*! @name PTGSHAR - Port time gate scheduling hold advance register */
/*! @{ */

