JayHeng/imxrt-tool-flash-algo/boards/nxp_evkmimxrt1180_rev.c/flash_algo_c0_silicon/Keil_JLink/rom_api/MIMXRT1189_cm7.h
#define NETC_PORT_PTGSHAR_HOLDADVANCE_MASK       (0xFFFFU)
#define NETC_PORT_PTGSHAR_HOLDADVANCE_SHIFT      (0U)
#define NETC_PORT_PTGSHAR_HOLDADVANCE(x)         (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PTGSHAR_HOLDADVANCE_SHIFT)) & NETC_PORT_PTGSHAR_HOLDADVANCE_MASK)
/*! @} */

/*! @name PTGSRAR - Port time gate scheduling release advance register */
/*! @{ */

#define NETC_PORT_PTGSRAR_RELEASEADVANCE_MASK    (0xFFFFU)
#define NETC_PORT_PTGSRAR_RELEASEADVANCE_SHIFT   (0U)
#define NETC_PORT_PTGSRAR_RELEASEADVANCE(x)      (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PTGSRAR_RELEASEADVANCE_SHIFT)) & NETC_PORT_PTGSRAR_RELEASEADVANCE_MASK)
/*! @} */

/*! @name PTGSHCR - Port time gate scheduling hold configuration register */
/*! @{ */

#define NETC_PORT_PTGSHCR_HOLD_SKEW_MASK         (0xFFFFFU)
#define NETC_PORT_PTGSHCR_HOLD_SKEW_SHIFT        (0U)
#define NETC_PORT_PTGSHCR_HOLD_SKEW(x)           (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PTGSHCR_HOLD_SKEW_SHIFT)) & NETC_PORT_PTGSHCR_HOLD_SKEW_MASK)
/*! @} */

/*! @name PFPCR - Port frame preemption configuration register */
/*! @{ */

#define NETC_PORT_PFPCR_FPE_TC0_MASK             (0x1U)
#define NETC_PORT_PFPCR_FPE_TC0_SHIFT            (0U)
#define NETC_PORT_PFPCR_FPE_TC0(x)               (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PFPCR_FPE_TC0_SHIFT)) & NETC_PORT_PFPCR_FPE_TC0_MASK)

#define NETC_PORT_PFPCR_FPE_TC1_MASK             (0x2U)
#define NETC_PORT_PFPCR_FPE_TC1_SHIFT            (1U)
#define NETC_PORT_PFPCR_FPE_TC1(x)               (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PFPCR_FPE_TC1_SHIFT)) & NETC_PORT_PFPCR_FPE_TC1_MASK)

#define NETC_PORT_PFPCR_FPE_TC2_MASK             (0x4U)
#define NETC_PORT_PFPCR_FPE_TC2_SHIFT            (2U)
#define NETC_PORT_PFPCR_FPE_TC2(x)               (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PFPCR_FPE_TC2_SHIFT)) & NETC_PORT_PFPCR_FPE_TC2_MASK)

#define NETC_PORT_PFPCR_FPE_TC3_MASK             (0x8U)
#define NETC_PORT_PFPCR_FPE_TC3_SHIFT            (3U)
#define NETC_PORT_PFPCR_FPE_TC3(x)               (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PFPCR_FPE_TC3_SHIFT)) & NETC_PORT_PFPCR_FPE_TC3_MASK)

#define NETC_PORT_PFPCR_FPE_TC4_MASK             (0x10U)
#define NETC_PORT_PFPCR_FPE_TC4_SHIFT            (4U)
#define NETC_PORT_PFPCR_FPE_TC4(x)               (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PFPCR_FPE_TC4_SHIFT)) & NETC_PORT_PFPCR_FPE_TC4_MASK)

#define NETC_PORT_PFPCR_FPE_TC5_MASK             (0x20U)
#define NETC_PORT_PFPCR_FPE_TC5_SHIFT            (5U)
#define NETC_PORT_PFPCR_FPE_TC5(x)               (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PFPCR_FPE_TC5_SHIFT)) & NETC_PORT_PFPCR_FPE_TC5_MASK)

#define NETC_PORT_PFPCR_FPE_TC6_MASK             (0x40U)
#define NETC_PORT_PFPCR_FPE_TC6_SHIFT            (6U)
#define NETC_PORT_PFPCR_FPE_TC6(x)               (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PFPCR_FPE_TC6_SHIFT)) & NETC_PORT_PFPCR_FPE_TC6_MASK)

#define NETC_PORT_PFPCR_FPE_TC7_MASK             (0x80U)
#define NETC_PORT_PFPCR_FPE_TC7_SHIFT            (7U)
#define NETC_PORT_PFPCR_FPE_TC7(x)               (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PFPCR_FPE_TC7_SHIFT)) & NETC_PORT_PFPCR_FPE_TC7_MASK)
/*! @} */

/*! @name PDGSR - Port default gate state register */
/*! @{ */

#define NETC_PORT_PDGSR_DGS_TC0_MASK             (0x1U)
#define NETC_PORT_PDGSR_DGS_TC0_SHIFT            (0U)
/*! DGS_TC0
 *  0b0..Closed
 *  0b1..Open
 */
#define NETC_PORT_PDGSR_DGS_TC0(x)               (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PDGSR_DGS_TC0_SHIFT)) & NETC_PORT_PDGSR_DGS_TC0_MASK)

#define NETC_PORT_PDGSR_DGS_TC1_MASK             (0x2U)
#define NETC_PORT_PDGSR_DGS_TC1_SHIFT            (1U)
/*! DGS_TC1
 *  0b0..Closed
 *  0b1..Open
 */
#define NETC_PORT_PDGSR_DGS_TC1(x)               (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PDGSR_DGS_TC1_SHIFT)) & NETC_PORT_PDGSR_DGS_TC1_MASK)

#define NETC_PORT_PDGSR_DGS_TC2_MASK             (0x4U)
#define NETC_PORT_PDGSR_DGS_TC2_SHIFT            (2U)
/*! DGS_TC2
 *  0b0..Closed
 *  0b1..Open
 */
#define NETC_PORT_PDGSR_DGS_TC2(x)               (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PDGSR_DGS_TC2_SHIFT)) & NETC_PORT_PDGSR_DGS_TC2_MASK)

#define NETC_PORT_PDGSR_DGS_TC3_MASK             (0x8U)
#define NETC_PORT_PDGSR_DGS_TC3_SHIFT            (3U)
/*! DGS_TC3
 *  0b0..Closed
 *  0b1..Open
 */
#define NETC_PORT_PDGSR_DGS_TC3(x)               (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PDGSR_DGS_TC3_SHIFT)) & NETC_PORT_PDGSR_DGS_TC3_MASK)

#define NETC_PORT_PDGSR_DGS_TC4_MASK             (0x10U)
#define NETC_PORT_PDGSR_DGS_TC4_SHIFT            (4U)
/*! DGS_TC4
 *  0b0..Closed
 *  0b1..Open
 */
#define NETC_PORT_PDGSR_DGS_TC4(x)               (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PDGSR_DGS_TC4_SHIFT)) & NETC_PORT_PDGSR_DGS_TC4_MASK)

#define NETC_PORT_PDGSR_DGS_TC5_MASK             (0x20U)
#define NETC_PORT_PDGSR_DGS_TC5_SHIFT            (5U)
/*! DGS_TC5
 *  0b0..Closed
 *  0b1..Open
 */
#define NETC_PORT_PDGSR_DGS_TC5(x)               (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PDGSR_DGS_TC5_SHIFT)) & NETC_PORT_PDGSR_DGS_TC5_MASK)

#define NETC_PORT_PDGSR_DGS_TC6_MASK             (0x40U)
#define NETC_PORT_PDGSR_DGS_TC6_SHIFT            (6U)
/*! DGS_TC6
 *  0b0..Closed
 *  0b1..Open
 */
#define NETC_PORT_PDGSR_DGS_TC6(x)               (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PDGSR_DGS_TC6_SHIFT)) & NETC_PORT_PDGSR_DGS_TC6_MASK)

#define NETC_PORT_PDGSR_DGS_TC7_MASK             (0x80U)
#define NETC_PORT_PDGSR_DGS_TC7_SHIFT            (7U)
/*! DGS_TC7
 *  0b0..Closed
 *  0b1..Open
 */
#define NETC_PORT_PDGSR_DGS_TC7(x)               (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PDGSR_DGS_TC7_SHIFT)) & NETC_PORT_PDGSR_DGS_TC7_MASK)
/*! @} */

/*! @name PRXDCR - Port Rx discard count register */
/*! @{ */

#define NETC_PORT_PRXDCR_COUNT_MASK              (0xFFFFFFFFU)
#define NETC_PORT_PRXDCR_COUNT_SHIFT             (0U)
#define NETC_PORT_PRXDCR_COUNT(x)                (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PRXDCR_COUNT_SHIFT)) & NETC_PORT_PRXDCR_COUNT_MASK)
/*! @} */

/*! @name PRXDCRR0 - Port Rx discard count reason register 0 */
/*! @{ */

#define NETC_PORT_PRXDCRR0_PCDR_MASK             (0x1U)
#define NETC_PORT_PRXDCRR0_PCDR_SHIFT            (0U)
#define NETC_PORT_PRXDCRR0_PCDR(x)               (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PRXDCRR0_PCDR_SHIFT)) & NETC_PORT_PRXDCRR0_PCDR_MASK)

#define NETC_PORT_PRXDCRR0_SMREDR_MASK           (0x2U)
#define NETC_PORT_PRXDCRR0_SMREDR_SHIFT          (1U)
#define NETC_PORT_PRXDCRR0_SMREDR(x)             (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PRXDCRR0_SMREDR_SHIFT)) & NETC_PORT_PRXDCRR0_SMREDR_MASK)

#define NETC_PORT_PRXDCRR0_RXDISDR_MASK          (0x4U)
#define NETC_PORT_PRXDCRR0_RXDISDR_SHIFT         (2U)
#define NETC_PORT_PRXDCRR0_RXDISDR(x)            (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PRXDCRR0_RXDISDR_SHIFT)) & NETC_PORT_PRXDCRR0_RXDISDR_MASK)

