JayHeng/imxrt-tool-flash-algo/boards/nxp_evkmimxrt1180_rev.c/flash_algo_c0_silicon/Keil_JLink/rom_api/MIMXRT1189_cm7.h
#define NETC_PORT_BPSTGSR_STG_STATE0_MASK        (0x3U)
#define NETC_PORT_BPSTGSR_STG_STATE0_SHIFT       (0U)
#define NETC_PORT_BPSTGSR_STG_STATE0(x)          (((uint32_t)(((uint32_t)(x)) << NETC_PORT_BPSTGSR_STG_STATE0_SHIFT)) & NETC_PORT_BPSTGSR_STG_STATE0_MASK)

#define NETC_PORT_BPSTGSR_STG_STATE1_MASK        (0xCU)
#define NETC_PORT_BPSTGSR_STG_STATE1_SHIFT       (2U)
#define NETC_PORT_BPSTGSR_STG_STATE1(x)          (((uint32_t)(((uint32_t)(x)) << NETC_PORT_BPSTGSR_STG_STATE1_SHIFT)) & NETC_PORT_BPSTGSR_STG_STATE1_MASK)

#define NETC_PORT_BPSTGSR_STG_STATE2_MASK        (0x30U)
#define NETC_PORT_BPSTGSR_STG_STATE2_SHIFT       (4U)
#define NETC_PORT_BPSTGSR_STG_STATE2(x)          (((uint32_t)(((uint32_t)(x)) << NETC_PORT_BPSTGSR_STG_STATE2_SHIFT)) & NETC_PORT_BPSTGSR_STG_STATE2_MASK)

#define NETC_PORT_BPSTGSR_STG_STATE3_MASK        (0xC0U)
#define NETC_PORT_BPSTGSR_STG_STATE3_SHIFT       (6U)
#define NETC_PORT_BPSTGSR_STG_STATE3(x)          (((uint32_t)(((uint32_t)(x)) << NETC_PORT_BPSTGSR_STG_STATE3_SHIFT)) & NETC_PORT_BPSTGSR_STG_STATE3_MASK)

#define NETC_PORT_BPSTGSR_STG_STATE4_MASK        (0x300U)
#define NETC_PORT_BPSTGSR_STG_STATE4_SHIFT       (8U)
#define NETC_PORT_BPSTGSR_STG_STATE4(x)          (((uint32_t)(((uint32_t)(x)) << NETC_PORT_BPSTGSR_STG_STATE4_SHIFT)) & NETC_PORT_BPSTGSR_STG_STATE4_MASK)

#define NETC_PORT_BPSTGSR_STG_STATE5_MASK        (0xC00U)
#define NETC_PORT_BPSTGSR_STG_STATE5_SHIFT       (10U)
#define NETC_PORT_BPSTGSR_STG_STATE5(x)          (((uint32_t)(((uint32_t)(x)) << NETC_PORT_BPSTGSR_STG_STATE5_SHIFT)) & NETC_PORT_BPSTGSR_STG_STATE5_MASK)

#define NETC_PORT_BPSTGSR_STG_STATE6_MASK        (0x3000U)
#define NETC_PORT_BPSTGSR_STG_STATE6_SHIFT       (12U)
#define NETC_PORT_BPSTGSR_STG_STATE6(x)          (((uint32_t)(((uint32_t)(x)) << NETC_PORT_BPSTGSR_STG_STATE6_SHIFT)) & NETC_PORT_BPSTGSR_STG_STATE6_MASK)

#define NETC_PORT_BPSTGSR_STG_STATE7_MASK        (0xC000U)
#define NETC_PORT_BPSTGSR_STG_STATE7_SHIFT       (14U)
#define NETC_PORT_BPSTGSR_STG_STATE7(x)          (((uint32_t)(((uint32_t)(x)) << NETC_PORT_BPSTGSR_STG_STATE7_SHIFT)) & NETC_PORT_BPSTGSR_STG_STATE7_MASK)

#define NETC_PORT_BPSTGSR_STG_STATE8_MASK        (0x30000U)
#define NETC_PORT_BPSTGSR_STG_STATE8_SHIFT       (16U)
#define NETC_PORT_BPSTGSR_STG_STATE8(x)          (((uint32_t)(((uint32_t)(x)) << NETC_PORT_BPSTGSR_STG_STATE8_SHIFT)) & NETC_PORT_BPSTGSR_STG_STATE8_MASK)

#define NETC_PORT_BPSTGSR_STG_STATE9_MASK        (0xC0000U)
#define NETC_PORT_BPSTGSR_STG_STATE9_SHIFT       (18U)
#define NETC_PORT_BPSTGSR_STG_STATE9(x)          (((uint32_t)(((uint32_t)(x)) << NETC_PORT_BPSTGSR_STG_STATE9_SHIFT)) & NETC_PORT_BPSTGSR_STG_STATE9_MASK)

#define NETC_PORT_BPSTGSR_STG_STATE10_MASK       (0x300000U)
#define NETC_PORT_BPSTGSR_STG_STATE10_SHIFT      (20U)
#define NETC_PORT_BPSTGSR_STG_STATE10(x)         (((uint32_t)(((uint32_t)(x)) << NETC_PORT_BPSTGSR_STG_STATE10_SHIFT)) & NETC_PORT_BPSTGSR_STG_STATE10_MASK)

#define NETC_PORT_BPSTGSR_STG_STATE11_MASK       (0xC00000U)
#define NETC_PORT_BPSTGSR_STG_STATE11_SHIFT      (22U)
#define NETC_PORT_BPSTGSR_STG_STATE11(x)         (((uint32_t)(((uint32_t)(x)) << NETC_PORT_BPSTGSR_STG_STATE11_SHIFT)) & NETC_PORT_BPSTGSR_STG_STATE11_MASK)

#define NETC_PORT_BPSTGSR_STG_STATE12_MASK       (0x3000000U)
#define NETC_PORT_BPSTGSR_STG_STATE12_SHIFT      (24U)
#define NETC_PORT_BPSTGSR_STG_STATE12(x)         (((uint32_t)(((uint32_t)(x)) << NETC_PORT_BPSTGSR_STG_STATE12_SHIFT)) & NETC_PORT_BPSTGSR_STG_STATE12_MASK)

#define NETC_PORT_BPSTGSR_STG_STATE13_MASK       (0xC000000U)
#define NETC_PORT_BPSTGSR_STG_STATE13_SHIFT      (26U)
#define NETC_PORT_BPSTGSR_STG_STATE13(x)         (((uint32_t)(((uint32_t)(x)) << NETC_PORT_BPSTGSR_STG_STATE13_SHIFT)) & NETC_PORT_BPSTGSR_STG_STATE13_MASK)

#define NETC_PORT_BPSTGSR_STG_STATE14_MASK       (0x30000000U)
#define NETC_PORT_BPSTGSR_STG_STATE14_SHIFT      (28U)
#define NETC_PORT_BPSTGSR_STG_STATE14(x)         (((uint32_t)(((uint32_t)(x)) << NETC_PORT_BPSTGSR_STG_STATE14_SHIFT)) & NETC_PORT_BPSTGSR_STG_STATE14_MASK)

#define NETC_PORT_BPSTGSR_STG_STATE15_MASK       (0xC0000000U)
#define NETC_PORT_BPSTGSR_STG_STATE15_SHIFT      (30U)
#define NETC_PORT_BPSTGSR_STG_STATE15(x)         (((uint32_t)(((uint32_t)(x)) << NETC_PORT_BPSTGSR_STG_STATE15_SHIFT)) & NETC_PORT_BPSTGSR_STG_STATE15_MASK)
/*! @} */

/*! @name BPSCR0 - Bridge port storm control register 0 */
/*! @{ */

#define NETC_PORT_BPSCR0_UUCASTRPEID_MASK        (0xFFFU)
#define NETC_PORT_BPSCR0_UUCASTRPEID_SHIFT       (0U)
#define NETC_PORT_BPSCR0_UUCASTRPEID(x)          (((uint32_t)(((uint32_t)(x)) << NETC_PORT_BPSCR0_UUCASTRPEID_SHIFT)) & NETC_PORT_BPSCR0_UUCASTRPEID_MASK)

#define NETC_PORT_BPSCR0_BCASTRPEID_MASK         (0xFFF0000U)
#define NETC_PORT_BPSCR0_BCASTRPEID_SHIFT        (16U)
#define NETC_PORT_BPSCR0_BCASTRPEID(x)           (((uint32_t)(((uint32_t)(x)) << NETC_PORT_BPSCR0_BCASTRPEID_SHIFT)) & NETC_PORT_BPSCR0_BCASTRPEID_MASK)
/*! @} */

/*! @name BPSCR1 - Bridge port storm control register 1 */
/*! @{ */

#define NETC_PORT_BPSCR1_MCASTRPEID_MASK         (0xFFFU)
#define NETC_PORT_BPSCR1_MCASTRPEID_SHIFT        (0U)
#define NETC_PORT_BPSCR1_MCASTRPEID(x)           (((uint32_t)(((uint32_t)(x)) << NETC_PORT_BPSCR1_MCASTRPEID_SHIFT)) & NETC_PORT_BPSCR1_MCASTRPEID_MASK)

#define NETC_PORT_BPSCR1_UMCASTRPEID_MASK        (0xFFF0000U)
#define NETC_PORT_BPSCR1_UMCASTRPEID_SHIFT       (16U)
#define NETC_PORT_BPSCR1_UMCASTRPEID(x)          (((uint32_t)(((uint32_t)(x)) << NETC_PORT_BPSCR1_UMCASTRPEID_SHIFT)) & NETC_PORT_BPSCR1_UMCASTRPEID_MASK)
/*! @} */

/*! @name BPOR - Bridge port operational register */
/*! @{ */

#define NETC_PORT_BPOR_NUM_DYN_MASK              (0xFFFFU)
#define NETC_PORT_BPOR_NUM_DYN_SHIFT             (0U)
#define NETC_PORT_BPOR_NUM_DYN(x)                (((uint32_t)(((uint32_t)(x)) << NETC_PORT_BPOR_NUM_DYN_SHIFT)) & NETC_PORT_BPOR_NUM_DYN_MASK)
/*! @} */

/*! @name BPDCR - Bridge port discard count register */
/*! @{ */

#define NETC_PORT_BPDCR_COUNT_MASK               (0xFFFFFFFFU)
#define NETC_PORT_BPDCR_COUNT_SHIFT              (0U)
#define NETC_PORT_BPDCR_COUNT(x)                 (((uint32_t)(((uint32_t)(x)) << NETC_PORT_BPDCR_COUNT_SHIFT)) & NETC_PORT_BPDCR_COUNT_MASK)
/*! @} */

/*! @name BPDCRR0 - Bridge port discard count reason register 0 */
/*! @{ */

#define NETC_PORT_BPDCRR0_BPACDR_MASK            (0x1U)
#define NETC_PORT_BPDCRR0_BPACDR_SHIFT           (0U)
#define NETC_PORT_BPDCRR0_BPACDR(x)              (((uint32_t)(((uint32_t)(x)) << NETC_PORT_BPDCRR0_BPACDR_SHIFT)) & NETC_PORT_BPDCRR0_BPACDR_MASK)

#define NETC_PORT_BPDCRR0_ISTGSDR_MASK           (0x2U)
#define NETC_PORT_BPDCRR0_ISTGSDR_SHIFT          (1U)
#define NETC_PORT_BPDCRR0_ISTGSDR(x)             (((uint32_t)(((uint32_t)(x)) << NETC_PORT_BPDCRR0_ISTGSDR_SHIFT)) & NETC_PORT_BPDCRR0_ISTGSDR_MASK)

#define NETC_PORT_BPDCRR0_BPVFLTDR_MASK          (0x4U)
#define NETC_PORT_BPDCRR0_BPVFLTDR_SHIFT         (2U)
#define NETC_PORT_BPDCRR0_BPVFLTDR(x)            (((uint32_t)(((uint32_t)(x)) << NETC_PORT_BPDCRR0_BPVFLTDR_SHIFT)) & NETC_PORT_BPDCRR0_BPVFLTDR_MASK)

#define NETC_PORT_BPDCRR0_MACLNFDR_MASK          (0x8U)
#define NETC_PORT_BPDCRR0_MACLNFDR_SHIFT         (3U)
#define NETC_PORT_BPDCRR0_MACLNFDR(x)            (((uint32_t)(((uint32_t)(x)) << NETC_PORT_BPDCRR0_MACLNFDR_SHIFT)) & NETC_PORT_BPDCRR0_MACLNFDR_MASK)

#define NETC_PORT_BPDCRR0_STAMVDDR_MASK          (0x80U)
#define NETC_PORT_BPDCRR0_STAMVDDR_SHIFT         (7U)
#define NETC_PORT_BPDCRR0_STAMVDDR(x)            (((uint32_t)(((uint32_t)(x)) << NETC_PORT_BPDCRR0_STAMVDDR_SHIFT)) & NETC_PORT_BPDCRR0_STAMVDDR_MASK)

