JayHeng/imxrt-tool-flash-algo/boards/nxp_evkmimxrt1180_rev.c/flash_algo_c0_silicon/Keil_JLink/rom_api/MIMXRT1189_cm7.h
#define NETC_SW_SCAPR0_NUM_IPV_MASK              (0x100U)
#define NETC_SW_SCAPR0_NUM_IPV_SHIFT             (8U)
#define NETC_SW_SCAPR0_NUM_IPV(x)                (((uint32_t)(((uint32_t)(x)) << NETC_SW_SCAPR0_NUM_IPV_SHIFT)) & NETC_SW_SCAPR0_NUM_IPV_MASK)

#define NETC_SW_SCAPR0_NUM_MSIX_MASK             (0xF0000U)
#define NETC_SW_SCAPR0_NUM_MSIX_SHIFT            (16U)
#define NETC_SW_SCAPR0_NUM_MSIX(x)               (((uint32_t)(((uint32_t)(x)) << NETC_SW_SCAPR0_NUM_MSIX_SHIFT)) & NETC_SW_SCAPR0_NUM_MSIX_MASK)

#define NETC_SW_SCAPR0_NUM_PCPMP_MASK            (0xF00000U)
#define NETC_SW_SCAPR0_NUM_PCPMP_SHIFT           (20U)
#define NETC_SW_SCAPR0_NUM_PCPMP(x)              (((uint32_t)(((uint32_t)(x)) << NETC_SW_SCAPR0_NUM_PCPMP_SHIFT)) & NETC_SW_SCAPR0_NUM_PCPMP_MASK)

#define NETC_SW_SCAPR0_NUM_QVMP_MASK             (0xF000000U)
#define NETC_SW_SCAPR0_NUM_QVMP_SHIFT            (24U)
#define NETC_SW_SCAPR0_NUM_QVMP(x)               (((uint32_t)(((uint32_t)(x)) << NETC_SW_SCAPR0_NUM_QVMP_SHIFT)) & NETC_SW_SCAPR0_NUM_QVMP_MASK)
/*! @} */

/*! @name SCAPR1 - Switch capability register 1 */
/*! @{ */

#define NETC_SW_SCAPR1_FS_MASK                   (0x1U)
#define NETC_SW_SCAPR1_FS_SHIFT                  (0U)
/*! FS - Functional safety capability supported. */
#define NETC_SW_SCAPR1_FS(x)                     (((uint32_t)(((uint32_t)(x)) << NETC_SW_SCAPR1_FS_SHIFT)) & NETC_SW_SCAPR1_FS_MASK)

#define NETC_SW_SCAPR1_CTF_MASK                  (0x4U)
#define NETC_SW_SCAPR1_CTF_SHIFT                 (2U)
#define NETC_SW_SCAPR1_CTF(x)                    (((uint32_t)(((uint32_t)(x)) << NETC_SW_SCAPR1_CTF_SHIFT)) & NETC_SW_SCAPR1_CTF_MASK)

#define NETC_SW_SCAPR1_TIMCAP_MASK               (0x8U)
#define NETC_SW_SCAPR1_TIMCAP_SHIFT              (3U)
#define NETC_SW_SCAPR1_TIMCAP(x)                 (((uint32_t)(((uint32_t)(x)) << NETC_SW_SCAPR1_TIMCAP_SHIFT)) & NETC_SW_SCAPR1_TIMCAP_MASK)

#define NETC_SW_SCAPR1_IMIR_MASK                 (0x10U)
#define NETC_SW_SCAPR1_IMIR_SHIFT                (4U)
#define NETC_SW_SCAPR1_IMIR(x)                   (((uint32_t)(((uint32_t)(x)) << NETC_SW_SCAPR1_IMIR_SHIFT)) & NETC_SW_SCAPR1_IMIR_MASK)

#define NETC_SW_SCAPR1_SQ_TAGS_MASK              (0x1F0000U)
#define NETC_SW_SCAPR1_SQ_TAGS_SHIFT             (16U)
#define NETC_SW_SCAPR1_SQ_TAGS(x)                (((uint32_t)(((uint32_t)(x)) << NETC_SW_SCAPR1_SQ_TAGS_SHIFT)) & NETC_SW_SCAPR1_SQ_TAGS_MASK)
/*! @} */

/*! @name BPCAPR - Buffer pool capability register */
/*! @{ */

#define NETC_SW_BPCAPR_NUM_BP_MASK               (0xFFU)
#define NETC_SW_BPCAPR_NUM_BP_SHIFT              (0U)
#define NETC_SW_BPCAPR_NUM_BP(x)                 (((uint32_t)(((uint32_t)(x)) << NETC_SW_BPCAPR_NUM_BP_SHIFT)) & NETC_SW_BPCAPR_NUM_BP_MASK)

#define NETC_SW_BPCAPR_NUM_SPB_MASK              (0x1F0000U)
#define NETC_SW_BPCAPR_NUM_SPB_SHIFT             (16U)
#define NETC_SW_BPCAPR_NUM_SPB(x)                (((uint32_t)(((uint32_t)(x)) << NETC_SW_BPCAPR_NUM_SPB_SHIFT)) & NETC_SW_BPCAPR_NUM_SPB_MASK)
/*! @} */

/*! @name FCAPR - Forwarding capability register */
/*! @{ */

#define NETC_SW_FCAPR_BR_MASK                    (0x1U)
#define NETC_SW_FCAPR_BR_SHIFT                   (0U)
/*! BR - 802.1Q bridge forwarding support.
 *  0b0..Not supported
 *  0b1..Supported
 */
#define NETC_SW_FCAPR_BR(x)                      (((uint32_t)(((uint32_t)(x)) << NETC_SW_FCAPR_BR_SHIFT)) & NETC_SW_FCAPR_BR_MASK)

#define NETC_SW_FCAPR_SF_MASK                    (0x2U)
#define NETC_SW_FCAPR_SF_SHIFT                   (1U)
/*! SF - Stream forwarding supported
 *  0b0..Not supported
 *  0b1..Supported
 */
#define NETC_SW_FCAPR_SF(x)                      (((uint32_t)(((uint32_t)(x)) << NETC_SW_FCAPR_SF_SHIFT)) & NETC_SW_FCAPR_SF_MASK)
/*! @} */

/*! @name SMBCAPR - Shared memory buffer capability register */
/*! @{ */

#define NETC_SW_SMBCAPR_NUM_WORDS_MASK           (0xFFFFFFU)
#define NETC_SW_SMBCAPR_NUM_WORDS_SHIFT          (0U)
#define NETC_SW_SMBCAPR_NUM_WORDS(x)             (((uint32_t)(((uint32_t)(x)) << NETC_SW_SMBCAPR_NUM_WORDS_SHIFT)) & NETC_SW_SMBCAPR_NUM_WORDS_MASK)

#define NETC_SW_SMBCAPR_WORD_SIZE_MASK           (0x30000000U)
#define NETC_SW_SMBCAPR_WORD_SIZE_SHIFT          (28U)
/*! WORD_SIZE
 *  0b00..24 bytes
 *  0b01-0b11..
 */
#define NETC_SW_SMBCAPR_WORD_SIZE(x)             (((uint32_t)(((uint32_t)(x)) << NETC_SW_SMBCAPR_WORD_SIZE_SHIFT)) & NETC_SW_SMBCAPR_WORD_SIZE_MASK)

#define NETC_SW_SMBCAPR_MLOC_MASK                (0xC0000000U)
#define NETC_SW_SMBCAPR_MLOC_SHIFT               (30U)
/*! MLOC - Indicates memory location
 *  0b00..Common memory
 *  0b01-0b11..
 */
#define NETC_SW_SMBCAPR_MLOC(x)                  (((uint32_t)(((uint32_t)(x)) << NETC_SW_SMBCAPR_MLOC_SHIFT)) & NETC_SW_SMBCAPR_MLOC_MASK)
/*! @} */

/*! @name SMBOR0 - Shared memory buffer operational register 0 */
/*! @{ */

#define NETC_SW_SMBOR0_COUNT_MASK                (0xFFFFFFU)
#define NETC_SW_SMBOR0_COUNT_SHIFT               (0U)
#define NETC_SW_SMBOR0_COUNT(x)                  (((uint32_t)(((uint32_t)(x)) << NETC_SW_SMBOR0_COUNT_SHIFT)) & NETC_SW_SMBOR0_COUNT_MASK)
/*! @} */

/*! @name SMBOR1 - Shared memory buffer operational register 1 */
/*! @{ */

#define NETC_SW_SMBOR1_WATERMARK_MASK            (0xFFFFFFU)
#define NETC_SW_SMBOR1_WATERMARK_SHIFT           (0U)
#define NETC_SW_SMBOR1_WATERMARK(x)              (((uint32_t)(((uint32_t)(x)) << NETC_SW_SMBOR1_WATERMARK_SHIFT)) & NETC_SW_SMBOR1_WATERMARK_MASK)
/*! @} */

/*! @name CCAR - Command cache attribute register */
/*! @{ */

#define NETC_SW_CCAR_CBD_WRCACHE_MASK            (0xFU)
#define NETC_SW_CCAR_CBD_WRCACHE_SHIFT           (0U)
#define NETC_SW_CCAR_CBD_WRCACHE(x)              (((uint32_t)(((uint32_t)(x)) << NETC_SW_CCAR_CBD_WRCACHE_SHIFT)) & NETC_SW_CCAR_CBD_WRCACHE_MASK)

#define NETC_SW_CCAR_CBD_WRDOMAIN_MASK           (0x30U)
#define NETC_SW_CCAR_CBD_WRDOMAIN_SHIFT          (4U)
#define NETC_SW_CCAR_CBD_WRDOMAIN(x)             (((uint32_t)(((uint32_t)(x)) << NETC_SW_CCAR_CBD_WRDOMAIN_SHIFT)) & NETC_SW_CCAR_CBD_WRDOMAIN_MASK)

#define NETC_SW_CCAR_CBD_WRSNP_MASK              (0x40U)
#define NETC_SW_CCAR_CBD_WRSNP_SHIFT             (6U)
#define NETC_SW_CCAR_CBD_WRSNP(x)                (((uint32_t)(((uint32_t)(x)) << NETC_SW_CCAR_CBD_WRSNP_SHIFT)) & NETC_SW_CCAR_CBD_WRSNP_MASK)

#define NETC_SW_CCAR_CWRCACHE_MASK               (0xF00U)
#define NETC_SW_CCAR_CWRCACHE_SHIFT              (8U)
#define NETC_SW_CCAR_CWRCACHE(x)                 (((uint32_t)(((uint32_t)(x)) << NETC_SW_CCAR_CWRCACHE_SHIFT)) & NETC_SW_CCAR_CWRCACHE_MASK)

#define NETC_SW_CCAR_CWRDOMAIN_MASK              (0x3000U)
#define NETC_SW_CCAR_CWRDOMAIN_SHIFT             (12U)
#define NETC_SW_CCAR_CWRDOMAIN(x)                (((uint32_t)(((uint32_t)(x)) << NETC_SW_CCAR_CWRDOMAIN_SHIFT)) & NETC_SW_CCAR_CWRDOMAIN_MASK)

