JayHeng/imxrt-tool-flash-algo/boards/nxp_evkmimxrt1180_rev.c/flash_algo_c0_silicon/Keil_JLink/rom_api/MIMXRT1189_cm7.h
/*! @name UNMACESR - Uncorrectable non-fatal MAC error status register */
/*! @{ */

#define NETC_SW_ENETC_UNMACESR_PORT0_MASK        (0x1U)
#define NETC_SW_ENETC_UNMACESR_PORT0_SHIFT       (0U)
/*! PORT0 - Port 0 MAC error */
#define NETC_SW_ENETC_UNMACESR_PORT0(x)          (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_UNMACESR_PORT0_SHIFT)) & NETC_SW_ENETC_UNMACESR_PORT0_MASK)

#define NETC_SW_ENETC_UNMACESR_PORT1_MASK        (0x2U)
#define NETC_SW_ENETC_UNMACESR_PORT1_SHIFT       (1U)
/*! PORT1 - Port 1 MAC error */
#define NETC_SW_ENETC_UNMACESR_PORT1(x)          (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_UNMACESR_PORT1_SHIFT)) & NETC_SW_ENETC_UNMACESR_PORT1_MASK)

#define NETC_SW_ENETC_UNMACESR_PORT2_MASK        (0x4U)
#define NETC_SW_ENETC_UNMACESR_PORT2_SHIFT       (2U)
/*! PORT2 - Port 2 MAC error */
#define NETC_SW_ENETC_UNMACESR_PORT2(x)          (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_UNMACESR_PORT2_SHIFT)) & NETC_SW_ENETC_UNMACESR_PORT2_MASK)

#define NETC_SW_ENETC_UNMACESR_PORT3_MASK        (0x8U)
#define NETC_SW_ENETC_UNMACESR_PORT3_SHIFT       (3U)
/*! PORT3 - Port 3 MAC error */
#define NETC_SW_ENETC_UNMACESR_PORT3(x)          (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_UNMACESR_PORT3_SHIFT)) & NETC_SW_ENETC_UNMACESR_PORT3_MASK)

#define NETC_SW_ENETC_UNMACESR_PORT4_MASK        (0x10U)
#define NETC_SW_ENETC_UNMACESR_PORT4_SHIFT       (4U)
/*! PORT4 - Port 4 MAC error */
#define NETC_SW_ENETC_UNMACESR_PORT4(x)          (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_UNMACESR_PORT4_SHIFT)) & NETC_SW_ENETC_UNMACESR_PORT4_MASK)
/*! @} */

/*! @name UNSBECR - Uncorrectable non-fatal system bus error configuration register */
/*! @{ */

#define NETC_SW_ENETC_UNSBECR_THRESHOLD_MASK     (0xFFU)
#define NETC_SW_ENETC_UNSBECR_THRESHOLD_SHIFT    (0U)
/*! THRESHOLD - Threshold */
#define NETC_SW_ENETC_UNSBECR_THRESHOLD(x)       (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_UNSBECR_THRESHOLD_SHIFT)) & NETC_SW_ENETC_UNSBECR_THRESHOLD_MASK)
/*! @} */

/*! @name UNSBESR - Uncorrectable non-fatal system bus error status register */
/*! @{ */

#define NETC_SW_ENETC_UNSBESR_SB_ID_MASK         (0xFU)
#define NETC_SW_ENETC_UNSBESR_SB_ID_SHIFT        (0U)
/*! SB_ID - System Bus ID */
#define NETC_SW_ENETC_UNSBESR_SB_ID(x)           (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_UNSBESR_SB_ID_SHIFT)) & NETC_SW_ENETC_UNSBESR_SB_ID_MASK)

#define NETC_SW_ENETC_UNSBESR_SBE_MASK           (0x80000000U)
#define NETC_SW_ENETC_UNSBESR_SBE_SHIFT          (31U)
/*! SBE - System bus error */
#define NETC_SW_ENETC_UNSBESR_SBE(x)             (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_UNSBESR_SBE_SHIFT)) & NETC_SW_ENETC_UNSBESR_SBE_MASK)
/*! @} */

/*! @name UNSBECTR - Uncorrectable non-fatal system bus error count register */
/*! @{ */

#define NETC_SW_ENETC_UNSBECTR_COUNT_MASK        (0xFFU)
#define NETC_SW_ENETC_UNSBECTR_COUNT_SHIFT       (0U)
/*! COUNT - Count */
#define NETC_SW_ENETC_UNSBECTR_COUNT(x)          (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_UNSBECTR_COUNT_SHIFT)) & NETC_SW_ENETC_UNSBECTR_COUNT_MASK)
/*! @} */

/*! @name UFSBECR - Uncorrectable fatal system bus error configuration register */
/*! @{ */

#define NETC_SW_ENETC_UFSBECR_RD_MASK            (0x80000000U)
#define NETC_SW_ENETC_UFSBECR_RD_SHIFT           (31U)
/*! RD - Report disable
 *  0b0..Enabled
 *  0b1..Disabled
 */
#define NETC_SW_ENETC_UFSBECR_RD(x)              (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_UFSBECR_RD_SHIFT)) & NETC_SW_ENETC_UFSBECR_RD_MASK)
/*! @} */

/*! @name UFSBESR - Uncorrectable fatal system bus error status register */
/*! @{ */

#define NETC_SW_ENETC_UFSBESR_SB_ID_MASK         (0xFU)
#define NETC_SW_ENETC_UFSBESR_SB_ID_SHIFT        (0U)
/*! SB_ID - System Bus ID */
#define NETC_SW_ENETC_UFSBESR_SB_ID(x)           (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_UFSBESR_SB_ID_SHIFT)) & NETC_SW_ENETC_UFSBESR_SB_ID_MASK)

#define NETC_SW_ENETC_UFSBESR_M_MASK             (0x40000000U)
#define NETC_SW_ENETC_UFSBESR_M_SHIFT            (30U)
/*! M - Multiple */
#define NETC_SW_ENETC_UFSBESR_M(x)               (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_UFSBESR_M_SHIFT)) & NETC_SW_ENETC_UFSBESR_M_MASK)

#define NETC_SW_ENETC_UFSBESR_SBE_MASK           (0x80000000U)
#define NETC_SW_ENETC_UFSBESR_SBE_SHIFT          (31U)
/*! SBE - System bus error */
#define NETC_SW_ENETC_UFSBESR_SBE(x)             (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_UFSBESR_SBE_SHIFT)) & NETC_SW_ENETC_UFSBESR_SBE_MASK)
/*! @} */

/*! @name UNMECR - Uncorrectable non-fatal memory error configuration register */
/*! @{ */

#define NETC_SW_ENETC_UNMECR_THRESHOLD_MASK      (0xFFU)
#define NETC_SW_ENETC_UNMECR_THRESHOLD_SHIFT     (0U)
/*! THRESHOLD - Threshold */
#define NETC_SW_ENETC_UNMECR_THRESHOLD(x)        (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_UNMECR_THRESHOLD_SHIFT)) & NETC_SW_ENETC_UNMECR_THRESHOLD_MASK)

#define NETC_SW_ENETC_UNMECR_RD_MASK             (0x80000000U)
#define NETC_SW_ENETC_UNMECR_RD_SHIFT            (31U)
/*! RD - Report disable */
#define NETC_SW_ENETC_UNMECR_RD(x)               (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_UNMECR_RD_SHIFT)) & NETC_SW_ENETC_UNMECR_RD_MASK)
/*! @} */

/*! @name UNMESR0 - Uncorrectable non-fatal memory error status register 0 */
/*! @{ */

#define NETC_SW_ENETC_UNMESR0_SYNDROME_MASK      (0x7FFU)
#define NETC_SW_ENETC_UNMESR0_SYNDROME_SHIFT     (0U)
/*! SYNDROME - Syndrome */
#define NETC_SW_ENETC_UNMESR0_SYNDROME(x)        (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_UNMESR0_SYNDROME_SHIFT)) & NETC_SW_ENETC_UNMESR0_SYNDROME_MASK)

#define NETC_SW_ENETC_UNMESR0_MEM_ID_MASK        (0x1F0000U)
#define NETC_SW_ENETC_UNMESR0_MEM_ID_SHIFT       (16U)
/*! MEM_ID - Memory ID */
#define NETC_SW_ENETC_UNMESR0_MEM_ID(x)          (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_UNMESR0_MEM_ID_SHIFT)) & NETC_SW_ENETC_UNMESR0_MEM_ID_MASK)

#define NETC_SW_ENETC_UNMESR0_MBEE_MASK          (0x80000000U)
#define NETC_SW_ENETC_UNMESR0_MBEE_SHIFT         (31U)
/*! MBEE - Multi-bit ECC error */
#define NETC_SW_ENETC_UNMESR0_MBEE(x)            (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_UNMESR0_MBEE_SHIFT)) & NETC_SW_ENETC_UNMESR0_MBEE_MASK)
/*! @} */

/*! @name UNMESR1 - Uncorrectable non-fatal memory error status register 1 */
/*! @{ */

#define NETC_SW_ENETC_UNMESR1_ADDR_MASK          (0xFFFFFFFFU)
#define NETC_SW_ENETC_UNMESR1_ADDR_SHIFT         (0U)
/*! ADDR - Address */
#define NETC_SW_ENETC_UNMESR1_ADDR(x)            (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_UNMESR1_ADDR_SHIFT)) & NETC_SW_ENETC_UNMESR1_ADDR_MASK)
/*! @} */

/*! @name UNMECTR - Uncorrectable non-fatal memory error count register */
/*! @{ */

#define NETC_SW_ENETC_UNMECTR_COUNT_MASK         (0xFFU)
#define NETC_SW_ENETC_UNMECTR_COUNT_SHIFT        (0U)
/*! COUNT - Count */
#define NETC_SW_ENETC_UNMECTR_COUNT(x)           (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_UNMECTR_COUNT_SHIFT)) & NETC_SW_ENETC_UNMECTR_COUNT_MASK)
/*! @} */

/*! @name UFMECR - Uncorrectable fatal memory error configuration register */
/*! @{ */

#define NETC_SW_ENETC_UFMECR_RD_MASK             (0x80000000U)
#define NETC_SW_ENETC_UFMECR_RD_SHIFT            (31U)
/*! RD - Report disable */
#define NETC_SW_ENETC_UFMECR_RD(x)               (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_UFMECR_RD_SHIFT)) & NETC_SW_ENETC_UFMECR_RD_MASK)
/*! @} */

/*! @name UFMESR0 - Uncorrectable fatal memory error status register 0 */
/*! @{ */

#define NETC_SW_ENETC_UFMESR0_SYNDROME_MASK      (0x7FFU)
#define NETC_SW_ENETC_UFMESR0_SYNDROME_SHIFT     (0U)
/*! SYNDROME - Syndrome */
#define NETC_SW_ENETC_UFMESR0_SYNDROME(x)        (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_UFMESR0_SYNDROME_SHIFT)) & NETC_SW_ENETC_UFMESR0_SYNDROME_MASK)

