JayHeng/imxrt-tool-flash-algo/boards/nxp_evkmimxrt1180_rev.c/flash_algo_c0_silicon/Keil_JLink/rom_api/MIMXRT1189_cm7.h
/* The count of NETC_SW_ENETC_VLANDRMPR */
#define NETC_SW_ENETC_VLANDRMPR_COUNT            (2U)

/*! @name IPFCAPR - Ingress port filter capability register */
/*! @{ */

#define NETC_SW_ENETC_IPFCAPR_RP_MASK            (0x1U)
#define NETC_SW_ENETC_IPFCAPR_RP_SHIFT           (0U)
/*! RP - Rate Policer function supported */
#define NETC_SW_ENETC_IPFCAPR_RP(x)              (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_IPFCAPR_RP_SHIFT)) & NETC_SW_ENETC_IPFCAPR_RP_MASK)

#define NETC_SW_ENETC_IPFCAPR_ISID_MASK          (0x2U)
#define NETC_SW_ENETC_IPFCAPR_ISID_SHIFT         (1U)
/*! ISID - Ingress Stream Identification supported. */
#define NETC_SW_ENETC_IPFCAPR_ISID(x)            (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_IPFCAPR_ISID_SHIFT)) & NETC_SW_ENETC_IPFCAPR_ISID_MASK)

#define NETC_SW_ENETC_IPFCAPR_FWD_SI_MASK        (0x4U)
#define NETC_SW_ENETC_IPFCAPR_FWD_SI_SHIFT       (2U)
#define NETC_SW_ENETC_IPFCAPR_FWD_SI(x)          (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_IPFCAPR_FWD_SI_SHIFT)) & NETC_SW_ENETC_IPFCAPR_FWD_SI_MASK)

#define NETC_SW_ENETC_IPFCAPR_WOL_MASK           (0x8U)
#define NETC_SW_ENETC_IPFCAPR_WOL_SHIFT          (3U)
#define NETC_SW_ENETC_IPFCAPR_WOL(x)             (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_IPFCAPR_WOL_SHIFT)) & NETC_SW_ENETC_IPFCAPR_WOL_MASK)
/*! @} */

/*! @name IPFTCAPR - Ingress port filter table capability register */
/*! @{ */

#define NETC_SW_ENETC_IPFTCAPR_NUM_WORDS_MASK    (0xFFFFU)
#define NETC_SW_ENETC_IPFTCAPR_NUM_WORDS_SHIFT   (0U)
#define NETC_SW_ENETC_IPFTCAPR_NUM_WORDS(x)      (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_IPFTCAPR_NUM_WORDS_SHIFT)) & NETC_SW_ENETC_IPFTCAPR_NUM_WORDS_MASK)

#define NETC_SW_ENETC_IPFTCAPR_MGMT_MASK         (0x10000U)
#define NETC_SW_ENETC_IPFTCAPR_MGMT_SHIFT        (16U)
#define NETC_SW_ENETC_IPFTCAPR_MGMT(x)           (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_IPFTCAPR_MGMT_SHIFT)) & NETC_SW_ENETC_IPFTCAPR_MGMT_MASK)

#define NETC_SW_ENETC_IPFTCAPR_ACCESS_METH_MASK  (0xF00000U)
#define NETC_SW_ENETC_IPFTCAPR_ACCESS_METH_SHIFT (20U)
#define NETC_SW_ENETC_IPFTCAPR_ACCESS_METH(x)    (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_IPFTCAPR_ACCESS_METH_SHIFT)) & NETC_SW_ENETC_IPFTCAPR_ACCESS_METH_MASK)

#define NETC_SW_ENETC_IPFTCAPR_ENTRY_MAX_WORDS_MASK (0xF000000U)
#define NETC_SW_ENETC_IPFTCAPR_ENTRY_MAX_WORDS_SHIFT (24U)
#define NETC_SW_ENETC_IPFTCAPR_ENTRY_MAX_WORDS(x) (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_IPFTCAPR_ENTRY_MAX_WORDS_SHIFT)) & NETC_SW_ENETC_IPFTCAPR_ENTRY_MAX_WORDS_MASK)

#define NETC_SW_ENETC_IPFTCAPR_WORD_SIZE_MASK    (0x30000000U)
#define NETC_SW_ENETC_IPFTCAPR_WORD_SIZE_SHIFT   (28U)
#define NETC_SW_ENETC_IPFTCAPR_WORD_SIZE(x)      (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_IPFTCAPR_WORD_SIZE_SHIFT)) & NETC_SW_ENETC_IPFTCAPR_WORD_SIZE_MASK)
/*! @} */

/*! @name IPFTMOR - Ingress port filter table memory operational register */
/*! @{ */

#define NETC_SW_ENETC_IPFTMOR_NUM_WORDS_MASK     (0xFFFFU)
#define NETC_SW_ENETC_IPFTMOR_NUM_WORDS_SHIFT    (0U)
#define NETC_SW_ENETC_IPFTMOR_NUM_WORDS(x)       (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_IPFTMOR_NUM_WORDS_SHIFT)) & NETC_SW_ENETC_IPFTMOR_NUM_WORDS_MASK)
/*! @} */

/*! @name ITMCAPR - Index table memory capability register */
/*! @{ */

#define NETC_SW_ENETC_ITMCAPR_NUM_WORDS_MASK     (0xFFFFU)
#define NETC_SW_ENETC_ITMCAPR_NUM_WORDS_SHIFT    (0U)
#define NETC_SW_ENETC_ITMCAPR_NUM_WORDS(x)       (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ITMCAPR_NUM_WORDS_SHIFT)) & NETC_SW_ENETC_ITMCAPR_NUM_WORDS_MASK)

#define NETC_SW_ENETC_ITMCAPR_WORD_SIZE_MASK     (0x30000000U)
#define NETC_SW_ENETC_ITMCAPR_WORD_SIZE_SHIFT    (28U)
#define NETC_SW_ENETC_ITMCAPR_WORD_SIZE(x)       (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ITMCAPR_WORD_SIZE_SHIFT)) & NETC_SW_ENETC_ITMCAPR_WORD_SIZE_MASK)

#define NETC_SW_ENETC_ITMCAPR_MLOC_MASK          (0xC0000000U)
#define NETC_SW_ENETC_ITMCAPR_MLOC_SHIFT         (30U)
#define NETC_SW_ENETC_ITMCAPR_MLOC(x)            (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ITMCAPR_MLOC_SHIFT)) & NETC_SW_ENETC_ITMCAPR_MLOC_MASK)
/*! @} */

/*! @name RPCAPR - Rate policer capability register */
/*! @{ */

#define NETC_SW_ENETC_RPCAPR_TRTCM_MASK          (0x1U)
#define NETC_SW_ENETC_RPCAPR_TRTCM_SHIFT         (0U)
/*! TRTCM - Two-Rate Three-Color Marker supported per MEF 10.3 standard. */
#define NETC_SW_ENETC_RPCAPR_TRTCM(x)            (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_RPCAPR_TRTCM_SHIFT)) & NETC_SW_ENETC_RPCAPR_TRTCM_MASK)

#define NETC_SW_ENETC_RPCAPR_CM_MASK             (0x2U)
#define NETC_SW_ENETC_RPCAPR_CM_SHIFT            (1U)
#define NETC_SW_ENETC_RPCAPR_CM(x)               (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_RPCAPR_CM_SHIFT)) & NETC_SW_ENETC_RPCAPR_CM_MASK)
/*! @} */

/*! @name RPITCAPR - Rate policer index table capability register */
/*! @{ */

#define NETC_SW_ENETC_RPITCAPR_NUM_ENTRIES_MASK  (0x3FFFU)
#define NETC_SW_ENETC_RPITCAPR_NUM_ENTRIES_SHIFT (0U)
#define NETC_SW_ENETC_RPITCAPR_NUM_ENTRIES(x)    (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_RPITCAPR_NUM_ENTRIES_SHIFT)) & NETC_SW_ENETC_RPITCAPR_NUM_ENTRIES_MASK)

#define NETC_SW_ENETC_RPITCAPR_ACCESS_METH_MASK  (0xF00000U)
#define NETC_SW_ENETC_RPITCAPR_ACCESS_METH_SHIFT (20U)
#define NETC_SW_ENETC_RPITCAPR_ACCESS_METH(x)    (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_RPITCAPR_ACCESS_METH_SHIFT)) & NETC_SW_ENETC_RPITCAPR_ACCESS_METH_MASK)
/*! @} */

/*! @name RPITMAR - Rate policer index table memory allocation register */
/*! @{ */

#define NETC_SW_ENETC_RPITMAR_NUM_WORDS_MASK     (0xFFFFU)
#define NETC_SW_ENETC_RPITMAR_NUM_WORDS_SHIFT    (0U)
#define NETC_SW_ENETC_RPITMAR_NUM_WORDS(x)       (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_RPITMAR_NUM_WORDS_SHIFT)) & NETC_SW_ENETC_RPITMAR_NUM_WORDS_MASK)
/*! @} */

/*! @name RPITOR - Rate policer index table operational register */
/*! @{ */

#define NETC_SW_ENETC_RPITOR_NUM_ENTRIES_MASK    (0x3FFFU)
#define NETC_SW_ENETC_RPITOR_NUM_ENTRIES_SHIFT   (0U)
#define NETC_SW_ENETC_RPITOR_NUM_ENTRIES(x)      (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_RPITOR_NUM_ENTRIES_SHIFT)) & NETC_SW_ENETC_RPITOR_NUM_ENTRIES_MASK)
/*! @} */

