JayHeng/imxrt-tool-flash-algo/boards/nxp_evkmimxrt1180_rev.c/flash_algo_c0_silicon/Keil_JLink/rom_api/MIMXRT1189_cm7.h
/* The count of ROM_ROMPATCHD */
#define ROM_ROMPATCHD_COUNT                      (16U)

/*! @name ROMPATCHCNTL - Control Register */
/*! @{ */

#define ROM_ROMPATCHCNTL_DATAFIX0_MASK           (0x1U)
#define ROM_ROMPATCHCNTL_DATAFIX0_SHIFT          (0U)
/*! DATAFIX0 - Data Fix Enable
 *  0b0..Trigger an opcode patch
 *  0b1..Trigger a data fix
 */
#define ROM_ROMPATCHCNTL_DATAFIX0(x)             (((uint32_t)(((uint32_t)(x)) << ROM_ROMPATCHCNTL_DATAFIX0_SHIFT)) & ROM_ROMPATCHCNTL_DATAFIX0_MASK)

#define ROM_ROMPATCHCNTL_DATAFIX1_MASK           (0x2U)
#define ROM_ROMPATCHCNTL_DATAFIX1_SHIFT          (1U)
/*! DATAFIX1 - Data Fix Enable
 *  0b0..Trigger an opcode patch
 *  0b1..Trigger a data fix
 */
#define ROM_ROMPATCHCNTL_DATAFIX1(x)             (((uint32_t)(((uint32_t)(x)) << ROM_ROMPATCHCNTL_DATAFIX1_SHIFT)) & ROM_ROMPATCHCNTL_DATAFIX1_MASK)

#define ROM_ROMPATCHCNTL_DATAFIX2_MASK           (0x4U)
#define ROM_ROMPATCHCNTL_DATAFIX2_SHIFT          (2U)
/*! DATAFIX2 - Data Fix Enable
 *  0b0..Trigger an opcode patch
 *  0b1..Trigger a data fix
 */
#define ROM_ROMPATCHCNTL_DATAFIX2(x)             (((uint32_t)(((uint32_t)(x)) << ROM_ROMPATCHCNTL_DATAFIX2_SHIFT)) & ROM_ROMPATCHCNTL_DATAFIX2_MASK)

#define ROM_ROMPATCHCNTL_DATAFIX3_MASK           (0x8U)
#define ROM_ROMPATCHCNTL_DATAFIX3_SHIFT          (3U)
/*! DATAFIX3 - Data Fix Enable
 *  0b0..Trigger an opcode patch
 *  0b1..Trigger a data fix
 */
#define ROM_ROMPATCHCNTL_DATAFIX3(x)             (((uint32_t)(((uint32_t)(x)) << ROM_ROMPATCHCNTL_DATAFIX3_SHIFT)) & ROM_ROMPATCHCNTL_DATAFIX3_MASK)

#define ROM_ROMPATCHCNTL_DATAFIX4_MASK           (0x10U)
#define ROM_ROMPATCHCNTL_DATAFIX4_SHIFT          (4U)
/*! DATAFIX4 - Data Fix Enable
 *  0b0..Trigger an opcode patch
 *  0b1..Trigger a data fix
 */
#define ROM_ROMPATCHCNTL_DATAFIX4(x)             (((uint32_t)(((uint32_t)(x)) << ROM_ROMPATCHCNTL_DATAFIX4_SHIFT)) & ROM_ROMPATCHCNTL_DATAFIX4_MASK)

#define ROM_ROMPATCHCNTL_DATAFIX5_MASK           (0x20U)
#define ROM_ROMPATCHCNTL_DATAFIX5_SHIFT          (5U)
/*! DATAFIX5 - Data Fix Enable
 *  0b0..Trigger an opcode patch
 *  0b1..Trigger a data fix
 */
#define ROM_ROMPATCHCNTL_DATAFIX5(x)             (((uint32_t)(((uint32_t)(x)) << ROM_ROMPATCHCNTL_DATAFIX5_SHIFT)) & ROM_ROMPATCHCNTL_DATAFIX5_MASK)

#define ROM_ROMPATCHCNTL_DATAFIX6_MASK           (0x40U)
#define ROM_ROMPATCHCNTL_DATAFIX6_SHIFT          (6U)
/*! DATAFIX6 - Data Fix Enable
 *  0b0..Trigger an opcode patch
 *  0b1..Trigger a data fix
 */
#define ROM_ROMPATCHCNTL_DATAFIX6(x)             (((uint32_t)(((uint32_t)(x)) << ROM_ROMPATCHCNTL_DATAFIX6_SHIFT)) & ROM_ROMPATCHCNTL_DATAFIX6_MASK)

#define ROM_ROMPATCHCNTL_DATAFIX7_MASK           (0x80U)
#define ROM_ROMPATCHCNTL_DATAFIX7_SHIFT          (7U)
/*! DATAFIX7 - Data Fix Enable
 *  0b0..Trigger an opcode patch
 *  0b1..Trigger a data fix
 */
#define ROM_ROMPATCHCNTL_DATAFIX7(x)             (((uint32_t)(((uint32_t)(x)) << ROM_ROMPATCHCNTL_DATAFIX7_SHIFT)) & ROM_ROMPATCHCNTL_DATAFIX7_MASK)

#define ROM_ROMPATCHCNTL_DATAFIX8_MASK           (0x100U)
#define ROM_ROMPATCHCNTL_DATAFIX8_SHIFT          (8U)
/*! DATAFIX8 - Data Fix Enable
 *  0b0..Trigger an opcode patch
 *  0b1..Trigger a data fix
 */
#define ROM_ROMPATCHCNTL_DATAFIX8(x)             (((uint32_t)(((uint32_t)(x)) << ROM_ROMPATCHCNTL_DATAFIX8_SHIFT)) & ROM_ROMPATCHCNTL_DATAFIX8_MASK)

#define ROM_ROMPATCHCNTL_DATAFIX9_MASK           (0x200U)
#define ROM_ROMPATCHCNTL_DATAFIX9_SHIFT          (9U)
/*! DATAFIX9 - Data Fix Enable
 *  0b0..Trigger an opcode patch
 *  0b1..Trigger a data fix
 */
#define ROM_ROMPATCHCNTL_DATAFIX9(x)             (((uint32_t)(((uint32_t)(x)) << ROM_ROMPATCHCNTL_DATAFIX9_SHIFT)) & ROM_ROMPATCHCNTL_DATAFIX9_MASK)

#define ROM_ROMPATCHCNTL_DATAFIX10_MASK          (0x400U)
#define ROM_ROMPATCHCNTL_DATAFIX10_SHIFT         (10U)
/*! DATAFIX10 - Data Fix Enable
 *  0b0..Trigger an opcode patch
 *  0b1..Trigger a data fix
 */
#define ROM_ROMPATCHCNTL_DATAFIX10(x)            (((uint32_t)(((uint32_t)(x)) << ROM_ROMPATCHCNTL_DATAFIX10_SHIFT)) & ROM_ROMPATCHCNTL_DATAFIX10_MASK)

#define ROM_ROMPATCHCNTL_DATAFIX11_MASK          (0x800U)
#define ROM_ROMPATCHCNTL_DATAFIX11_SHIFT         (11U)
/*! DATAFIX11 - Data Fix Enable
 *  0b0..Trigger an opcode patch
 *  0b1..Trigger a data fix
 */
#define ROM_ROMPATCHCNTL_DATAFIX11(x)            (((uint32_t)(((uint32_t)(x)) << ROM_ROMPATCHCNTL_DATAFIX11_SHIFT)) & ROM_ROMPATCHCNTL_DATAFIX11_MASK)

#define ROM_ROMPATCHCNTL_DATAFIX12_MASK          (0x1000U)
#define ROM_ROMPATCHCNTL_DATAFIX12_SHIFT         (12U)
/*! DATAFIX12 - Data Fix Enable
 *  0b0..Trigger an opcode patch
 *  0b1..Trigger a data fix
 */
#define ROM_ROMPATCHCNTL_DATAFIX12(x)            (((uint32_t)(((uint32_t)(x)) << ROM_ROMPATCHCNTL_DATAFIX12_SHIFT)) & ROM_ROMPATCHCNTL_DATAFIX12_MASK)

#define ROM_ROMPATCHCNTL_DATAFIX13_MASK          (0x2000U)
#define ROM_ROMPATCHCNTL_DATAFIX13_SHIFT         (13U)
/*! DATAFIX13 - Data Fix Enable
 *  0b0..Trigger an opcode patch
 *  0b1..Trigger a data fix
 */
#define ROM_ROMPATCHCNTL_DATAFIX13(x)            (((uint32_t)(((uint32_t)(x)) << ROM_ROMPATCHCNTL_DATAFIX13_SHIFT)) & ROM_ROMPATCHCNTL_DATAFIX13_MASK)

#define ROM_ROMPATCHCNTL_DATAFIX14_MASK          (0x4000U)
#define ROM_ROMPATCHCNTL_DATAFIX14_SHIFT         (14U)
/*! DATAFIX14 - Data Fix Enable
 *  0b0..Trigger an opcode patch
 *  0b1..Trigger a data fix
 */
#define ROM_ROMPATCHCNTL_DATAFIX14(x)            (((uint32_t)(((uint32_t)(x)) << ROM_ROMPATCHCNTL_DATAFIX14_SHIFT)) & ROM_ROMPATCHCNTL_DATAFIX14_MASK)

#define ROM_ROMPATCHCNTL_DATAFIX15_MASK          (0x8000U)
#define ROM_ROMPATCHCNTL_DATAFIX15_SHIFT         (15U)
/*! DATAFIX15 - Data Fix Enable
 *  0b0..Trigger an opcode patch
 *  0b1..Trigger a data fix
 */
#define ROM_ROMPATCHCNTL_DATAFIX15(x)            (((uint32_t)(((uint32_t)(x)) << ROM_ROMPATCHCNTL_DATAFIX15_SHIFT)) & ROM_ROMPATCHCNTL_DATAFIX15_MASK)

#define ROM_ROMPATCHCNTL_DIS_MASK                (0x20000000U)
#define ROM_ROMPATCHCNTL_DIS_SHIFT               (29U)
/*! DIS - Patch Disable
 *  0b0..Does not affect any Patch operations (default)
 *  0b1..Disables all Patch operations: data fixing and opcode patching
 */
#define ROM_ROMPATCHCNTL_DIS(x)                  (((uint32_t)(((uint32_t)(x)) << ROM_ROMPATCHCNTL_DIS_SHIFT)) & ROM_ROMPATCHCNTL_DIS_MASK)

