JayHeng/imxrt-tool-flash-algo/boards/nxp_evkmimxrt1180_rev.c/flash_algo_c0_silicon/Keil_JLink/rom_api/MIMXRT1189_cm7.h
#define SRC_GENERAL_SRTMR_JTAGSW_TRIG_MODE_MASK  (0x80U)
#define SRC_GENERAL_SRTMR_JTAGSW_TRIG_MODE_SHIFT (7U)
/*! JTAGSW_TRIG_MODE - Jtagsw reset trigger mode configuration, locked by LOCK_CFG field
 *  0b0..Level-sensitive: System stays in reset until the reset source deasserts.
 *  0b1..Edge-sensitive: System resets once, even if the reset source remains asserted.
 */
#define SRC_GENERAL_SRTMR_JTAGSW_TRIG_MODE(x)    (((uint32_t)(((uint32_t)(x)) << SRC_GENERAL_SRTMR_JTAGSW_TRIG_MODE_SHIFT)) & SRC_GENERAL_SRTMR_JTAGSW_TRIG_MODE_MASK)

#define SRC_GENERAL_SRTMR_CM33_RESET_TRIG_MODE_MASK (0x100U)
#define SRC_GENERAL_SRTMR_CM33_RESET_TRIG_MODE_SHIFT (8U)
/*! CM33_RESET_TRIG_MODE - CM33 reset trigger mode configuration, locked by LOCK_CFG field.
 *  0b0..Level-sensitive: System stays in reset until the reset source deasserts.
 *  0b1..Edge-sensitive: System resets once, even if the reset source remains asserted.
 */
#define SRC_GENERAL_SRTMR_CM33_RESET_TRIG_MODE(x) (((uint32_t)(((uint32_t)(x)) << SRC_GENERAL_SRTMR_CM33_RESET_TRIG_MODE_SHIFT)) & SRC_GENERAL_SRTMR_CM33_RESET_TRIG_MODE_MASK)

#define SRC_GENERAL_SRTMR_CM33_LOCKUP_TRIG_MODE_MASK (0x200U)
#define SRC_GENERAL_SRTMR_CM33_LOCKUP_TRIG_MODE_SHIFT (9U)
/*! CM33_LOCKUP_TRIG_MODE - CM33 lockup trigger mode configuration, locked by LOCK_CFG field.
 *  0b0..Level-sensitive: System stays in reset until the reset source deasserts.
 *  0b1..Edge-sensitive: System resets once, even if the reset source remains asserted.
 */
#define SRC_GENERAL_SRTMR_CM33_LOCKUP_TRIG_MODE(x) (((uint32_t)(((uint32_t)(x)) << SRC_GENERAL_SRTMR_CM33_LOCKUP_TRIG_MODE_SHIFT)) & SRC_GENERAL_SRTMR_CM33_LOCKUP_TRIG_MODE_MASK)

#define SRC_GENERAL_SRTMR_CM7_RESET_TRIG_MODE_MASK (0x400U)
#define SRC_GENERAL_SRTMR_CM7_RESET_TRIG_MODE_SHIFT (10U)
/*! CM7_RESET_TRIG_MODE - CM7 reset trigger mode configuration, locked by LOCK_CFG field
 *  0b0..Level-sensitive: System stays in reset until the reset source deasserts.
 *  0b1..Edge-sensitive: System resets once, even if the reset source remains asserted.
 */
#define SRC_GENERAL_SRTMR_CM7_RESET_TRIG_MODE(x) (((uint32_t)(((uint32_t)(x)) << SRC_GENERAL_SRTMR_CM7_RESET_TRIG_MODE_SHIFT)) & SRC_GENERAL_SRTMR_CM7_RESET_TRIG_MODE_MASK)

#define SRC_GENERAL_SRTMR_CM7_LOCKUP_TRIG_MODE_MASK (0x800U)
#define SRC_GENERAL_SRTMR_CM7_LOCKUP_TRIG_MODE_SHIFT (11U)
/*! CM7_LOCKUP_TRIG_MODE - CM7 lockup trigger mode configuration, locked by LOCK_CFG field
 *  0b0..Level-sensitive: System stays in reset until the reset source deasserts.
 *  0b1..Edge-sensitive: System resets once, even if the reset source remains asserted.
 */
#define SRC_GENERAL_SRTMR_CM7_LOCKUP_TRIG_MODE(x) (((uint32_t)(((uint32_t)(x)) << SRC_GENERAL_SRTMR_CM7_LOCKUP_TRIG_MODE_SHIFT)) & SRC_GENERAL_SRTMR_CM7_LOCKUP_TRIG_MODE_MASK)

#define SRC_GENERAL_SRTMR_DCDC_OVVT_TRIG_MODE_MASK (0x1000U)
#define SRC_GENERAL_SRTMR_DCDC_OVVT_TRIG_MODE_SHIFT (12U)
/*! DCDC_OVVT_TRIG_MODE - DCDC over voltage trigger mode configuration, locked by LOCK_CFG field
 *  0b0..Level-sensitive: System stays in reset until the reset source deasserts.
 *  0b1..Edge-sensitive: System resets once, even if the reset source remains asserted.
 */
#define SRC_GENERAL_SRTMR_DCDC_OVVT_TRIG_MODE(x) (((uint32_t)(((uint32_t)(x)) << SRC_GENERAL_SRTMR_DCDC_OVVT_TRIG_MODE_SHIFT)) & SRC_GENERAL_SRTMR_DCDC_OVVT_TRIG_MODE_MASK)

#define SRC_GENERAL_SRTMR_ECAT_RSTO_TRIG_MODE_MASK (0x2000U)
#define SRC_GENERAL_SRTMR_ECAT_RSTO_TRIG_MODE_SHIFT (13U)
/*! ECAT_RSTO_TRIG_MODE - ECAT reset output mode configuration, locked by LOCK_CFG field
 *  0b0..Level-sensitive: System stays in reset until the reset source deasserts.
 *  0b1..Edge-sensitive: System resets once, even if the reset source remains asserted.
 */
#define SRC_GENERAL_SRTMR_ECAT_RSTO_TRIG_MODE(x) (((uint32_t)(((uint32_t)(x)) << SRC_GENERAL_SRTMR_ECAT_RSTO_TRIG_MODE_SHIFT)) & SRC_GENERAL_SRTMR_ECAT_RSTO_TRIG_MODE_MASK)
/*! @} */

/*! @name SRMASK - SRC Reset Mask Register */
/*! @{ */

#define SRC_GENERAL_SRMASK_WDOG1_MASK_MASK       (0x1U)
#define SRC_GENERAL_SRMASK_WDOG1_MASK_SHIFT      (0U)
/*! WDOG1_MASK - WDOG1 reset mask
 *  0b0..The reset source can work
 *  0b1..The reset source is masked, cannot work
 */
#define SRC_GENERAL_SRMASK_WDOG1_MASK(x)         (((uint32_t)(((uint32_t)(x)) << SRC_GENERAL_SRMASK_WDOG1_MASK_SHIFT)) & SRC_GENERAL_SRMASK_WDOG1_MASK_MASK)

#define SRC_GENERAL_SRMASK_WDOG2_MASK_MASK       (0x2U)
#define SRC_GENERAL_SRMASK_WDOG2_MASK_SHIFT      (1U)
/*! WDOG2_MASK - WDOG2 reset mask
 *  0b0..The reset source can work
 *  0b1..The reset source is masked, cannot work
 */
#define SRC_GENERAL_SRMASK_WDOG2_MASK(x)         (((uint32_t)(((uint32_t)(x)) << SRC_GENERAL_SRMASK_WDOG2_MASK_SHIFT)) & SRC_GENERAL_SRMASK_WDOG2_MASK_MASK)

#define SRC_GENERAL_SRMASK_WDOG3_MASK_MASK       (0x4U)
#define SRC_GENERAL_SRMASK_WDOG3_MASK_SHIFT      (2U)
/*! WDOG3_MASK - WDOG3 reset mask
 *  0b0..The reset source can work
 *  0b1..The reset source is masked, cannot work
 */
#define SRC_GENERAL_SRMASK_WDOG3_MASK(x)         (((uint32_t)(((uint32_t)(x)) << SRC_GENERAL_SRMASK_WDOG3_MASK_SHIFT)) & SRC_GENERAL_SRMASK_WDOG3_MASK_MASK)

#define SRC_GENERAL_SRMASK_WDOG4_MASK_MASK       (0x8U)
#define SRC_GENERAL_SRMASK_WDOG4_MASK_SHIFT      (3U)
/*! WDOG4_MASK - WDOG4 reset mask
 *  0b0..The reset source can work
 *  0b1..The reset source is masked, cannot work
 */
#define SRC_GENERAL_SRMASK_WDOG4_MASK(x)         (((uint32_t)(((uint32_t)(x)) << SRC_GENERAL_SRMASK_WDOG4_MASK_SHIFT)) & SRC_GENERAL_SRMASK_WDOG4_MASK_MASK)

#define SRC_GENERAL_SRMASK_WDOG5_MASK_MASK       (0x10U)
#define SRC_GENERAL_SRMASK_WDOG5_MASK_SHIFT      (4U)
/*! WDOG5_MASK - WDOG5 reset mask
 *  0b0..The reset source can work
 *  0b1..The reset source is masked, cannot work
 */
#define SRC_GENERAL_SRMASK_WDOG5_MASK(x)         (((uint32_t)(((uint32_t)(x)) << SRC_GENERAL_SRMASK_WDOG5_MASK_SHIFT)) & SRC_GENERAL_SRMASK_WDOG5_MASK_MASK)

#define SRC_GENERAL_SRMASK_TEMPSENSE_MASK_MASK   (0x20U)
#define SRC_GENERAL_SRMASK_TEMPSENSE_MASK_SHIFT  (5U)
/*! TEMPSENSE_MASK - TempSense reset mask
 *  0b0..The reset source can work
 *  0b1..The reset source is masked, cannot work
 */
#define SRC_GENERAL_SRMASK_TEMPSENSE_MASK(x)     (((uint32_t)(((uint32_t)(x)) << SRC_GENERAL_SRMASK_TEMPSENSE_MASK_SHIFT)) & SRC_GENERAL_SRMASK_TEMPSENSE_MASK_MASK)

