JayHeng/imxrt-tool-flash-algo/boards/nxp_evkmimxrt1180_rev.c/flash_algo_c0_silicon/Keil_JLink/rom_api/MIMXRT1189_cm7.h
#define SRC_GENERAL_SRSR_BBSM_CM33_LOCKUP_MASK   (0x400U)
#define SRC_GENERAL_SRSR_BBSM_CM33_LOCKUP_SHIFT  (10U)
/*! CM33_LOCKUP - Indicates a reset has been caused by cm33 CPU lockup
 *  0b0..Reset is not a result of the cm33 lockup.
 *  0b1..Reset is a result of the cm33 lockup.
 */
#define SRC_GENERAL_SRSR_BBSM_CM33_LOCKUP(x)     (((uint32_t)(((uint32_t)(x)) << SRC_GENERAL_SRSR_BBSM_CM33_LOCKUP_SHIFT)) & SRC_GENERAL_SRSR_BBSM_CM33_LOCKUP_MASK)

#define SRC_GENERAL_SRSR_BBSM_CM7_REQUEST_MASK   (0x800U)
#define SRC_GENERAL_SRSR_BBSM_CM7_REQUEST_SHIFT  (11U)
/*! CM7_REQUEST - Indicates whether reset was the result of cm7 reset request
 *  0b0..Reset is not a result of cm7 reset request.
 *  0b1..Reset is a result of cm7 reset request.
 */
#define SRC_GENERAL_SRSR_BBSM_CM7_REQUEST(x)     (((uint32_t)(((uint32_t)(x)) << SRC_GENERAL_SRSR_BBSM_CM7_REQUEST_SHIFT)) & SRC_GENERAL_SRSR_BBSM_CM7_REQUEST_MASK)

#define SRC_GENERAL_SRSR_BBSM_CM7_LOCKUP_MASK    (0x1000U)
#define SRC_GENERAL_SRSR_BBSM_CM7_LOCKUP_SHIFT   (12U)
/*! CM7_LOCKUP - Indicates a reset has been caused by CM7 CPU
 *  0b0..Reset is not a result of the cm7 lockup.
 *  0b1..Reset is a result of the cm7 lockup.
 */
#define SRC_GENERAL_SRSR_BBSM_CM7_LOCKUP(x)      (((uint32_t)(((uint32_t)(x)) << SRC_GENERAL_SRSR_BBSM_CM7_LOCKUP_SHIFT)) & SRC_GENERAL_SRSR_BBSM_CM7_LOCKUP_MASK)

#define SRC_GENERAL_SRSR_BBSM_DCDC_OVVT_MASK     (0x2000U)
#define SRC_GENERAL_SRSR_BBSM_DCDC_OVVT_SHIFT    (13U)
/*! DCDC_OVVT - Indicates a reset has been caused by DCDC over voltage
 *  0b0..Reset is not a result of the DCDC over voltage.
 *  0b1..Reset is a result of the DCDC over voltage.
 */
#define SRC_GENERAL_SRSR_BBSM_DCDC_OVVT(x)       (((uint32_t)(((uint32_t)(x)) << SRC_GENERAL_SRSR_BBSM_DCDC_OVVT_SHIFT)) & SRC_GENERAL_SRSR_BBSM_DCDC_OVVT_MASK)

#define SRC_GENERAL_SRSR_BBSM_ECAT_RSTO_MASK     (0x4000U)
#define SRC_GENERAL_SRSR_BBSM_ECAT_RSTO_SHIFT    (14U)
/*! ECAT_RSTO - Indicates a reset has been caused by ECAT reset output
 *  0b0..Reset is not a result of the ECAT reset output.
 *  0b1..Reset is a result of the ECAT reset output.
 */
#define SRC_GENERAL_SRSR_BBSM_ECAT_RSTO(x)       (((uint32_t)(((uint32_t)(x)) << SRC_GENERAL_SRSR_BBSM_ECAT_RSTO_SHIFT)) & SRC_GENERAL_SRSR_BBSM_ECAT_RSTO_MASK)
/*! @} */

/*! @name SRSR - SRC Reset Status Register */
/*! @{ */

#define SRC_GENERAL_SRSR_POR_RST_MASK            (0x1U)
#define SRC_GENERAL_SRSR_POR_RST_SHIFT           (0U)
/*! POR_RST - Indicates whether the reset was the result of POR.
 *  0b0..Reset is not a result of POR.
 *  0b1..Reset is a result of POR.
 */
#define SRC_GENERAL_SRSR_POR_RST(x)              (((uint32_t)(((uint32_t)(x)) << SRC_GENERAL_SRSR_POR_RST_SHIFT)) & SRC_GENERAL_SRSR_POR_RST_MASK)

#define SRC_GENERAL_SRSR_WDOG1_RST_B_MASK        (0x2U)
#define SRC_GENERAL_SRSR_WDOG1_RST_B_SHIFT       (1U)
/*! WDOG1_RST_B - Time-out reset. Indicates whether the reset was the result of the watchdog1 time-out event.
 *  0b0..Reset is not a result of the watchdog time-out event.
 *  0b1..Reset is a result of the watchdog time-out event.
 */
#define SRC_GENERAL_SRSR_WDOG1_RST_B(x)          (((uint32_t)(((uint32_t)(x)) << SRC_GENERAL_SRSR_WDOG1_RST_B_SHIFT)) & SRC_GENERAL_SRSR_WDOG1_RST_B_MASK)

#define SRC_GENERAL_SRSR_WDOG2_RST_B_MASK        (0x4U)
#define SRC_GENERAL_SRSR_WDOG2_RST_B_SHIFT       (2U)
/*! WDOG2_RST_B - Time-out reset. Indicates whether the reset was the result of the watchdog2 time-out event.
 *  0b0..Reset is not a result of the watchdog time-out event.
 *  0b1..Reset is a result of the watchdog time-out event.
 */
#define SRC_GENERAL_SRSR_WDOG2_RST_B(x)          (((uint32_t)(((uint32_t)(x)) << SRC_GENERAL_SRSR_WDOG2_RST_B_SHIFT)) & SRC_GENERAL_SRSR_WDOG2_RST_B_MASK)

#define SRC_GENERAL_SRSR_WDOG3_RST_B_MASK        (0x8U)
#define SRC_GENERAL_SRSR_WDOG3_RST_B_SHIFT       (3U)
/*! WDOG3_RST_B - Time-out reset. Indicates whether the reset was the result of the watchdog3 time-out
 *  0b0..Reset is not a result of the watchdog3 time-out event.
 *  0b1..Reset is a result of the watchdog3 time-out event.
 */
#define SRC_GENERAL_SRSR_WDOG3_RST_B(x)          (((uint32_t)(((uint32_t)(x)) << SRC_GENERAL_SRSR_WDOG3_RST_B_SHIFT)) & SRC_GENERAL_SRSR_WDOG3_RST_B_MASK)

#define SRC_GENERAL_SRSR_WDOG4_RST_B_MASK        (0x10U)
#define SRC_GENERAL_SRSR_WDOG4_RST_B_SHIFT       (4U)
/*! WDOG4_RST_B - Time-out reset. Indicates whether the reset was the result of the watchdog4 time-out
 *  0b0..Reset is not a result of the watchdog time-out event.
 *  0b1..Reset is a result of the watchdog time-out event.
 */
#define SRC_GENERAL_SRSR_WDOG4_RST_B(x)          (((uint32_t)(((uint32_t)(x)) << SRC_GENERAL_SRSR_WDOG4_RST_B_SHIFT)) & SRC_GENERAL_SRSR_WDOG4_RST_B_MASK)

#define SRC_GENERAL_SRSR_WDOG5_RST_B_MASK        (0x20U)
#define SRC_GENERAL_SRSR_WDOG5_RST_B_SHIFT       (5U)
/*! WDOG5_RST_B - Time-out reset. Indicates whether the reset was the result of the watchdog5 time-out
 *  0b0..Reset is not a result of the watchdog time-out event.
 *  0b1..Reset is a result of the watchdog time-out event.
 */
#define SRC_GENERAL_SRSR_WDOG5_RST_B(x)          (((uint32_t)(((uint32_t)(x)) << SRC_GENERAL_SRSR_WDOG5_RST_B_SHIFT)) & SRC_GENERAL_SRSR_WDOG5_RST_B_MASK)

#define SRC_GENERAL_SRSR_TEMPSENSE_RST_B_MASK    (0x40U)
#define SRC_GENERAL_SRSR_TEMPSENSE_RST_B_SHIFT   (6U)
/*! TEMPSENSE_RST_B - Temper Sensor software reset. Indicates whether the reset was the result of
 *    software reset from on-chip Temperature Sensor.
 *  0b0..Reset is not a result of software reset from Temperature Sensor.
 *  0b1..Reset is a result of software reset from Temperature Sensor.
 */
#define SRC_GENERAL_SRSR_TEMPSENSE_RST_B(x)      (((uint32_t)(((uint32_t)(x)) << SRC_GENERAL_SRSR_TEMPSENSE_RST_B_SHIFT)) & SRC_GENERAL_SRSR_TEMPSENSE_RST_B_MASK)

#define SRC_GENERAL_SRSR_EDGELOCK_RESET_B_MASK   (0x80U)
#define SRC_GENERAL_SRSR_EDGELOCK_RESET_B_SHIFT  (7U)
/*! EDGELOCK_RESET_B - Indicates whether the reset was the result of the Edgelock's reset input.
 *  0b0..Reset is not a result of the Edgelock's reset event.
 *  0b1..Reset is a result of the Edgelock's reset event.
 */
#define SRC_GENERAL_SRSR_EDGELOCK_RESET_B(x)     (((uint32_t)(((uint32_t)(x)) << SRC_GENERAL_SRSR_EDGELOCK_RESET_B_SHIFT)) & SRC_GENERAL_SRSR_EDGELOCK_RESET_B_MASK)

#define SRC_GENERAL_SRSR_JTAG_SW_RST_MASK        (0x100U)
#define SRC_GENERAL_SRSR_JTAG_SW_RST_SHIFT       (8U)
/*! JTAG_SW_RST - JTAG software reset. Indicates whether the reset was the result of software reset from JTAG.
 *  0b0..Reset is not a result of software reset from JTAG.
 *  0b1..Reset is a result of software reset from JTAG.
 */
#define SRC_GENERAL_SRSR_JTAG_SW_RST(x)          (((uint32_t)(((uint32_t)(x)) << SRC_GENERAL_SRSR_JTAG_SW_RST_SHIFT)) & SRC_GENERAL_SRSR_JTAG_SW_RST_MASK)

