JayHeng/imxrt-tool-flash-algo/boards/nxp_evkmimxrt1180_rev.c/flash_algo_c0_silicon/Keil_JLink/rom_api/MIMXRT1189_cm7.h
#define SRC_MIF_LN28FDSOI_SPLLRAM_MIF_MLPL_PD_B_SW_PD_B_MASK (0x10000U)
#define SRC_MIF_LN28FDSOI_SPLLRAM_MIF_MLPL_PD_B_SW_PD_B_SHIFT (16U)
/*! SW_PD_B - software control PD_B
 *  0b1..PD_B is 1.
 *  0b0..PD_B is 0.
 */
#define SRC_MIF_LN28FDSOI_SPLLRAM_MIF_MLPL_PD_B_SW_PD_B(x) (((uint32_t)(((uint32_t)(x)) << SRC_MIF_LN28FDSOI_SPLLRAM_MIF_MLPL_PD_B_SW_PD_B_SHIFT)) & SRC_MIF_LN28FDSOI_SPLLRAM_MIF_MLPL_PD_B_SW_PD_B_MASK)
/*! @} */

/*! @name MIF_DLY_PD_B - MIF Delay of PD_B */
/*! @{ */

#define SRC_MIF_LN28FDSOI_SPLLRAM_MIF_DLY_PD_B_PRE_HI_DLY_MASK (0xFFFFU)
#define SRC_MIF_LN28FDSOI_SPLLRAM_MIF_DLY_PD_B_PRE_HI_DLY_SHIFT (0U)
/*! PRE_HI_DLY - Delay before asserting signal to high, locked by LOCK_CFG field */
#define SRC_MIF_LN28FDSOI_SPLLRAM_MIF_DLY_PD_B_PRE_HI_DLY(x) (((uint32_t)(((uint32_t)(x)) << SRC_MIF_LN28FDSOI_SPLLRAM_MIF_DLY_PD_B_PRE_HI_DLY_SHIFT)) & SRC_MIF_LN28FDSOI_SPLLRAM_MIF_DLY_PD_B_PRE_HI_DLY_MASK)

#define SRC_MIF_LN28FDSOI_SPLLRAM_MIF_DLY_PD_B_PRE_LO_DLY_MASK (0xFFFF0000U)
#define SRC_MIF_LN28FDSOI_SPLLRAM_MIF_DLY_PD_B_PRE_LO_DLY_SHIFT (16U)
/*! PRE_LO_DLY - Delay before de-asserting signal to low, locked by LOCK_CFG field */
#define SRC_MIF_LN28FDSOI_SPLLRAM_MIF_DLY_PD_B_PRE_LO_DLY(x) (((uint32_t)(((uint32_t)(x)) << SRC_MIF_LN28FDSOI_SPLLRAM_MIF_DLY_PD_B_PRE_LO_DLY_SHIFT)) & SRC_MIF_LN28FDSOI_SPLLRAM_MIF_DLY_PD_B_PRE_LO_DLY_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group SRC_MIF_LN28FDSOI_SPLLRAM_Register_Masks */


/* SRC_MIF_LN28FDSOI_SPLLRAM - Peripheral instance base addresses */
/** Peripheral AON_MIF_LN28FDSOI_SPLLRAM base address */
#define AON_MIF_LN28FDSOI_SPLLRAM_BASE           (0x44462400u)
/** Peripheral AON_MIF_LN28FDSOI_SPLLRAM base pointer */
#define AON_MIF_LN28FDSOI_SPLLRAM                ((SRC_MIF_LN28FDSOI_SPLLRAM_Type *)AON_MIF_LN28FDSOI_SPLLRAM_BASE)
/** Peripheral WAKEUP_MIF_LN28FDSOI_SPLLRAM base address */
#define WAKEUP_MIF_LN28FDSOI_SPLLRAM_BASE        (0x44462C00u)
/** Peripheral WAKEUP_MIF_LN28FDSOI_SPLLRAM base pointer */
#define WAKEUP_MIF_LN28FDSOI_SPLLRAM             ((SRC_MIF_LN28FDSOI_SPLLRAM_Type *)WAKEUP_MIF_LN28FDSOI_SPLLRAM_BASE)
/** Peripheral MEGA_MIF_LN28FDSOI_SPLLRAM base address */
#define MEGA_MIF_LN28FDSOI_SPLLRAM_BASE          (0x44463400u)
/** Peripheral MEGA_MIF_LN28FDSOI_SPLLRAM base pointer */
#define MEGA_MIF_LN28FDSOI_SPLLRAM               ((SRC_MIF_LN28FDSOI_SPLLRAM_Type *)MEGA_MIF_LN28FDSOI_SPLLRAM_BASE)
/** Peripheral NETC_MIF_LN28FDSOI_SPLLRAM base address */
#define NETC_MIF_LN28FDSOI_SPLLRAM_BASE          (0x44463C00u)
/** Peripheral NETC_MIF_LN28FDSOI_SPLLRAM base pointer */
#define NETC_MIF_LN28FDSOI_SPLLRAM               ((SRC_MIF_LN28FDSOI_SPLLRAM_Type *)NETC_MIF_LN28FDSOI_SPLLRAM_BASE)
/** Array initializer of SRC_MIF_LN28FDSOI_SPLLRAM peripheral base addresses */
#define SRC_MIF_LN28FDSOI_SPLLRAM_BASE_ADDRS     { AON_MIF_LN28FDSOI_SPLLRAM_BASE, WAKEUP_MIF_LN28FDSOI_SPLLRAM_BASE, MEGA_MIF_LN28FDSOI_SPLLRAM_BASE, NETC_MIF_LN28FDSOI_SPLLRAM_BASE }
/** Array initializer of SRC_MIF_LN28FDSOI_SPLLRAM peripheral base pointers */
#define SRC_MIF_LN28FDSOI_SPLLRAM_BASE_PTRS      { AON_MIF_LN28FDSOI_SPLLRAM, WAKEUP_MIF_LN28FDSOI_SPLLRAM, MEGA_MIF_LN28FDSOI_SPLLRAM, NETC_MIF_LN28FDSOI_SPLLRAM }

/*!
 * @}
 */ /* end of group SRC_MIF_LN28FDSOI_SPLLRAM_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- SRC_MIF_S28SPREGH Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SRC_MIF_S28SPREGH_Peripheral_Access_Layer SRC_MIF_S28SPREGH Peripheral Access Layer
 * @{
 */

/** SRC_MIF_S28SPREGH - Register Layout Typedef */
typedef struct {
       uint8_t RESERVED_0[4];
  __IO uint32_t MIF_CTRL;                          /**< MPC Control, offset: 0x4 */
  __I  uint32_t MIF_STAT;                          /**< MIF Status, offset: 0x8 */
       uint8_t RESERVED_1[4];
  __IO uint32_t MIF_MLPL_LS;                       /**< MIF MLPL control of LS, offset: 0x10 */
  __IO uint32_t MIF_DLY_LS;                        /**< MIF Delay of LS, offset: 0x14 */
       uint8_t RESERVED_2[8];
  __IO uint32_t MIF_MLPL_HS;                       /**< MIF MLPL control of HS, offset: 0x20 */
  __IO uint32_t MIF_DLY_HS;                        /**< MIF Delay of HS, offset: 0x24 */
       uint8_t RESERVED_3[8];
  __IO uint32_t MIF_MLPL_IG;                       /**< MIF MLPL control of Input Gating (IG), offset: 0x30 */
  __IO uint32_t MIF_DLY_IG;                        /**< MIF Delay of IG, offset: 0x34 */
       uint8_t RESERVED_4[8];
  __IO uint32_t MIF_MLPL_STDBY;                    /**< MIF MLPL control of STDBY, offset: 0x40 */
  __IO uint32_t MIF_DLY_STDBY;                     /**< MIF Delay of STDBY, offset: 0x44 */
} SRC_MIF_S28SPREGH_Type;

/* ----------------------------------------------------------------------------
   -- SRC_MIF_S28SPREGH Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SRC_MIF_S28SPREGH_Register_Masks SRC_MIF_S28SPREGH Register Masks
 * @{
 */

/*! @name MIF_CTRL - MPC Control */
/*! @{ */

#define SRC_MIF_S28SPREGH_MIF_CTRL_SW_CTRL_PIN_MASK (0x1U)
#define SRC_MIF_S28SPREGH_MIF_CTRL_SW_CTRL_PIN_SHIFT (0U)
/*! SW_CTRL_PIN - Memory low power pins controlled by software (SW)
 *  0b0..Uses CURRENT_MLPL field to select MLPL_CTRL to control low power signal.
 *  0b1..Uses SW_* field to control low power signal directly.
 */
#define SRC_MIF_S28SPREGH_MIF_CTRL_SW_CTRL_PIN(x) (((uint32_t)(((uint32_t)(x)) << SRC_MIF_S28SPREGH_MIF_CTRL_SW_CTRL_PIN_SHIFT)) & SRC_MIF_S28SPREGH_MIF_CTRL_SW_CTRL_PIN_MASK)

#define SRC_MIF_S28SPREGH_MIF_CTRL_MEM_PWR_ST_EN_MASK (0x2U)
#define SRC_MIF_S28SPREGH_MIF_CTRL_MEM_PWR_ST_EN_SHIFT (1U)
/*! MEM_PWR_ST_EN - Memory power status will be considered when determining slice power status.
 *  0b1..Memory power status will be considered when determining slice power status.
 *  0b0..Memory power status will not be considered when determining slice power status.
 */
#define SRC_MIF_S28SPREGH_MIF_CTRL_MEM_PWR_ST_EN(x) (((uint32_t)(((uint32_t)(x)) << SRC_MIF_S28SPREGH_MIF_CTRL_MEM_PWR_ST_EN_SHIFT)) & SRC_MIF_S28SPREGH_MIF_CTRL_MEM_PWR_ST_EN_MASK)

#define SRC_MIF_S28SPREGH_MIF_CTRL_LOCK_CFG_MASK (0x100000U)
#define SRC_MIF_S28SPREGH_MIF_CTRL_LOCK_CFG_SHIFT (20U)
/*! LOCK_CFG - Configuration lock
 *  0b0..The fields are not locked.
 *  0b1..The fields are locked.
 */
#define SRC_MIF_S28SPREGH_MIF_CTRL_LOCK_CFG(x)   (((uint32_t)(((uint32_t)(x)) << SRC_MIF_S28SPREGH_MIF_CTRL_LOCK_CFG_SHIFT)) & SRC_MIF_S28SPREGH_MIF_CTRL_LOCK_CFG_MASK)
/*! @} */

/*! @name MIF_STAT - MIF Status */
/*! @{ */

