JayHeng/imxrt-tool-flash-algo/boards/nxp_evkmimxrt1180_rev.c/flash_algo_c0_silicon/Keil_JLink/rom_api/MIMXRT1189_cm7.h
#define SRC_MIX_SLICE_AUTHEN_CTRL_TZ_USER_MASK   (0x100U)
#define SRC_MIX_SLICE_AUTHEN_CTRL_TZ_USER_SHIFT  (8U)
/*! TZ_USER - Allow user mode write
 *  0b0..The MIX SLICE registers and its MEM Type I/II registers can only be written in privilege mode.
 *  0b1..The MIX SLICE registers and its MEM Type I/II registers can be written either in privilege mode or user mode.
 */
#define SRC_MIX_SLICE_AUTHEN_CTRL_TZ_USER(x)     (((uint32_t)(((uint32_t)(x)) << SRC_MIX_SLICE_AUTHEN_CTRL_TZ_USER_SHIFT)) & SRC_MIX_SLICE_AUTHEN_CTRL_TZ_USER_MASK)

#define SRC_MIX_SLICE_AUTHEN_CTRL_TZ_NS_MASK     (0x200U)
#define SRC_MIX_SLICE_AUTHEN_CTRL_TZ_NS_SHIFT    (9U)
/*! TZ_NS - Allow non-secure mode access
 *  0b0..The MIX SLICE registers and its MEM Type I/II registers can only be written in secure mode.
 *  0b1..The MIX SLICE registers and its MEM Type I/II registers can be written either in secure mode or non-secure mode.
 */
#define SRC_MIX_SLICE_AUTHEN_CTRL_TZ_NS(x)       (((uint32_t)(((uint32_t)(x)) << SRC_MIX_SLICE_AUTHEN_CTRL_TZ_NS_SHIFT)) & SRC_MIX_SLICE_AUTHEN_CTRL_TZ_NS_MASK)

#define SRC_MIX_SLICE_AUTHEN_CTRL_LOCK_TZ_MASK   (0x800U)
#define SRC_MIX_SLICE_AUTHEN_CTRL_LOCK_TZ_SHIFT  (11U)
/*! LOCK_TZ - Lock TZ_NS and TZ_USER
 *  0b0..TZ_NS and TZ_USER value can be changed.
 *  0b1..LOCK_TZ, TZ_NS and TZ_USER value cannot be changed.
 */
#define SRC_MIX_SLICE_AUTHEN_CTRL_LOCK_TZ(x)     (((uint32_t)(((uint32_t)(x)) << SRC_MIX_SLICE_AUTHEN_CTRL_LOCK_TZ_SHIFT)) & SRC_MIX_SLICE_AUTHEN_CTRL_LOCK_TZ_MASK)

#define SRC_MIX_SLICE_AUTHEN_CTRL_LOCK_LIST_MASK (0x8000U)
#define SRC_MIX_SLICE_AUTHEN_CTRL_LOCK_LIST_SHIFT (15U)
/*! LOCK_LIST - White list lock
 *  0b0..WHITE_LIST value can be changed.
 *  0b1..LOCK_LIST and WHITE_LIST value cannot be changed.
 */
#define SRC_MIX_SLICE_AUTHEN_CTRL_LOCK_LIST(x)   (((uint32_t)(((uint32_t)(x)) << SRC_MIX_SLICE_AUTHEN_CTRL_LOCK_LIST_SHIFT)) & SRC_MIX_SLICE_AUTHEN_CTRL_LOCK_LIST_MASK)

#define SRC_MIX_SLICE_AUTHEN_CTRL_WHITE_LIST_MASK (0xFFFF0000U)
#define SRC_MIX_SLICE_AUTHEN_CTRL_WHITE_LIST_SHIFT (16U)
/*! WHITE_LIST - Domain ID white list
 *  0b0000000000000001..Core with domain ID=0 can write SRC MIX SLICE registers.
 *  0b0000000000000010..Core with domain ID=1 can write SRC MIX SLICE registers.
 *  0b0000000000000100..Core with domain ID=2 can write SRC MIX SLICE registers.
 *  0b0000000000001000..Core with domain ID=3 can write SRC MIX SLICE registers.
 *  0b0000000000010000..Core with domain ID=4 can write SRC MIX SLICE registers.
 *  0b0000000000100000..Core with domain ID=5 can write SRC MIX SLICE registers.
 *  0b0000000001000000..Core with domain ID=6 can write SRC MIX SLICE registers.
 *  0b0000000010000000..Core with domain ID=7 can write SRC MIX SLICE registers.
 *  0b0000000100000000..Core with domain ID=8 can write SRC MIX SLICE registers.
 *  0b0000001000000000..Core with domain ID=9 can write SRC MIX SLICE registers.
 *  0b0000010000000000..Core with domain ID=10 can write SRC MIX SLICE registers.
 *  0b0000100000000000..Core with domain ID=11 can write SRC MIX SLICE registers.
 *  0b0001000000000000..Core with domain ID=12 can write SRC MIX SLICE registers.
 *  0b0010000000000000..Core with domain ID=13 can write SRC MIX SLICE registers.
 *  0b0100000000000000..Core with domain ID=14 can write SRC MIX SLICE registers.
 *  0b1000000000000000..Core with domain ID=15 can write SRC MIX SLICE registers.
 */
#define SRC_MIX_SLICE_AUTHEN_CTRL_WHITE_LIST(x)  (((uint32_t)(((uint32_t)(x)) << SRC_MIX_SLICE_AUTHEN_CTRL_WHITE_LIST_SHIFT)) & SRC_MIX_SLICE_AUTHEN_CTRL_WHITE_LIST_MASK)
/*! @} */

/*! @name SLICE_SW_CTRL - SLICE Software Control */
/*! @{ */

#define SRC_MIX_SLICE_SLICE_SW_CTRL_PSW_OFF_SOFT_MASK (0x1U)
#define SRC_MIX_SLICE_SLICE_SW_CTRL_PSW_OFF_SOFT_SHIFT (0U)
/*! PSW_OFF_SOFT - Software power off control. This field can only be updated while LPM_MODE=0.
 *  0b0..Clear to 0 to trigger power switch on
 *  0b1..Write 1 to trigger power switch off
 */
#define SRC_MIX_SLICE_SLICE_SW_CTRL_PSW_OFF_SOFT(x) (((uint32_t)(((uint32_t)(x)) << SRC_MIX_SLICE_SLICE_SW_CTRL_PSW_OFF_SOFT_SHIFT)) & SRC_MIX_SLICE_SLICE_SW_CTRL_PSW_OFF_SOFT_MASK)

#define SRC_MIX_SLICE_SLICE_SW_CTRL_RST_CTRL_SOFT_MASK (0x4U)
#define SRC_MIX_SLICE_SLICE_SW_CTRL_RST_CTRL_SOFT_SHIFT (2U)
/*! RST_CTRL_SOFT - Software reset control. This field can only be updated while LPM_MODE=0.
 *  0b0..Clear to 0 to trigger reset deassert
 *  0b1..Write 1 to trigger reset assert
 */
#define SRC_MIX_SLICE_SLICE_SW_CTRL_RST_CTRL_SOFT(x) (((uint32_t)(((uint32_t)(x)) << SRC_MIX_SLICE_SLICE_SW_CTRL_RST_CTRL_SOFT_SHIFT)) & SRC_MIX_SLICE_SLICE_SW_CTRL_RST_CTRL_SOFT_MASK)

#define SRC_MIX_SLICE_SLICE_SW_CTRL_ISO_ON_SOFT_MASK (0x10U)
#define SRC_MIX_SLICE_SLICE_SW_CTRL_ISO_ON_SOFT_SHIFT (4U)
/*! ISO_ON_SOFT - Software isolation on control. This field can only be updated while LPM_MODE=0.
 *  0b0..Clear to 0 to trigger isolation off
 *  0b1..Write 1 to trigger isolation on
 */
#define SRC_MIX_SLICE_SLICE_SW_CTRL_ISO_ON_SOFT(x) (((uint32_t)(((uint32_t)(x)) << SRC_MIX_SLICE_SLICE_SW_CTRL_ISO_ON_SOFT_SHIFT)) & SRC_MIX_SLICE_SLICE_SW_CTRL_ISO_ON_SOFT_MASK)

#define SRC_MIX_SLICE_SLICE_SW_CTRL_EDGELOCK_HDSK_SOFT_MASK (0x40U)
#define SRC_MIX_SLICE_SLICE_SW_CTRL_EDGELOCK_HDSK_SOFT_SHIFT (6U)
/*! EDGELOCK_HDSK_SOFT - Software Edgelock handshake control. This field can only be updated while LPM_MODE=0.
 *  0b0..Clear to 0 to trigger Edgelock handshake for power on.
 *  0b1..Write to 1 to trigger Edgelock handshake for power off.
 */
#define SRC_MIX_SLICE_SLICE_SW_CTRL_EDGELOCK_HDSK_SOFT(x) (((uint32_t)(((uint32_t)(x)) << SRC_MIX_SLICE_SLICE_SW_CTRL_EDGELOCK_HDSK_SOFT_SHIFT)) & SRC_MIX_SLICE_SLICE_SW_CTRL_EDGELOCK_HDSK_SOFT_MASK)

#define SRC_MIX_SLICE_SLICE_SW_CTRL_PDN_SOFT_MASK (0x80000000U)
#define SRC_MIX_SLICE_SLICE_SW_CTRL_PDN_SOFT_SHIFT (31U)
/*! PDN_SOFT - By flow sequence, Software power down sequence includes Edgelock handshake for power
 *    down, isolation on, reset assert, power off; Software power up sequence includes power up,
 *    reset deassert, isolation off, Edgelock handshake for power up. This bit can only be updated
 *    while LPM_MODE=0.
 *  0b0..Clear to 0 to trigger a power up sequence.
 *  0b1..Write 1 to trigger a power down sequence.
 */
#define SRC_MIX_SLICE_SLICE_SW_CTRL_PDN_SOFT(x)  (((uint32_t)(((uint32_t)(x)) << SRC_MIX_SLICE_SLICE_SW_CTRL_PDN_SOFT_SHIFT)) & SRC_MIX_SLICE_SLICE_SW_CTRL_PDN_SOFT_MASK)
/*! @} */

/*! @name FUNC_STAT - Function Status */
/*! @{ */

#define SRC_MIX_SLICE_FUNC_STAT_PSW_STAT_MASK    (0x1U)
#define SRC_MIX_SLICE_FUNC_STAT_PSW_STAT_SHIFT   (0U)
/*! PSW_STAT - power switch status
 *  0b0..power switch on
 *  0b1..power switch off
 */
#define SRC_MIX_SLICE_FUNC_STAT_PSW_STAT(x)      (((uint32_t)(((uint32_t)(x)) << SRC_MIX_SLICE_FUNC_STAT_PSW_STAT_SHIFT)) & SRC_MIX_SLICE_FUNC_STAT_PSW_STAT_MASK)

