JayHeng/imxrt-tool-flash-algo/boards/nxp_evkmimxrt1180_rev.c/flash_algo_c0_silicon/Keil_JLink/rom_api/MIMXRT1189_cm7.h
#define SRC_MIX_SLICE_EDGELOCK_HDSK_CNT_STAT_PON_CNT_MASK (0xFFFFU)
#define SRC_MIX_SLICE_EDGELOCK_HDSK_CNT_STAT_PON_CNT_SHIFT (0U)
/*! PON_CNT - Edgelock handshake for power up acknowledge count, record the delay from stat change to acknowledge received */
#define SRC_MIX_SLICE_EDGELOCK_HDSK_CNT_STAT_PON_CNT(x) (((uint32_t)(((uint32_t)(x)) << SRC_MIX_SLICE_EDGELOCK_HDSK_CNT_STAT_PON_CNT_SHIFT)) & SRC_MIX_SLICE_EDGELOCK_HDSK_CNT_STAT_PON_CNT_MASK)

#define SRC_MIX_SLICE_EDGELOCK_HDSK_CNT_STAT_POFF_CNT_MASK (0xFFFF0000U)
#define SRC_MIX_SLICE_EDGELOCK_HDSK_CNT_STAT_POFF_CNT_SHIFT (16U)
/*! POFF_CNT - Edgelock handshake for power down acknowledge count, record the delay from stat change to acknowledge received */
#define SRC_MIX_SLICE_EDGELOCK_HDSK_CNT_STAT_POFF_CNT(x) (((uint32_t)(((uint32_t)(x)) << SRC_MIX_SLICE_EDGELOCK_HDSK_CNT_STAT_POFF_CNT_SHIFT)) & SRC_MIX_SLICE_EDGELOCK_HDSK_CNT_STAT_POFF_CNT_MASK)
/*! @} */

/*! @name ISO_DLY_PRE - ISO Delay Pre control */
/*! @{ */

#define SRC_MIX_SLICE_ISO_DLY_PRE_ISO_OFF_CNT_MASK (0xFFFFU)
#define SRC_MIX_SLICE_ISO_DLY_PRE_ISO_OFF_CNT_SHIFT (0U)
/*! ISO_OFF_CNT - Delay from receiving iso off request to isolation disable, locked by LOCK_CFG field */
#define SRC_MIX_SLICE_ISO_DLY_PRE_ISO_OFF_CNT(x) (((uint32_t)(((uint32_t)(x)) << SRC_MIX_SLICE_ISO_DLY_PRE_ISO_OFF_CNT_SHIFT)) & SRC_MIX_SLICE_ISO_DLY_PRE_ISO_OFF_CNT_MASK)

#define SRC_MIX_SLICE_ISO_DLY_PRE_ISO_ON_CNT_MASK (0xFFFF0000U)
#define SRC_MIX_SLICE_ISO_DLY_PRE_ISO_ON_CNT_SHIFT (16U)
/*! ISO_ON_CNT - Delay from receiving iso_on request to isolation enable, locked by LOCK_CFG field */
#define SRC_MIX_SLICE_ISO_DLY_PRE_ISO_ON_CNT(x)  (((uint32_t)(((uint32_t)(x)) << SRC_MIX_SLICE_ISO_DLY_PRE_ISO_ON_CNT_SHIFT)) & SRC_MIX_SLICE_ISO_DLY_PRE_ISO_ON_CNT_MASK)
/*! @} */

/*! @name PSW_DLY_PRE_HF - PSW Delay Pre for HF */
/*! @{ */

#define SRC_MIX_SLICE_PSW_DLY_PRE_HF_PSW_ON_MASK (0xFFFFU)
#define SRC_MIX_SLICE_PSW_DLY_PRE_HF_PSW_ON_SHIFT (0U)
/*! PSW_ON - Delay from receiving power on hf request to power switch turn on, locked by LOCK_CFG field */
#define SRC_MIX_SLICE_PSW_DLY_PRE_HF_PSW_ON(x)   (((uint32_t)(((uint32_t)(x)) << SRC_MIX_SLICE_PSW_DLY_PRE_HF_PSW_ON_SHIFT)) & SRC_MIX_SLICE_PSW_DLY_PRE_HF_PSW_ON_MASK)

#define SRC_MIX_SLICE_PSW_DLY_PRE_HF_PSW_OFF_MASK (0xFFFF0000U)
#define SRC_MIX_SLICE_PSW_DLY_PRE_HF_PSW_OFF_SHIFT (16U)
/*! PSW_OFF - Delay from receiving power off hf request to power switch shut off, locked by LOCK_CFG field */
#define SRC_MIX_SLICE_PSW_DLY_PRE_HF_PSW_OFF(x)  (((uint32_t)(((uint32_t)(x)) << SRC_MIX_SLICE_PSW_DLY_PRE_HF_PSW_OFF_SHIFT)) & SRC_MIX_SLICE_PSW_DLY_PRE_HF_PSW_OFF_MASK)
/*! @} */

/*! @name PSW_DLY_PRE_LF - PSW Delay Pre for LF */
/*! @{ */

#define SRC_MIX_SLICE_PSW_DLY_PRE_LF_PSW_ON_MASK (0xFFFFU)
#define SRC_MIX_SLICE_PSW_DLY_PRE_LF_PSW_ON_SHIFT (0U)
/*! PSW_ON - Delay from receiving power on lf request to power switch turn on, locked by LOCK_CFG field */
#define SRC_MIX_SLICE_PSW_DLY_PRE_LF_PSW_ON(x)   (((uint32_t)(((uint32_t)(x)) << SRC_MIX_SLICE_PSW_DLY_PRE_LF_PSW_ON_SHIFT)) & SRC_MIX_SLICE_PSW_DLY_PRE_LF_PSW_ON_MASK)

#define SRC_MIX_SLICE_PSW_DLY_PRE_LF_PSW_OFF_MASK (0xFFFF0000U)
#define SRC_MIX_SLICE_PSW_DLY_PRE_LF_PSW_OFF_SHIFT (16U)
/*! PSW_OFF - Delay from receiving power off lf request to power switch shut off, locked by LOCK_CFG field */
#define SRC_MIX_SLICE_PSW_DLY_PRE_LF_PSW_OFF(x)  (((uint32_t)(((uint32_t)(x)) << SRC_MIX_SLICE_PSW_DLY_PRE_LF_PSW_OFF_SHIFT)) & SRC_MIX_SLICE_PSW_DLY_PRE_LF_PSW_OFF_MASK)
/*! @} */

/*! @name PSW_CTRL - PSW Control */
/*! @{ */

#define SRC_MIX_SLICE_PSW_CTRL_ACK_INVERT_LF_MASK (0x1U)
#define SRC_MIX_SLICE_PSW_CTRL_ACK_INVERT_LF_SHIFT (0U)
/*! ACK_INVERT_LF - Acknowledge for low fanout value is inverted from power switch control, locked by LOCK_CFG field
 *  0b0..Use original signal as ack
 *  0b1..Use inverted original signal as ack
 */
#define SRC_MIX_SLICE_PSW_CTRL_ACK_INVERT_LF(x)  (((uint32_t)(((uint32_t)(x)) << SRC_MIX_SLICE_PSW_CTRL_ACK_INVERT_LF_SHIFT)) & SRC_MIX_SLICE_PSW_CTRL_ACK_INVERT_LF_MASK)

#define SRC_MIX_SLICE_PSW_CTRL_ACK_INVERT_HF_MASK (0x2U)
#define SRC_MIX_SLICE_PSW_CTRL_ACK_INVERT_HF_SHIFT (1U)
/*! ACK_INVERT_HF - Acknowledge for high fanout value is inverted from power switch control, locked by LOCK_CFG field
 *  0b0..Use original signal as ack
 *  0b1..Use inverted original signal as ack
 */
#define SRC_MIX_SLICE_PSW_CTRL_ACK_INVERT_HF(x)  (((uint32_t)(((uint32_t)(x)) << SRC_MIX_SLICE_PSW_CTRL_ACK_INVERT_HF_SHIFT)) & SRC_MIX_SLICE_PSW_CTRL_ACK_INVERT_HF_MASK)

#define SRC_MIX_SLICE_PSW_CTRL_PON_CNT_MODE_MASK (0xC000U)
#define SRC_MIX_SLICE_PSW_CTRL_PON_CNT_MODE_SHIFT (14U)
/*! PON_CNT_MODE - Configure the acknowledge counter for power up working mode, locked by LOCK_CFG field
 *  0b00..Not use counter, raise power_on/off done to GPC once get psw ack
 *  0b01..Delay after receiving psw ack, delay cycle number is PON_CNT_CFG
 *  0b10..Ignore psw ack, raise power_on/off done to GPC when counting to PON_CNT_CFG value
 *  0b11..Time out mode, raise power_on/off done to GPC when either psw ack received or counting to PON_CNT_CFG value
 */
#define SRC_MIX_SLICE_PSW_CTRL_PON_CNT_MODE(x)   (((uint32_t)(((uint32_t)(x)) << SRC_MIX_SLICE_PSW_CTRL_PON_CNT_MODE_SHIFT)) & SRC_MIX_SLICE_PSW_CTRL_PON_CNT_MODE_MASK)

#define SRC_MIX_SLICE_PSW_CTRL_POFF_CNT_MODE_MASK (0xC0000000U)
#define SRC_MIX_SLICE_PSW_CTRL_POFF_CNT_MODE_SHIFT (30U)
/*! POFF_CNT_MODE - Configures the acknowledge counter for power down working mode, locked by LOCK_CFG field
 *  0b00..Not use counter, raise power_on/off done to GPC once get psw ack
 *  0b01..Delay after receiving psw ack, delay cycle number is POFF_CNT_CFG. When POFF_CNT_CFG value in HF/LF is different, bigger value will be used.
 *  0b10..Ignore psw ack, raise power_on/off done to GPC when counting to POFF_CNT_CFG value. When POFF_CNT_CFG
 *        value in HF/LF is different, bigger value will be used.
 *  0b11..Time out mode, raise power_on/off done to GPC when either psw ack received or counting to POFF_CNT_CFG
 *        value. When POFF_CNT_CFG value in HF/LF is different, bigger value will be used.
 */
#define SRC_MIX_SLICE_PSW_CTRL_POFF_CNT_MODE(x)  (((uint32_t)(((uint32_t)(x)) << SRC_MIX_SLICE_PSW_CTRL_POFF_CNT_MODE_SHIFT)) & SRC_MIX_SLICE_PSW_CTRL_POFF_CNT_MODE_MASK)
/*! @} */

/*! @name PSW_STAT - PSW Status */
/*! @{ */

#define SRC_MIX_SLICE_PSW_STAT_ACK_STAT_LF_MASK  (0x1U)
#define SRC_MIX_SLICE_PSW_STAT_ACK_STAT_LF_SHIFT (0U)
/*! ACK_STAT_LF - Power switch acknowledge status for low fanout
 *  0b0..Does not get ack for power switch
 *  0b1..Gets ack for power switch
 */
#define SRC_MIX_SLICE_PSW_STAT_ACK_STAT_LF(x)    (((uint32_t)(((uint32_t)(x)) << SRC_MIX_SLICE_PSW_STAT_ACK_STAT_LF_SHIFT)) & SRC_MIX_SLICE_PSW_STAT_ACK_STAT_LF_MASK)

#define SRC_MIX_SLICE_PSW_STAT_ACK_STAT_HF_MASK  (0x2U)
#define SRC_MIX_SLICE_PSW_STAT_ACK_STAT_HF_SHIFT (1U)
/*! ACK_STAT_HF - Power switch acknowledge status for high fanout
 *  0b0..Does not get ack for power switch
 *  0b1..Gets ack for power switch
 */
#define SRC_MIX_SLICE_PSW_STAT_ACK_STAT_HF(x)    (((uint32_t)(((uint32_t)(x)) << SRC_MIX_SLICE_PSW_STAT_ACK_STAT_HF_SHIFT)) & SRC_MIX_SLICE_PSW_STAT_ACK_STAT_HF_MASK)
/*! @} */

