JayHeng/imxrt-tool-flash-algo/boards/nxp_evkmimxrt1180_rev.c/flash_algo_c0_silicon/Keil_JLink/rom_api/MIMXRT1189_cm7.h
/*! @name PSW_CNT_CFG_HF - PSW Counter Config for HF */
/*! @{ */

#define SRC_MIX_SLICE_PSW_CNT_CFG_HF_PON_CNT_CFG_MASK (0xFFFFU)
#define SRC_MIX_SLICE_PSW_CNT_CFG_HF_PON_CNT_CFG_SHIFT (0U)
/*! PON_CNT_CFG - PUP HF Count config: usage depends on CNT_MODE, locked by LOCK_CFG field */
#define SRC_MIX_SLICE_PSW_CNT_CFG_HF_PON_CNT_CFG(x) (((uint32_t)(((uint32_t)(x)) << SRC_MIX_SLICE_PSW_CNT_CFG_HF_PON_CNT_CFG_SHIFT)) & SRC_MIX_SLICE_PSW_CNT_CFG_HF_PON_CNT_CFG_MASK)

#define SRC_MIX_SLICE_PSW_CNT_CFG_HF_POFF_CNT_CFG_MASK (0xFFFF0000U)
#define SRC_MIX_SLICE_PSW_CNT_CFG_HF_POFF_CNT_CFG_SHIFT (16U)
/*! POFF_CNT_CFG - PDN HF Count config: usage depends on CNT_MODE, locked by LOCK_CFG field */
#define SRC_MIX_SLICE_PSW_CNT_CFG_HF_POFF_CNT_CFG(x) (((uint32_t)(((uint32_t)(x)) << SRC_MIX_SLICE_PSW_CNT_CFG_HF_POFF_CNT_CFG_SHIFT)) & SRC_MIX_SLICE_PSW_CNT_CFG_HF_POFF_CNT_CFG_MASK)
/*! @} */

/*! @name PSW_CNT_STAT_HF - PSW Counter Status for HF */
/*! @{ */

#define SRC_MIX_SLICE_PSW_CNT_STAT_HF_PON_CNT_MASK (0xFFFFU)
#define SRC_MIX_SLICE_PSW_CNT_STAT_HF_PON_CNT_SHIFT (0U)
/*! PON_CNT - HF PSW acknowledge count for power up, record the delay from power switch change to acknowledge received */
#define SRC_MIX_SLICE_PSW_CNT_STAT_HF_PON_CNT(x) (((uint32_t)(((uint32_t)(x)) << SRC_MIX_SLICE_PSW_CNT_STAT_HF_PON_CNT_SHIFT)) & SRC_MIX_SLICE_PSW_CNT_STAT_HF_PON_CNT_MASK)

#define SRC_MIX_SLICE_PSW_CNT_STAT_HF_POFF_CNT_MASK (0xFFFF0000U)
#define SRC_MIX_SLICE_PSW_CNT_STAT_HF_POFF_CNT_SHIFT (16U)
/*! POFF_CNT - HF PSW acknowledge count for power down, record the delay from power switch change to acknowledge received */
#define SRC_MIX_SLICE_PSW_CNT_STAT_HF_POFF_CNT(x) (((uint32_t)(((uint32_t)(x)) << SRC_MIX_SLICE_PSW_CNT_STAT_HF_POFF_CNT_SHIFT)) & SRC_MIX_SLICE_PSW_CNT_STAT_HF_POFF_CNT_MASK)
/*! @} */

/*! @name PSW_CNT_CFG_LF - PSW Counter Config for LF */
/*! @{ */

#define SRC_MIX_SLICE_PSW_CNT_CFG_LF_PON_CNT_CFG_MASK (0xFFFFU)
#define SRC_MIX_SLICE_PSW_CNT_CFG_LF_PON_CNT_CFG_SHIFT (0U)
/*! PON_CNT_CFG - PUP LF Count config: usage depends on CNT_MODE, locked by LOCK_CFG field */
#define SRC_MIX_SLICE_PSW_CNT_CFG_LF_PON_CNT_CFG(x) (((uint32_t)(((uint32_t)(x)) << SRC_MIX_SLICE_PSW_CNT_CFG_LF_PON_CNT_CFG_SHIFT)) & SRC_MIX_SLICE_PSW_CNT_CFG_LF_PON_CNT_CFG_MASK)

#define SRC_MIX_SLICE_PSW_CNT_CFG_LF_POFF_CNT_CFG_MASK (0xFFFF0000U)
#define SRC_MIX_SLICE_PSW_CNT_CFG_LF_POFF_CNT_CFG_SHIFT (16U)
/*! POFF_CNT_CFG - PDN LF Count config: usage depends on CNT_MODE, locked by LOCK_CFG field */
#define SRC_MIX_SLICE_PSW_CNT_CFG_LF_POFF_CNT_CFG(x) (((uint32_t)(((uint32_t)(x)) << SRC_MIX_SLICE_PSW_CNT_CFG_LF_POFF_CNT_CFG_SHIFT)) & SRC_MIX_SLICE_PSW_CNT_CFG_LF_POFF_CNT_CFG_MASK)
/*! @} */

/*! @name PSW_CNT_STAT_LF - PSW Counter Status for LF */
/*! @{ */

#define SRC_MIX_SLICE_PSW_CNT_STAT_LF_PON_CNT_MASK (0xFFFFU)
#define SRC_MIX_SLICE_PSW_CNT_STAT_LF_PON_CNT_SHIFT (0U)
/*! PON_CNT - LF PSW acknowledge count for power up, record the delay from power switch change to acknowledge received */
#define SRC_MIX_SLICE_PSW_CNT_STAT_LF_PON_CNT(x) (((uint32_t)(((uint32_t)(x)) << SRC_MIX_SLICE_PSW_CNT_STAT_LF_PON_CNT_SHIFT)) & SRC_MIX_SLICE_PSW_CNT_STAT_LF_PON_CNT_MASK)

#define SRC_MIX_SLICE_PSW_CNT_STAT_LF_POFF_CNT_MASK (0xFFFF0000U)
#define SRC_MIX_SLICE_PSW_CNT_STAT_LF_POFF_CNT_SHIFT (16U)
/*! POFF_CNT - LF PSW acknowledge count for power down, record the delay from power switch change to acknowledge received */
#define SRC_MIX_SLICE_PSW_CNT_STAT_LF_POFF_CNT(x) (((uint32_t)(((uint32_t)(x)) << SRC_MIX_SLICE_PSW_CNT_STAT_LF_POFF_CNT_SHIFT)) & SRC_MIX_SLICE_PSW_CNT_STAT_LF_POFF_CNT_MASK)
/*! @} */

/*! @name MLPL_TRIG_CTRL - Memory Low Power Level Trigger Control */
/*! @{ */

#define SRC_MIX_SLICE_MLPL_TRIG_CTRL_SW_TRIG_LMEM_MLPL_TRANS_MASK (0x10000U)
#define SRC_MIX_SLICE_MLPL_TRIG_CTRL_SW_TRIG_LMEM_MLPL_TRANS_SHIFT (16U)
/*! SW_TRIG_LMEM_MLPL_TRANS - Software trigger local memory (MEM Type I with PSW or MEM Type I
 *    except for CM33PLATFORM_CACHE or CM7PLATFORM_CACHE, depending on which MIX of the register) update
 *    low power level
 *  0b0..No trigger
 *  0b1..Software trigger local memory update low power level
 */
#define SRC_MIX_SLICE_MLPL_TRIG_CTRL_SW_TRIG_LMEM_MLPL_TRANS(x) (((uint32_t)(((uint32_t)(x)) << SRC_MIX_SLICE_MLPL_TRIG_CTRL_SW_TRIG_LMEM_MLPL_TRANS_SHIFT)) & SRC_MIX_SLICE_MLPL_TRIG_CTRL_SW_TRIG_LMEM_MLPL_TRANS_MASK)

#define SRC_MIX_SLICE_MLPL_TRIG_CTRL_SW_TRIG_CACHE_MLPL_TRANS_MASK (0x20000U)
#define SRC_MIX_SLICE_MLPL_TRIG_CTRL_SW_TRIG_CACHE_MLPL_TRANS_SHIFT (17U)
/*! SW_TRIG_CACHE_MLPL_TRANS - Software trigger CACHE memory (MEM Type II or MEM Type I's
 *    CM33PLATFORM_CACHE or CM7PLATFORM_CACHE, depending on which MIX of the register) update low power level
 *  0b0..No trigger
 *  0b1..Software trigger CACHE memory update low power level
 */
#define SRC_MIX_SLICE_MLPL_TRIG_CTRL_SW_TRIG_CACHE_MLPL_TRANS(x) (((uint32_t)(((uint32_t)(x)) << SRC_MIX_SLICE_MLPL_TRIG_CTRL_SW_TRIG_CACHE_MLPL_TRANS_SHIFT)) & SRC_MIX_SLICE_MLPL_TRIG_CTRL_SW_TRIG_CACHE_MLPL_TRANS_MASK)
/*! @} */

/*! @name MLPL_CFG - Memory Low Power Level Config */
/*! @{ */

#define SRC_MIX_SLICE_MLPL_CFG_MLPL_HW_PDN_LMEM_MASK (0x7U)
#define SRC_MIX_SLICE_MLPL_CFG_MLPL_HW_PDN_LMEM_SHIFT (0U)
/*! MLPL_HW_PDN_LMEM - Memory(MEM Type I with PSW or MEM Type I except for CM33PLATFORM_CACHE or
 *    CM7PLATFORM_CACHE, depending on which MIX of the register) low power level when hw power down
 */
#define SRC_MIX_SLICE_MLPL_CFG_MLPL_HW_PDN_LMEM(x) (((uint32_t)(((uint32_t)(x)) << SRC_MIX_SLICE_MLPL_CFG_MLPL_HW_PDN_LMEM_SHIFT)) & SRC_MIX_SLICE_MLPL_CFG_MLPL_HW_PDN_LMEM_MASK)

#define SRC_MIX_SLICE_MLPL_CFG_MLPL_HW_PUP_LMEM_MASK (0x70U)
#define SRC_MIX_SLICE_MLPL_CFG_MLPL_HW_PUP_LMEM_SHIFT (4U)
/*! MLPL_HW_PUP_LMEM - Memory(MEM Type I with PSW or MEM Type I except for CM33PLATFORM_CACHE or
 *    CM7PLATFORM_CACHE, depending on which MIX of the register) low power level when hw power up
 */
#define SRC_MIX_SLICE_MLPL_CFG_MLPL_HW_PUP_LMEM(x) (((uint32_t)(((uint32_t)(x)) << SRC_MIX_SLICE_MLPL_CFG_MLPL_HW_PUP_LMEM_SHIFT)) & SRC_MIX_SLICE_MLPL_CFG_MLPL_HW_PUP_LMEM_MASK)

#define SRC_MIX_SLICE_MLPL_CFG_MLPL_SW_LMEM_MASK (0x7000U)
#define SRC_MIX_SLICE_MLPL_CFG_MLPL_SW_LMEM_SHIFT (12U)
/*! MLPL_SW_LMEM - Memory(MEM Type I with PSW or MEM Type I except for CM33PLATFORM_CACHE or
 *    CM7PLATFORM_CACHE, depending on which MIX of the register) low power level when sw trigger memory
 *    update power level
 */
#define SRC_MIX_SLICE_MLPL_CFG_MLPL_SW_LMEM(x)   (((uint32_t)(((uint32_t)(x)) << SRC_MIX_SLICE_MLPL_CFG_MLPL_SW_LMEM_SHIFT)) & SRC_MIX_SLICE_MLPL_CFG_MLPL_SW_LMEM_MASK)

