JayHeng/imxrt-tool-flash-algo/boards/nxp_evkmimxrt1180_rev.c/flash_algo_c0_silicon/Keil_JLink/rom_api/MIMXRT1189_cm7.h
/* The count of TRDC_W0 */
#define TRDC_MRC_DERR_W0_COUNT                   (7U)

/*! @name W1 - MRC Domain Error Word1 Register */
/*! @{ */

#define TRDC_W1_EDID_MASK                        (0xFU)
#define TRDC_W1_EDID_SHIFT                       (0U)
/*! EDID - Error domain identifier */
#define TRDC_W1_EDID(x)                          (((uint32_t)(((uint32_t)(x)) << TRDC_W1_EDID_SHIFT)) & TRDC_W1_EDID_MASK)

#define TRDC_W1_EATR_MASK                        (0x700U)
#define TRDC_W1_EATR_SHIFT                       (8U)
/*! EATR - Error attributes
 *  0b000..Secure user mode, instruction fetch access.
 *  0b001..Secure user mode, data access.
 *  0b010..Secure privileged mode, instruction fetch access.
 *  0b011..Secure privileged mode, data access.
 *  0b100..Nonsecure user mode, instruction fetch access.
 *  0b101..Nonsecure user mode, data access.
 *  0b110..Nonsecure privileged mode, instruction fetch access.
 *  0b111..Nonsecure privileged mode, data access.
 */
#define TRDC_W1_EATR(x)                          (((uint32_t)(((uint32_t)(x)) << TRDC_W1_EATR_SHIFT)) & TRDC_W1_EATR_MASK)

#define TRDC_W1_ERW_MASK                         (0x800U)
#define TRDC_W1_ERW_SHIFT                        (11U)
/*! ERW - Error read/write
 *  0b0..Read access
 *  0b1..Write access
 */
#define TRDC_W1_ERW(x)                           (((uint32_t)(((uint32_t)(x)) << TRDC_W1_ERW_SHIFT)) & TRDC_W1_ERW_MASK)

#define TRDC_W1_EPORT_MASK                       (0x7000000U)
#define TRDC_W1_EPORT_SHIFT                      (24U)
/*! EPORT - Error port */
#define TRDC_W1_EPORT(x)                         (((uint32_t)(((uint32_t)(x)) << TRDC_W1_EPORT_SHIFT)) & TRDC_W1_EPORT_MASK)

#define TRDC_W1_EST_MASK                         (0xC0000000U)
#define TRDC_W1_EST_SHIFT                        (30U)
/*! EST - Error state
 *  0b00..No access violation has been detected.
 *  0b01..No access violation has been detected.
 *  0b10..A single access violation has been detected.
 *  0b11..Multiple access violations for this domain have been detected by this submodule instance. Only the
 *        address and attribute information for the first error have been captured in DERR_W0_i and DERR_W1_i.
 */
#define TRDC_W1_EST(x)                           (((uint32_t)(((uint32_t)(x)) << TRDC_W1_EST_SHIFT)) & TRDC_W1_EST_MASK)
/*! @} */

/* The count of TRDC_W1 */
#define TRDC_MRC_DERR_W1_COUNT                   (7U)

/*! @name W3 - MRC Domain Error Word3 Register */
/*! @{ */

#define TRDC_W3_RECR_MASK                        (0xC0000000U)
#define TRDC_W3_RECR_SHIFT                       (30U)
/*! RECR - Rearm Error Capture Registers */
#define TRDC_W3_RECR(x)                          (((uint32_t)(((uint32_t)(x)) << TRDC_W3_RECR_SHIFT)) & TRDC_W3_RECR_MASK)
/*! @} */

/* The count of TRDC_W3 */
#define TRDC_MRC_DERR_W3_COUNT                   (7U)

/*! @name PID - Process Identifier */
/*! @{ */

#define TRDC_PID_PID_MASK                        (0x3FU)
#define TRDC_PID_PID_SHIFT                       (0U)
/*! PID - Process identifier */
#define TRDC_PID_PID(x)                          (((uint32_t)(((uint32_t)(x)) << TRDC_PID_PID_SHIFT)) & TRDC_PID_PID_MASK)

#define TRDC_PID_LK2_MASK                        (0x60000000U)
#define TRDC_PID_LK2_SHIFT                       (29U)
/*! LK2 - Lock
 *  0b00..Register can be written by any secure privileged write.
 *  0b01..Register can be written by any secure privileged write.
 *  0b10..Register can only be written by a secure privileged write from the bus master that locked the register.
 *  0b11..Register is locked (read-only) until the next reset.
 */
#define TRDC_PID_LK2(x)                          (((uint32_t)(((uint32_t)(x)) << TRDC_PID_LK2_SHIFT)) & TRDC_PID_LK2_MASK)
/*! @} */

/* The count of TRDC_PID */
#define TRDC_PID_COUNT                           (2U)

/*! @name MDA_W_DFMT0 - DAC Master Domain Assignment Register */
/*! @{ */

#define TRDC_MDA_W_DFMT0_DID_MASK                (0xFU)
#define TRDC_MDA_W_DFMT0_DID_SHIFT               (0U)
/*! DID - Domain identifier */
#define TRDC_MDA_W_DFMT0_DID(x)                  (((uint32_t)(((uint32_t)(x)) << TRDC_MDA_W_DFMT0_DID_SHIFT)) & TRDC_MDA_W_DFMT0_DID_MASK)

#define TRDC_MDA_W_DFMT0_DIDS_MASK               (0x30U)
#define TRDC_MDA_W_DFMT0_DIDS_SHIFT              (4U)
/*! DIDS - DID Select
 *  0b00..Use MDAm[3:0] as the domain identifier.
 *  0b01..Use the input DID as the domain identifier.
 *  0b10..Use MDAm[3:2] concatenated with the low-order 2 bits of the input DID (DID_in[1:0]) as the domain identifier.
 *  0b11..Reserved for future use.
 */
#define TRDC_MDA_W_DFMT0_DIDS(x)                 (((uint32_t)(((uint32_t)(x)) << TRDC_MDA_W_DFMT0_DIDS_SHIFT)) & TRDC_MDA_W_DFMT0_DIDS_MASK)

#define TRDC_MDA_W_DFMT0_PE_MASK                 (0xC0U)
#define TRDC_MDA_W_DFMT0_PE_SHIFT                (6U)
/*! PE - Process identifier enable
 *  0b00..No process identifier is included in the domain hit evaluation.
 *  0b01..No process identifier is included in the domain hit evaluation.
 *  0b10..PE = 2
 *  0b11..PE = 3
 */
#define TRDC_MDA_W_DFMT0_PE(x)                   (((uint32_t)(((uint32_t)(x)) << TRDC_MDA_W_DFMT0_PE_SHIFT)) & TRDC_MDA_W_DFMT0_PE_MASK)

#define TRDC_MDA_W_DFMT0_PIDM_MASK               (0x3F00U)
#define TRDC_MDA_W_DFMT0_PIDM_SHIFT              (8U)
/*! PIDM - Process Identifier Mask */
#define TRDC_MDA_W_DFMT0_PIDM(x)                 (((uint32_t)(((uint32_t)(x)) << TRDC_MDA_W_DFMT0_PIDM_SHIFT)) & TRDC_MDA_W_DFMT0_PIDM_MASK)

#define TRDC_MDA_W_DFMT0_SA_MASK                 (0xC000U)
#define TRDC_MDA_W_DFMT0_SA_SHIFT                (14U)
/*! SA - Secure attribute
 *  0b00..Force the bus attribute for this master to secure.
 *  0b01..Force the bus attribute for this master to nonsecure.
 *  0b10..Use the bus master's secure/nonsecure attribute directly.
 *  0b11..Use the bus master's secure/nonsecure attribute directly.
 */
#define TRDC_MDA_W_DFMT0_SA(x)                   (((uint32_t)(((uint32_t)(x)) << TRDC_MDA_W_DFMT0_SA_SHIFT)) & TRDC_MDA_W_DFMT0_SA_MASK)

