JayHeng/imxrt-tool-flash-algo/boards/nxp_evkmimxrt1180_rev.c/flash_algo_c0_silicon/Keil_JLink/rom_api/MIMXRT1189_cm7.h
#define TRDC_MDA_W_DFMT0_PID_MASK                (0x3F0000U)
#define TRDC_MDA_W_DFMT0_PID_SHIFT               (16U)
/*! PID - Process Identifier */
#define TRDC_MDA_W_DFMT0_PID(x)                  (((uint32_t)(((uint32_t)(x)) << TRDC_MDA_W_DFMT0_PID_SHIFT)) & TRDC_MDA_W_DFMT0_PID_MASK)

#define TRDC_MDA_W_DFMT0_DFMT_MASK               (0x20000000U)
#define TRDC_MDA_W_DFMT0_DFMT_SHIFT              (29U)
/*! DFMT - Domain format
 *  0b0..Processor-core domain assignment
 *  0b1..Non-processor domain assignment
 */
#define TRDC_MDA_W_DFMT0_DFMT(x)                 (((uint32_t)(((uint32_t)(x)) << TRDC_MDA_W_DFMT0_DFMT_SHIFT)) & TRDC_MDA_W_DFMT0_DFMT_MASK)

#define TRDC_MDA_W_DFMT0_LK1_MASK                (0x40000000U)
#define TRDC_MDA_W_DFMT0_LK1_SHIFT               (30U)
/*! LK1 - 1-bit Lock
 *  0b0..Register can be written by any secure privileged write.
 *  0b1..Register is locked (read-only) until the next reset.
 */
#define TRDC_MDA_W_DFMT0_LK1(x)                  (((uint32_t)(((uint32_t)(x)) << TRDC_MDA_W_DFMT0_LK1_SHIFT)) & TRDC_MDA_W_DFMT0_LK1_MASK)

#define TRDC_MDA_W_DFMT0_VLD_MASK                (0x80000000U)
#define TRDC_MDA_W_DFMT0_VLD_SHIFT               (31U)
/*! VLD - Valid
 *  0b0..The Wr domain assignment is invalid.
 *  0b1..The Wr domain assignment is valid.
 */
#define TRDC_MDA_W_DFMT0_VLD(x)                  (((uint32_t)(((uint32_t)(x)) << TRDC_MDA_W_DFMT0_VLD_SHIFT)) & TRDC_MDA_W_DFMT0_VLD_MASK)
/*! @} */

/* The count of TRDC_MDA_W_DFMT0 */
#define TRDC_MDA_W_DFMT0_COUNT                   (6U)

/* The count of TRDC_MDA_W_DFMT0 */
#define TRDC_MDA_W_DFMT0_COUNT2                  (7U)

/*! @name MDA_W_DFMT1 - DAC Master Domain Assignment Register */
/*! @{ */

#define TRDC_MDA_W_DFMT1_DID_MASK                (0xFU)
#define TRDC_MDA_W_DFMT1_DID_SHIFT               (0U)
/*! DID - Domain identifier */
#define TRDC_MDA_W_DFMT1_DID(x)                  (((uint32_t)(((uint32_t)(x)) << TRDC_MDA_W_DFMT1_DID_SHIFT)) & TRDC_MDA_W_DFMT1_DID_MASK)

#define TRDC_MDA_W_DFMT1_PA_MASK                 (0x30U)
#define TRDC_MDA_W_DFMT1_PA_SHIFT                (4U)
/*! PA - Privileged attribute
 *  0b00..Force the bus attribute for this master to user.
 *  0b01..Force the bus attribute for this master to privileged.
 *  0b10..Use the bus master's privileged/user attribute directly.
 *  0b11..Use the bus master's privileged/user attribute directly.
 */
#define TRDC_MDA_W_DFMT1_PA(x)                   (((uint32_t)(((uint32_t)(x)) << TRDC_MDA_W_DFMT1_PA_SHIFT)) & TRDC_MDA_W_DFMT1_PA_MASK)

#define TRDC_MDA_W_DFMT1_SA_MASK                 (0xC0U)
#define TRDC_MDA_W_DFMT1_SA_SHIFT                (6U)
/*! SA - Secure attribute
 *  0b00..Force the bus attribute for this master to secure.
 *  0b01..Force the bus attribute for this master to nonsecure.
 *  0b10..Use the bus master's secure/nonsecure attribute directly.
 *  0b11..Use the bus master's secure/nonsecure attribute directly.
 */
#define TRDC_MDA_W_DFMT1_SA(x)                   (((uint32_t)(((uint32_t)(x)) << TRDC_MDA_W_DFMT1_SA_SHIFT)) & TRDC_MDA_W_DFMT1_SA_MASK)

#define TRDC_MDA_W_DFMT1_DIDB_MASK               (0x100U)
#define TRDC_MDA_W_DFMT1_DIDB_SHIFT              (8U)
/*! DIDB - DID Bypass
 *  0b0..Use MDAn[3:0] as the domain identifier.
 *  0b1..Use the DID input as the domain identifier.
 */
#define TRDC_MDA_W_DFMT1_DIDB(x)                 (((uint32_t)(((uint32_t)(x)) << TRDC_MDA_W_DFMT1_DIDB_SHIFT)) & TRDC_MDA_W_DFMT1_DIDB_MASK)

#define TRDC_MDA_W_DFMT1_DFMT_MASK               (0x20000000U)
#define TRDC_MDA_W_DFMT1_DFMT_SHIFT              (29U)
/*! DFMT - Domain format
 *  0b0..Processor-core domain assignment
 *  0b1..Non-processor domain assignment
 */
#define TRDC_MDA_W_DFMT1_DFMT(x)                 (((uint32_t)(((uint32_t)(x)) << TRDC_MDA_W_DFMT1_DFMT_SHIFT)) & TRDC_MDA_W_DFMT1_DFMT_MASK)

#define TRDC_MDA_W_DFMT1_LK1_MASK                (0x40000000U)
#define TRDC_MDA_W_DFMT1_LK1_SHIFT               (30U)
/*! LK1 - 1-bit Lock
 *  0b0..Register can be written by any secure privileged write.
 *  0b1..Register is locked (read-only) until the next reset.
 */
#define TRDC_MDA_W_DFMT1_LK1(x)                  (((uint32_t)(((uint32_t)(x)) << TRDC_MDA_W_DFMT1_LK1_SHIFT)) & TRDC_MDA_W_DFMT1_LK1_MASK)

#define TRDC_MDA_W_DFMT1_VLD_MASK                (0x80000000U)
#define TRDC_MDA_W_DFMT1_VLD_SHIFT               (31U)
/*! VLD - Valid
 *  0b0..The Wr domain assignment is invalid.
 *  0b1..The Wr domain assignment is valid.
 */
#define TRDC_MDA_W_DFMT1_VLD(x)                  (((uint32_t)(((uint32_t)(x)) << TRDC_MDA_W_DFMT1_VLD_SHIFT)) & TRDC_MDA_W_DFMT1_VLD_MASK)
/*! @} */

/* The count of TRDC_MDA_W_DFMT1 */
#define TRDC_MDA_W_DFMT1_COUNT                   (5U)

/* The count of TRDC_MDA_W_DFMT1 */
#define TRDC_MDA_W_DFMT1_COUNT2                  (1U)

/*! @name MBC_MEM_GLBCFG - MBC Global Configuration Register */
/*! @{ */

#define TRDC_MBC_MEM_GLBCFG_NBLKS_MASK           (0x3FFU)
#define TRDC_MBC_MEM_GLBCFG_NBLKS_SHIFT          (0U)
/*! NBLKS - Number of blocks in this memory */
#define TRDC_MBC_MEM_GLBCFG_NBLKS(x)             (((uint32_t)(((uint32_t)(x)) << TRDC_MBC_MEM_GLBCFG_NBLKS_SHIFT)) & TRDC_MBC_MEM_GLBCFG_NBLKS_MASK)

#define TRDC_MBC_MEM_GLBCFG_SIZE_LOG2_MASK       (0x1F0000U)
#define TRDC_MBC_MEM_GLBCFG_SIZE_LOG2_SHIFT      (16U)
/*! SIZE_LOG2 - Log2 size per block */
#define TRDC_MBC_MEM_GLBCFG_SIZE_LOG2(x)         (((uint32_t)(((uint32_t)(x)) << TRDC_MBC_MEM_GLBCFG_SIZE_LOG2_SHIFT)) & TRDC_MBC_MEM_GLBCFG_SIZE_LOG2_MASK)
/*! @} */

/* The count of TRDC_MBC_MEM_GLBCFG */
#define TRDC_MBC_MEM_GLBCFG_COUNT                (2U)

/* The count of TRDC_MBC_MEM_GLBCFG */
#define TRDC_MBC_MEM_GLBCFG_COUNT2               (4U)

/*! @name MBC_NSE_BLK_INDEX - MBC NonSecure Enable Block Index */
/*! @{ */

#define TRDC_MBC_NSE_BLK_INDEX_AI_MASK           (0x1U)
#define TRDC_MBC_NSE_BLK_INDEX_AI_SHIFT          (0U)
/*! AI - Auto Increment
 *  0b0..No effect.
 *  0b1..Add 1 to the WNDX field after the register write.
 */
#define TRDC_MBC_NSE_BLK_INDEX_AI(x)             (((uint32_t)(((uint32_t)(x)) << TRDC_MBC_NSE_BLK_INDEX_AI_SHIFT)) & TRDC_MBC_NSE_BLK_INDEX_AI_MASK)

