JayHeng/imxrt-tool-flash-algo/boards/nxp_evkmimxrt1180_rev.c/flash_algo_c0_silicon/Keil_JLink/rom_api/MIMXRT1189_cm7.h
#define TRDC_MBC_DOM12_MEM1_BLK_NSE_W_BIT10_MASK (0x400U)
#define TRDC_MBC_DOM12_MEM1_BLK_NSE_W_BIT10_SHIFT (10U)
/*! BIT10 - Bit b NonSecure Enable [b = 0 - 31]
 *  0b0..Secure accesses to block B are based on corresponding MBACSEL field in register
 *       (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]), nonsecure accesses to block B are not allowed.
 *  0b1..Secure accesses to block B are not allowed, nonsecure accesses to block B are based on corresponding
 *       MBACSEL field in register (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]).
 */
#define TRDC_MBC_DOM12_MEM1_BLK_NSE_W_BIT10(x)   (((uint32_t)(((uint32_t)(x)) << TRDC_MBC_DOM12_MEM1_BLK_NSE_W_BIT10_SHIFT)) & TRDC_MBC_DOM12_MEM1_BLK_NSE_W_BIT10_MASK)

#define TRDC_MBC_DOM12_MEM1_BLK_NSE_W_BIT11_MASK (0x800U)
#define TRDC_MBC_DOM12_MEM1_BLK_NSE_W_BIT11_SHIFT (11U)
/*! BIT11 - Bit b NonSecure Enable [b = 0 - 31]
 *  0b0..Secure accesses to block B are based on corresponding MBACSEL field in register
 *       (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]), nonsecure accesses to block B are not allowed.
 *  0b1..Secure accesses to block B are not allowed, nonsecure accesses to block B are based on corresponding
 *       MBACSEL field in register (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]).
 */
#define TRDC_MBC_DOM12_MEM1_BLK_NSE_W_BIT11(x)   (((uint32_t)(((uint32_t)(x)) << TRDC_MBC_DOM12_MEM1_BLK_NSE_W_BIT11_SHIFT)) & TRDC_MBC_DOM12_MEM1_BLK_NSE_W_BIT11_MASK)

#define TRDC_MBC_DOM12_MEM1_BLK_NSE_W_BIT12_MASK (0x1000U)
#define TRDC_MBC_DOM12_MEM1_BLK_NSE_W_BIT12_SHIFT (12U)
/*! BIT12 - Bit b NonSecure Enable [b = 0 - 31]
 *  0b0..Secure accesses to block B are based on corresponding MBACSEL field in register
 *       (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]), nonsecure accesses to block B are not allowed.
 *  0b1..Secure accesses to block B are not allowed, nonsecure accesses to block B are based on corresponding
 *       MBACSEL field in register (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]).
 */
#define TRDC_MBC_DOM12_MEM1_BLK_NSE_W_BIT12(x)   (((uint32_t)(((uint32_t)(x)) << TRDC_MBC_DOM12_MEM1_BLK_NSE_W_BIT12_SHIFT)) & TRDC_MBC_DOM12_MEM1_BLK_NSE_W_BIT12_MASK)

#define TRDC_MBC_DOM12_MEM1_BLK_NSE_W_BIT13_MASK (0x2000U)
#define TRDC_MBC_DOM12_MEM1_BLK_NSE_W_BIT13_SHIFT (13U)
/*! BIT13 - Bit b NonSecure Enable [b = 0 - 31]
 *  0b0..Secure accesses to block B are based on corresponding MBACSEL field in register
 *       (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]), nonsecure accesses to block B are not allowed.
 *  0b1..Secure accesses to block B are not allowed, nonsecure accesses to block B are based on corresponding
 *       MBACSEL field in register (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]).
 */
#define TRDC_MBC_DOM12_MEM1_BLK_NSE_W_BIT13(x)   (((uint32_t)(((uint32_t)(x)) << TRDC_MBC_DOM12_MEM1_BLK_NSE_W_BIT13_SHIFT)) & TRDC_MBC_DOM12_MEM1_BLK_NSE_W_BIT13_MASK)

#define TRDC_MBC_DOM12_MEM1_BLK_NSE_W_BIT14_MASK (0x4000U)
#define TRDC_MBC_DOM12_MEM1_BLK_NSE_W_BIT14_SHIFT (14U)
/*! BIT14 - Bit b NonSecure Enable [b = 0 - 31]
 *  0b0..Secure accesses to block B are based on corresponding MBACSEL field in register
 *       (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]), nonsecure accesses to block B are not allowed.
 *  0b1..Secure accesses to block B are not allowed, nonsecure accesses to block B are based on corresponding
 *       MBACSEL field in register (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]).
 */
#define TRDC_MBC_DOM12_MEM1_BLK_NSE_W_BIT14(x)   (((uint32_t)(((uint32_t)(x)) << TRDC_MBC_DOM12_MEM1_BLK_NSE_W_BIT14_SHIFT)) & TRDC_MBC_DOM12_MEM1_BLK_NSE_W_BIT14_MASK)

#define TRDC_MBC_DOM12_MEM1_BLK_NSE_W_BIT15_MASK (0x8000U)
#define TRDC_MBC_DOM12_MEM1_BLK_NSE_W_BIT15_SHIFT (15U)
/*! BIT15 - Bit b NonSecure Enable [b = 0 - 31]
 *  0b0..Secure accesses to block B are based on corresponding MBACSEL field in register
 *       (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]), nonsecure accesses to block B are not allowed.
 *  0b1..Secure accesses to block B are not allowed, nonsecure accesses to block B are based on corresponding
 *       MBACSEL field in register (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]).
 */
#define TRDC_MBC_DOM12_MEM1_BLK_NSE_W_BIT15(x)   (((uint32_t)(((uint32_t)(x)) << TRDC_MBC_DOM12_MEM1_BLK_NSE_W_BIT15_SHIFT)) & TRDC_MBC_DOM12_MEM1_BLK_NSE_W_BIT15_MASK)

#define TRDC_MBC_DOM12_MEM1_BLK_NSE_W_BIT16_MASK (0x10000U)
#define TRDC_MBC_DOM12_MEM1_BLK_NSE_W_BIT16_SHIFT (16U)
/*! BIT16 - Bit b NonSecure Enable [b = 0 - 31]
 *  0b0..Secure accesses to block B are based on corresponding MBACSEL field in register
 *       (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]), nonsecure accesses to block B are not allowed.
 *  0b1..Secure accesses to block B are not allowed, nonsecure accesses to block B are based on corresponding
 *       MBACSEL field in register (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]).
 */
#define TRDC_MBC_DOM12_MEM1_BLK_NSE_W_BIT16(x)   (((uint32_t)(((uint32_t)(x)) << TRDC_MBC_DOM12_MEM1_BLK_NSE_W_BIT16_SHIFT)) & TRDC_MBC_DOM12_MEM1_BLK_NSE_W_BIT16_MASK)

#define TRDC_MBC_DOM12_MEM1_BLK_NSE_W_BIT17_MASK (0x20000U)
#define TRDC_MBC_DOM12_MEM1_BLK_NSE_W_BIT17_SHIFT (17U)
/*! BIT17 - Bit b NonSecure Enable [b = 0 - 31]
 *  0b0..Secure accesses to block B are based on corresponding MBACSEL field in register
 *       (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]), nonsecure accesses to block B are not allowed.
 *  0b1..Secure accesses to block B are not allowed, nonsecure accesses to block B are based on corresponding
 *       MBACSEL field in register (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]).
 */
#define TRDC_MBC_DOM12_MEM1_BLK_NSE_W_BIT17(x)   (((uint32_t)(((uint32_t)(x)) << TRDC_MBC_DOM12_MEM1_BLK_NSE_W_BIT17_SHIFT)) & TRDC_MBC_DOM12_MEM1_BLK_NSE_W_BIT17_MASK)

#define TRDC_MBC_DOM12_MEM1_BLK_NSE_W_BIT18_MASK (0x40000U)
#define TRDC_MBC_DOM12_MEM1_BLK_NSE_W_BIT18_SHIFT (18U)
/*! BIT18 - Bit b NonSecure Enable [b = 0 - 31]
 *  0b0..Secure accesses to block B are based on corresponding MBACSEL field in register
 *       (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]), nonsecure accesses to block B are not allowed.
 *  0b1..Secure accesses to block B are not allowed, nonsecure accesses to block B are based on corresponding
 *       MBACSEL field in register (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]).
 */
#define TRDC_MBC_DOM12_MEM1_BLK_NSE_W_BIT18(x)   (((uint32_t)(((uint32_t)(x)) << TRDC_MBC_DOM12_MEM1_BLK_NSE_W_BIT18_SHIFT)) & TRDC_MBC_DOM12_MEM1_BLK_NSE_W_BIT18_MASK)

#define TRDC_MBC_DOM12_MEM1_BLK_NSE_W_BIT19_MASK (0x80000U)
#define TRDC_MBC_DOM12_MEM1_BLK_NSE_W_BIT19_SHIFT (19U)
/*! BIT19 - Bit b NonSecure Enable [b = 0 - 31]
 *  0b0..Secure accesses to block B are based on corresponding MBACSEL field in register
 *       (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]), nonsecure accesses to block B are not allowed.
 *  0b1..Secure accesses to block B are not allowed, nonsecure accesses to block B are based on corresponding
 *       MBACSEL field in register (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]).
 */
#define TRDC_MBC_DOM12_MEM1_BLK_NSE_W_BIT19(x)   (((uint32_t)(((uint32_t)(x)) << TRDC_MBC_DOM12_MEM1_BLK_NSE_W_BIT19_SHIFT)) & TRDC_MBC_DOM12_MEM1_BLK_NSE_W_BIT19_MASK)

#define TRDC_MBC_DOM12_MEM1_BLK_NSE_W_BIT20_MASK (0x100000U)
#define TRDC_MBC_DOM12_MEM1_BLK_NSE_W_BIT20_SHIFT (20U)
/*! BIT20 - Bit b NonSecure Enable [b = 0 - 31]
 *  0b0..Secure accesses to block B are based on corresponding MBACSEL field in register
 *       (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]), nonsecure accesses to block B are not allowed.
 *  0b1..Secure accesses to block B are not allowed, nonsecure accesses to block B are based on corresponding
 *       MBACSEL field in register (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]).
 */
#define TRDC_MBC_DOM12_MEM1_BLK_NSE_W_BIT20(x)   (((uint32_t)(((uint32_t)(x)) << TRDC_MBC_DOM12_MEM1_BLK_NSE_W_BIT20_SHIFT)) & TRDC_MBC_DOM12_MEM1_BLK_NSE_W_BIT20_MASK)

