JayHeng/imxrt-tool-flash-algo/boards/nxp_evkmimxrt1180_rev.c/flash_algo_c0_silicon/Keil_JLink/rom_api/MIMXRT1189_cm7.h
#define XBAR_NUM_OUT221_SEL_SEL130_MASK          (0xFFU)
#define XBAR_NUM_OUT221_SEL_SEL130_SHIFT         (0U)
/*! SEL130 - SEL130 */
#define XBAR_NUM_OUT221_SEL_SEL130(x)            (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL130_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL130_MASK)

#define XBAR_NUM_OUT221_SEL_SEL131_MASK          (0xFF00U)
#define XBAR_NUM_OUT221_SEL_SEL131_SHIFT         (8U)
/*! SEL131 - SEL131 */
#define XBAR_NUM_OUT221_SEL_SEL131(x)            (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL131_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL131_MASK)

#define XBAR_NUM_OUT221_SEL_SEL132_MASK          (0xFFU)
#define XBAR_NUM_OUT221_SEL_SEL132_SHIFT         (0U)
/*! SEL132 - SEL132 */
#define XBAR_NUM_OUT221_SEL_SEL132(x)            (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL132_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL132_MASK)

#define XBAR_NUM_OUT221_SEL_SEL133_MASK          (0xFF00U)
#define XBAR_NUM_OUT221_SEL_SEL133_SHIFT         (8U)
/*! SEL133 - SEL133 */
#define XBAR_NUM_OUT221_SEL_SEL133(x)            (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL133_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL133_MASK)

#define XBAR_NUM_OUT221_SEL_SEL134_MASK          (0xFFU)
#define XBAR_NUM_OUT221_SEL_SEL134_SHIFT         (0U)
/*! SEL134 - SEL134 */
#define XBAR_NUM_OUT221_SEL_SEL134(x)            (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL134_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL134_MASK)

#define XBAR_NUM_OUT221_SEL_SEL135_MASK          (0xFF00U)
#define XBAR_NUM_OUT221_SEL_SEL135_SHIFT         (8U)
/*! SEL135 - SEL135 */
#define XBAR_NUM_OUT221_SEL_SEL135(x)            (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL135_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL135_MASK)

#define XBAR_NUM_OUT221_SEL_SEL136_MASK          (0xFFU)
#define XBAR_NUM_OUT221_SEL_SEL136_SHIFT         (0U)
/*! SEL136 - SEL136 */
#define XBAR_NUM_OUT221_SEL_SEL136(x)            (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL136_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL136_MASK)

#define XBAR_NUM_OUT221_SEL_SEL137_MASK          (0xFF00U)
#define XBAR_NUM_OUT221_SEL_SEL137_SHIFT         (8U)
/*! SEL137 - SEL137 */
#define XBAR_NUM_OUT221_SEL_SEL137(x)            (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL137_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL137_MASK)

#define XBAR_NUM_OUT221_SEL_SEL138_MASK          (0xFFU)
#define XBAR_NUM_OUT221_SEL_SEL138_SHIFT         (0U)
/*! SEL138 - SEL138 */
#define XBAR_NUM_OUT221_SEL_SEL138(x)            (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL138_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL138_MASK)

#define XBAR_NUM_OUT221_SEL_SEL139_MASK          (0xFF00U)
#define XBAR_NUM_OUT221_SEL_SEL139_SHIFT         (8U)
/*! SEL139 - SEL139 */
#define XBAR_NUM_OUT221_SEL_SEL139(x)            (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL139_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL139_MASK)

#define XBAR_NUM_OUT221_SEL_SEL140_MASK          (0xFFU)
#define XBAR_NUM_OUT221_SEL_SEL140_SHIFT         (0U)
/*! SEL140 - SEL140 */
#define XBAR_NUM_OUT221_SEL_SEL140(x)            (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL140_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL140_MASK)

#define XBAR_NUM_OUT221_SEL_SEL141_MASK          (0xFF00U)
#define XBAR_NUM_OUT221_SEL_SEL141_SHIFT         (8U)
/*! SEL141 - SEL141 */
#define XBAR_NUM_OUT221_SEL_SEL141(x)            (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL141_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL141_MASK)

#define XBAR_NUM_OUT221_SEL_SEL142_MASK          (0xFFU)
#define XBAR_NUM_OUT221_SEL_SEL142_SHIFT         (0U)
/*! SEL142 - SEL142 */
#define XBAR_NUM_OUT221_SEL_SEL142(x)            (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL142_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL142_MASK)

#define XBAR_NUM_OUT221_SEL_SEL143_MASK          (0xFF00U)
#define XBAR_NUM_OUT221_SEL_SEL143_SHIFT         (8U)
/*! SEL143 - SEL143 */
#define XBAR_NUM_OUT221_SEL_SEL143(x)            (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL143_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL143_MASK)

#define XBAR_NUM_OUT221_SEL_SEL144_MASK          (0xFFU)
#define XBAR_NUM_OUT221_SEL_SEL144_SHIFT         (0U)
/*! SEL144 - SEL144 */
#define XBAR_NUM_OUT221_SEL_SEL144(x)            (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL144_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL144_MASK)

#define XBAR_NUM_OUT221_SEL_SEL145_MASK          (0xFF00U)
#define XBAR_NUM_OUT221_SEL_SEL145_SHIFT         (8U)
/*! SEL145 - SEL145 */
#define XBAR_NUM_OUT221_SEL_SEL145(x)            (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL145_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL145_MASK)

#define XBAR_NUM_OUT221_SEL_SEL146_MASK          (0xFFU)
#define XBAR_NUM_OUT221_SEL_SEL146_SHIFT         (0U)
/*! SEL146 - SEL146 */
#define XBAR_NUM_OUT221_SEL_SEL146(x)            (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL146_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL146_MASK)

#define XBAR_NUM_OUT221_SEL_SEL147_MASK          (0xFF00U)
#define XBAR_NUM_OUT221_SEL_SEL147_SHIFT         (8U)
/*! SEL147 - SEL147 */
#define XBAR_NUM_OUT221_SEL_SEL147(x)            (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL147_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL147_MASK)

#define XBAR_NUM_OUT221_SEL_SEL148_MASK          (0xFFU)
#define XBAR_NUM_OUT221_SEL_SEL148_SHIFT         (0U)
/*! SEL148 - SEL148 */
#define XBAR_NUM_OUT221_SEL_SEL148(x)            (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL148_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL148_MASK)

#define XBAR_NUM_OUT221_SEL_SEL149_MASK          (0xFF00U)
#define XBAR_NUM_OUT221_SEL_SEL149_SHIFT         (8U)
/*! SEL149 - SEL149 */
#define XBAR_NUM_OUT221_SEL_SEL149(x)            (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL149_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL149_MASK)

#define XBAR_NUM_OUT221_SEL_SEL150_MASK          (0xFFU)
#define XBAR_NUM_OUT221_SEL_SEL150_SHIFT         (0U)
/*! SEL150 - SEL150 */
#define XBAR_NUM_OUT221_SEL_SEL150(x)            (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL150_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL150_MASK)

#define XBAR_NUM_OUT221_SEL_SEL151_MASK          (0xFF00U)
#define XBAR_NUM_OUT221_SEL_SEL151_SHIFT         (8U)
/*! SEL151 - SEL151 */
#define XBAR_NUM_OUT221_SEL_SEL151(x)            (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL151_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL151_MASK)

#define XBAR_NUM_OUT221_SEL_SEL152_MASK          (0xFFU)
#define XBAR_NUM_OUT221_SEL_SEL152_SHIFT         (0U)
/*! SEL152 - SEL152 */
#define XBAR_NUM_OUT221_SEL_SEL152(x)            (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL152_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL152_MASK)

#define XBAR_NUM_OUT221_SEL_SEL153_MASK          (0xFF00U)
#define XBAR_NUM_OUT221_SEL_SEL153_SHIFT         (8U)
/*! SEL153 - SEL153 */
#define XBAR_NUM_OUT221_SEL_SEL153(x)            (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL153_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL153_MASK)

#define XBAR_NUM_OUT221_SEL_SEL154_MASK          (0xFFU)
#define XBAR_NUM_OUT221_SEL_SEL154_SHIFT         (0U)
/*! SEL154 - SEL154 */
#define XBAR_NUM_OUT221_SEL_SEL154(x)            (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL154_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL154_MASK)

