JayHeng/imxrt-tool-flash-algo/boards/nxp_evkmimxrt1180_rev.c/flash_algo_c0_silicon/Keil_JLink/rom_api/MIMXRT1189_cm7.h
/* The count of XBAR_NUM_OUT32_CTRL */
#define XBAR_NUM_OUT32_CTRL_COUNT                (1U)


/*!
 * @}
 */ /* end of group XBAR_NUM_OUT32_Register_Masks */


/* XBAR_NUM_OUT32 - Peripheral instance base addresses */
/** Peripheral XBAR2 base address */
#define XBAR2_BASE                               (0x42760000u)
/** Peripheral XBAR2 base pointer */
#define XBAR2                                    ((XBAR_NUM_OUT32_Type *)XBAR2_BASE)
/** Peripheral XBAR3 base address */
#define XBAR3_BASE                               (0x42770000u)
/** Peripheral XBAR3 base pointer */
#define XBAR3                                    ((XBAR_NUM_OUT32_Type *)XBAR3_BASE)
/** Array initializer of XBAR_NUM_OUT32 peripheral base addresses */
#define XBAR_NUM_OUT32_BASE_ADDRS                { XBAR2_BASE, XBAR3_BASE }
/** Array initializer of XBAR_NUM_OUT32 peripheral base pointers */
#define XBAR_NUM_OUT32_BASE_PTRS                 { XBAR2, XBAR3 }

/*!
 * @}
 */ /* end of group XBAR_NUM_OUT32_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic pop
  #else
    #pragma pop
  #endif
#elif defined(__CWCC__)
  #pragma pop
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


/* ----------------------------------------------------------------------------
   -- Macros for use with bit field definitions (xxx_SHIFT, xxx_MASK).
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Bit_Field_Generic_Macros Macros for use with bit field definitions (xxx_SHIFT, xxx_MASK).
 * @{
 */

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang system_header
  #endif
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma system_include
#endif

/**
 * @brief Mask and left-shift a bit field value for use in a register bit range.
 * @param field Name of the register bit field.
 * @param value Value of the bit field.
 * @return Masked and shifted value.
 */
#define NXP_VAL2FLD(field, value)    (((value) << (field ## _SHIFT)) & (field ## _MASK))
/**
 * @brief Mask and right-shift a register value to extract a bit field value.
 * @param field Name of the register bit field.
 * @param value Value of the register.
 * @return Masked and shifted bit field value.
 */
#define NXP_FLD2VAL(field, value)    (((value) & (field ## _MASK)) >> (field ## _SHIFT))

/*!
 * @}
 */ /* end of group Bit_Field_Generic_Macros */


/* ----------------------------------------------------------------------------
   -- SDK Compatibility
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SDK_Compatibility_Symbols SDK Compatibility
 * @{
 */

/* No SDK compatibility issues. */

/*!
 * @}
 */ /* end of group SDK_Compatibility_Symbols */


#endif  /* _MIMXRT1189_CM7_H_ */

